// [周易卦辞,传统解卦,张明仁解卦,高岛易断]
const GUA_EXTRA_1 = [
    `乾:元亨利贞.
    
彖曰:大哉乾元,万物资始,乃统天.云行雨施,品物流形.大明始终,六位时成,时乘六龙以御天.乾道变化,各正性命,保合大和,乃利贞.首出庶物,万国咸宁.
    
象曰:天行健,君子以自强不息.\n初九:潜龙勿用.象曰:潜龙勿用,阳在下也.
    
九二:见龙在田,利见大人.象曰:见龙在田,德施普也.
    
九三:君子终日乾乾,夕惕若；厉,无咎.象曰:终日乾乾,反复道也.
    
九四:或跃在渊,无咎.象曰:或跃在渊,进无咎也.
    
九五:飞龙在天,利见大人.象曰:飞龙在天,大人造也.
    
上九:亢龙有悔.象曰:亢龙有悔,盈不可久也.`,
    `这个卦是同卦(下乾上乾)相叠.象征天,喻龙(德才的君子),又象征纯粹的阳和健,表明兴盛强健.乾卦是根据万物变通的道理,以“元,亨,利,贞”为卦辞,表示吉祥如意,教导人遵守天道的德行.
    
大象:天行刚健,自强不息.
    
运势:飞龙在天,名利双收之象,宜把握机会,争取成果.
    
事业:大吉大利,万事如意,心想事成,自有天佑,春风得意,事业如日中天.但阳气已达顶点,盛极必衰,务须提高警惕,小心谨慎.力戒骄傲,冷静处世,心境平和,如是则能充分发挥才智,保证事业成功.
    
经商:十分顺利,有发展向上的大好机会.但切勿操之过急,宜冷静分析形势,把握时机,坚持商业道德,冷静对待中途出现的困难,定会有满意的结果.
    
求名:潜在能力尚未充分发挥,只要进一步努力,克服骄傲自满情绪,进业修德,以渊博学识和高尚品质,成君子之名.
    
婚恋:阳盛阴衰,但刚柔可相济,形成美满结果.女性温柔者更佳.
    
决策:可成就大的事业.坚持此卦的刚健,正直,公允的实质,修养德行,积累知识,坚定信念,自强不息,必能克服困难,消除灾难.`,
    `天,表示极阳之象,为纯卦,六冲卦,是大好,大坏的卦象.对事一般为吉象,为主管,负责任,可以任用担当大事,或开业当老板,得此卦都属吉象,只是必须有一个好的助理更佳,升官,考试,升迁都较有利.

解释:刚健稳固

特性:积极,刚毅,努力,认真,有耐性,坚忍,正派,主动,慷慨,严律,重名誉.

运势:有地位擢升,名利双收之象,功名荣显得贵子.六亲和睦,凡事谦和为贵可吉

家运:繁昌兴隆,须小心口舌之争.

疾病:病情恶化,宜细心调养,注意头,脑,骨髓等病变.胎孕:有不安之兆,宜小心保养

子女:儿女健康,幸福有为.

周转:虽不成问题,尚宜心平气和来处理.买卖:小利可得,大则勿取,勿太张扬为吉.

等人:一定会来.

寻人:已远走高飞,不易找到,在西北方向.失物:可望寻回

外出:利于出行,结伴而行更佳考试:有望取得好成绩.

诉讼:宜据理力争.

求事:有贵人提拔,可发展,称心.改行:占得此卦不宜改行.

开业:开业者需要耐心观望.`,
    `问天气:二、三、四、五爻如果发生变动,一定是晴天。

问买卖:不利于买而利于卖。

问祸福:所谓“积善之家,必有余庆；积不善之家,必有余殃”,恐怕不是应验在当代人身上,而是应验在后代身上。

问常人:有置身过高,不了解日常事务的忧虑。

问贤人:有知道天命而独自行道之象。恐怕成群的阴柔潜伏,有被众多小人用谗言罗织陷害的危险。

初爻

问征战:乾为武人,有征战之象。初爻阳气开始发动于黄泉,还处于潜伏状态,故称“潜龙”。在军事,象征军令刚刚下达,大军还没有集结起来的时候,所以应该按兵不动,等待条件成熟。吉。

问经商:龙在潜隐状态而说“勿用”,可见虽然是一种好贸易,但是只可以安居守分,不可急于行动。

问功名:龙本是飞黄腾达的动物,而初爻却说潜,说明没到风云际会的时候,所以又说“位在下”。

问婚姻:乾卦初爻变阴则全卦为姤,姤卦说“女壮,勿用取女”,所以应当戒止。

问家宅:震为龙,在东方,说明住宅的东面必定有深水。这水闭塞不流,应该加以修凿,使它流动。

问胎孕:生男孩。

二爻

问征战:龙本来属于灵物。初爻说潜,是指伏兵。二爻说见,是从潜隐中出现而可见了。又说“在田”,一定列阵在田野等空旷的地方。《象传》说“德施普也”,指一定会得胜而论功行赏。

问经商:爻辞说“见龙在田”,可知货物大体是米麦丝棉之类。见,指物价开始上涨；“利见大人”,是说应当有官场人物出来购买。

问功名:隐伏在田间的人,应当乘时上进,发挥作用。会得到贵人的帮助,所以说“利见大人”。

问婚姻:二爻和五爻相应,五爻为地位崇高,主女婿家必定尊贵。说“见龙”,一定是刚刚被任用的年轻人。大吉。

问胎孕:生男孩,并且主贵。

三爻

问征战:征战是危险的事情。爻辞说“终日乾乾,夕惕若”,说明问卦者能“临事而惧”,所以没有灾祸。

问功名:九三在下卦的上位,而在全卦则爻位还低,象征功名还不显著,所以称君子；在多忧患和危险的位置,所以说“乾乾”、“惕若”,这样才能避免灾祸。

问经商:居于不得中的位置,行走于“重刚”的险地,想来贸易处一定是个危险的地方,日夜防备才能脱险而获利。

问家宅:观察爻象,必须谨慎地把持自身,勤劳节俭地保持家业,这样才没有灾祸。

问婚嫁:三爻以上九为应爻,三爻地位低,上爻地位高。高则不免过亢而有悔恨,所以不宜向地位高的人攀结亲事。

问胎孕:生男孩。生产时稍有危险和惊惧,但最终没有灾祸。

四爻

问征战:观察爻象,在行军前进的时候,一定有深水阻隔,应该安排船或筏；或者在临渊处有敌军埋伏,应当预先设防,才能避免灾咎。

问经商:爻辞说“或跃在渊”,如果贩运海货,恐怕有遇到波涛的危险。或许物价一时上涨,但爻辞说“无咎”,可以保证无害。

问功名:有一举成名之象,大吉。\n问家宅:渊是水,跃是飞跃,家道有一时振兴之象。

问胎孕:生男孩。

五爻

问征战:九五居君位,一定是天子御驾亲征,以王者之师讨伐有罪的人,所以说“大人造”。

问经商:九五爻辰在申,在天上值毕宿,附星有咸池。咸池是苍龙的宅舍,也叫五车,主稻黍豆麦,所以他的贸易一定是五谷之类。说“飞龙”,可以知道物价的飞升；说“利见大人”,可知贩运或许出自政府的命令。

问功名:有直达云霄之象。

问疾病:有应上天的召唤之象,不吉。

问胎孕:生男孩,主尊责。

上爻

问征战:上九居乾卦的极位,以阳爻在上位,所以亢；亢就会因为胜利而骄傲,所以“有悔”。《象传》说“盈不可久”,可知征战无法持久。

问经商:亢是太过的意思。买卖之道,不可以过分追求盈利,过于盈利就一定会发生亏损,所以说“不可久”。

问功名:上九的位置已到极致,应该自己返身后退,否则必定因为盈满而遭受损害。

问家宅:一定是宅基太高。太高就危险,也是值得畏惧的。

问疾病:是龙阳上升的病症。《象传》说“盈不可久”,可知性命已经在旦夕之间了。可怕。

问婚嫁:不利。

问胎孕:生男孩,恐怕养不大。`
]
const GUA_EXTRA_2 = [
    `坤：元，亨，利牝马之贞.君子有攸往，先迷后得主，利西南得朋，东北丧朋安贞，吉

彖曰：至哉坤元，万物资生，乃顺承天.坤厚载物，德合无疆.含弘光大，品物咸亨.牝马地类，行地无疆，柔顺利贞.君子攸行，先迷失道，后顺得常.西南得朋，乃与类行；东北丧朋，乃终有庆.安贞之吉应地无疆

象曰：履霜坚冰，阴始凝也.驯致其道，至坚冰也

初六：履霜坚冰至

六二：直，方，大，不习无不利.象曰：六二之动，直以方也.不习无不利地道光也

六三：含章可贞.或从王事，无成有终.象曰：含章可贞；以时发也或从王事知光大也

六四：括囊；无咎，无誉.象曰：括囊无咎，慎不害也.六五：黄裳，元吉.象曰：黄裳元吉，文在中也

上六：战龙於野，其血玄黄.象曰：战龙於野，其道穷也

用六：利永贞.象曰：用六永贞，以大终也`,
    `这个卦是同卦（下坤上坤）相叠，阴性.象征地（与乾卦相反），顺从天.承载万物，伸展无穷无尽.坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺.它以“先迷后得”证明“坤“顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利.

大象：大地承载万物，以德服众，仁者无敌运势：诸事不宜急进，以静制动为宜

事业：诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰.切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行.取得朋友的关心和支持最为重要，在他人的合作下.共同完成事业.因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率，方正，含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功.

经商：机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验.注意储存货物，待价而沽，处处小心为是

求名：比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥

婚恋：阴盛.以柔克刚，女方柔顺，美好姻缘，白头到老.

决策：忠厚，温和，待人真诚，热心助人，因此也能得到他人的帮助，可往往因不提防小人而受到伤害，但无大碍.性格灵活，工作方法多样，可以左右逢源，得到赞许`,
    `地，表示大地为母，天生之母性也.六冲纯卦，主大好大坏之卦象.优点，如母亲般地柔顺，牺牲，付出，有事事和顺之意.缺点，过于委缺求全，没有了自己的想法和观念.此卦论感情，有前世因缘的影响，自己就有如母亲大姊般地照顾对方，无怨无悔，会很辛苦，多劳累.事业，适合当任副手之职位，忌任主事者，容易软弱难成事.

解释：在母胎里孕育中，不宜创业

特性：为人较为保守，善于计划与研究工作，适合任辅佐幕僚之职，做人朴实，人缘佳，大好人型，男性桃花多，女性则爱情专一运势：诸事不宜急进，退守以静制动者吉.坤者大地平静，任其他物所摧而不为所动者大利也.若醉心私欲，违背常理，则有无妄之灾

家运：幸福平静之象

疾病：病情严重，为腹，肠胃，肌肉等慢性病（腹疾，脾胃之疾，饮食停滞从而食不化)

胎孕生贵子女儿亦福

子女：儿女众多，和睦幸福也周转：须耐心去求，否则难成买卖：勿急交易可成

等人：不会来须再待些时日

寻人：此人为色情之事出走，于西南方附近之地也失物：难以寻回，大部份均不知下落

外出：宜结伴而行.可去陌生的地方考试：希望不大

诉讼：防房地产之争，宜和解，有始无终之兆求事：不称意亦不理想，另寻

改行：改行不利宜固守本份

开业：开业者再观望，目前尚未筹备妥当，不宜`,
    `问征战：坤为地，为众。势是有力量的意思。就行军打仗来说，既得地利又得势力，还得到了兵众，理应攻无不克。问功名：有上等智慧的人能效法坤卦的深厚德行，积功累德，以至流光溢彩，声名自然显达。

问经商：坤为富，为财，为积，为聚，都是经商的吉兆。说“厚德载物”，德是得的意思，可以有求必得，满载而归。问家宅：可知住宅在地势上占有优势，大吉。

问婚嫁：坤是顺的意思，柔顺就是了，这是地道，也是妇道。大吉。

问胎孕：生女孩。

初爻

问经商：初六阴气还很微弱，说“履霜，坚冰至”，是从微弱推论到盛大，犹如商业从小到大，通过逐渐积累而致富。问功名：初爻象征年轻人刚刚上进的时候，地位由卑微到尊贵，犹如“履霜”而“至坚冰”，随着时间而来，不可躁进。

问征战：初爻是阴气的开始，有“履霜”之象；到上爻“龙战”，则是阴气的极致，有“坚冰”之象。上爻说“其血玄黄”，指两败俱伤。所以应当先审慎于事情的开始。

问家宅：坤是纯阴的卦，而初爻阴气还微弱，所以说“履霜”；“坚冰至”，则阴气已经旺盛了。阴气旺盛了就会衰弱，是不吉的征兆。

问婚嫁：坤卦纯阴，说霜说冰都是阴象。纯阴而无阳，不利。

问胎孕：生女孩。

问疾病：恐怕是阴邪的病症。初起的时候可以治疗，日子一久就难治了。

二爻

问经商：六二是坤卦的本位，“直方”是地的性质，大是地的作用。由此可知，所经营的商业必定是土地所产，如谷米、木材、丝棉之类。“不习无不利”，“习”与“袭”相通，指不必重新占筮，就知道能够获利。

问功名：二爻居中正的爻位，行动就会获利，指不需要修养，功名就会自然成就，其成名是必然的

问征战：征战的事以得到有利的地势为要点。依法行动，气势大，力量强，可以通过一次作战而平定地方。

问家宅：六二居中得正，主家宅适宜，所以说“地道光”。问嫁娶：“直方大”是地道，而妻道通于地道，所以婚娶也有利。

问疾病：爻辞说“直方大”，可知这人平素身体强壮，不必用药就有喜庆。

问胎孕：生女孩。

三爻

问征战：爻辞说“含章可贞”，是说平时含蓄才智而不显露，一旦做事，自然能够制胜，即使不成功也不会有大的失败。所以说“无成有终”。

问经商：坤为地，各种货物都产生于地，而商人能蓄积各种货物，故说“含章”。凡从事商业的人，因时宜而贩运各种货物出售，故说“以时发”。内卦到第三爻就到了极处，正是盛满的位置，故说“光大”。所以一时虽然或许没有取得成功，但是一定会有结果，吉。

问功名：求功名的人最应该等待时机。时运不宜行动，就“含章可贞”；时运应当行动，就出来“从王事”。懂得这个道理的人，一定能始终保持功名。吉。

问疾病：玩味“无成有终”一语的含义，可知已经不可救药了。凶

问胎孕：生女孩。

四爻

问经商：六四是巽爻，巽为商，为利，即《说卦传》所谓巽近利市三倍。爻辞说“括囊”，可知过去一定曾经得到利益，钱财已收入囊中，不再拿出来了，所以说“括囊，无咎无誉问征战：六四是重阴的一爻，正值闭塞的时候，即使有智囊的才能也无处运用。这表示宜于闭关不战，像括结囊口一样，这样就没有祸咎了。

问功名：六四是上卦的初爻，变阳则为否卦的九四，所以《文言》说“天地闭”。“括囊”就是闭结囊口。天地尚且闭塞，还有什么功名可求？如果虚妄地追求功名，只足以导致祸患。有名誉反而就有祸害了，应当审慎

问家宅：六四以阴爻居阴位，所居不是中位，住宅一定在山谷幽僻处，适宜隐遁的人居住

问胎孕：生女孩，或许会得到两个孪生女儿。

五爻
问征战：坤为臣道，五居君位，是人臣中极尊贵的人，就像舜投政时惩罚共工、欢兜、三苗和螺四区，周公摄政时株杀管叔和蔡叔一样。辞说“黄裳，元吉”，说明是由文德发越而成就武功的人，所以《文言》说“文在中”。

问功名：六五支辰在卵，得到了震卦之气，而震卦有功名振兴之象。五又是离卦的主艾，离为黄色，卦位接近午，在天上值七星，而七星主衣裳文绣，所以说“黄裳”。离又为明，有文明发达之象，所以说文在中。

问经商：坤卦的五变阳则全卦为比，比卦吉祥，是辅助的意思。商业一定要得到亲比和辅助才能成功。比卦的下卦为坤，上卦为坎，而坤为裳，所以说“黄裳”；比为美，所以说文在中”。由此可知，所经营的商业必定是锦绣的服饰之类。说“元吉”，一定会获得利润。

问疾病：坤为大腹，黄为中色，裳为下体的服饰，可见病在中下两焦。

问胎孕：生女孩。

上爻
问征战：卦象已经明白表示，结果是两败俱伤

问功名：上爻处在外卦的极位，是老年参加科举考试。抑塞已经很久，这次又将失败，值得悲衰。

问经商：上六居坤卦的终，前面的道路已经穷尽，象征钱财用尽后，血本又运到亏损，商业没办法经营下去了。

问疾病：一定是阴亏的病症。阴极盛而对抗阳，肝血暴烈流动，已经到了命终的时候。

问胎孕：阴爻因为穷尽而变阳，有生男孩的希望`
]
const GUA_EXTRA_3 = [
    `屯：元，亨，利，贞，勿用，有攸往，利建侯

彖曰：屯，刚柔始交而难生，动乎险中，大亨贞.雷雨之动满盈，天造草昧宜建侯而不宁

象曰：云雷屯；君子以经纶

初九：磐桓；利居贞，利建侯.象曰：虽磐桓，志行正也.以贵下贱，大得民也

六二：屯如邅如，乘马班如.匪寇婚媾，女子贞不字，十年乃字.象曰：六二之难，乘刚也.十年乃字，反常也

六三：既鹿无虞，惟入于林中，君子几不如舍，往吝.象曰：既鹿无虞，以纵禽也.君子舍之，往吝穷也

六四：乘马班如，求婚媾，无不利.象曰：求而往，明也

九五：屯其膏，小贞吉，大贞凶.象曰：屯其膏，施未光也

上六：乘马班如，泣血涟如.象曰：泣血涟如，何可长也`,
    `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险.雷雨交加，险象丛生，环境恶劣.“屯”原指植物萌生大地.万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣

大象：屯者难也，万事欲进而不得进

运势：身处困境，步步为营，有初难后解之意

事业：起初多不利，必知难而进，小心翼翼，勇往直前，灵活机动，可望获得大的成功，时机到来时一定要抓住，却也不得操之太急，且仍有困难，务必有他人相助，故平时应多施恩惠

经商：创业初期步履艰难，多有挫折.坚定信念最重要，不要为表面现象所迷惑，应积极进取，行动果断，打开出路.若仍无法摆脱困境，则应退守保全，等待机会，再展宏图.

求名：积极争取，主动追求，可以成功

婚恋：好事多磨，忠贞纯洁，大胆追求，能够成功，婚姻美满

决策：初始困难，但若具有坚忍不拔的毅力和锲而不舍的奋斗精神，前途不可估量，但往往不为他人理解而陷于孤独苦闷，事业会因此处于困难状态，需要得到贤德之人的帮助才能摆脱如能以乐观主义精神处世，能取得成就`,
    `屯，表示刚出生的小草，主凶象，四大难卦第一卦.因为刚出生的小草，脆弱易折，表示凡事都会很困难，很容易就会夭折，失败.但是只要有心小心地护持，小草还是有机会长成大树的解释：不明不白

特性：理想远大，奋斗不懈，苦尽甘来，最后能达成目标，获得他人的肯定.一生困境多，烦恼厌烦多，朋友少助

运势：逆势，多有困惑，但不可妄进，宜守不宜进.坚定意志，凡事不可为一己之利而执意强行，皆有不成损破之象.宜步步为营排除困难，始可通达，有初难后解之象.

家运：多波折，若能努力排除困难，可得通顺

疾病：病在肠胃，足部或泌尿系统，不宜掉以轻心胎孕：不安产母有虚惊，但可无虑

子女：有辛苦，但以后可得安逸周转：困难重重须用心忍耐奔波买卖：不利交易有损 等人：不会来

寻人：出走者不知去向，难寻.东或北方去矣失物难以寻回

外出：慎重为好，有危险，宜改日动身考试：不理想

诉讼：小事粘滞纠缠，大事反无大害，宜和解求事：不利

改行：不宜

开业：不宜，有困难亦难成也`,
    `问功名：内卦为震，外卦为坎才是屯卦。震为雷，坎为云，故说“云雷”；震为出，坎为入，要出而又入，故说屯。另外震为人，为上，坎为经，为法，所以说“君子以经纶”，意思是君子怀抱经纶天下的才能，而运途正值屯难，应当等待行动的时机。

问征战：以勤劳的兵众守卫叫做屯。“云雷”相当于蓄势，“经纶“是指怀有才能，但是在屯难的时候，适宜固守而不适宜前进。

问经商：《彖传》说“刚柔始交而难生”，一定是初次经商凡创始的事业，多半苦于艰难。经纶是治丝的事，可知所经营的一定是丝棉之类。

问家宅：震为东方，坎为北方，震为动，坎为陷，恐怕住宅东北方有问题，应当加以整修

问婚姻：雷为阳气，云为阴气，“刚柔始交而难生”，象征初婚的时候双方不融洽，应当有适当的人劝解他们。

问胎孕：生男孩，恐怕开始生产时有险难。

初爻

问征战：“磐桓”，行而不进的样子。说“利居贞，利建侯”尽管值于屯难的时期，但是内心要以正自守，对外要求得贤人的辅佐，这样就会民心归附，众志成城，而终究没有不利问经商：初九爻辰在子，子在北方，在天上值虚宿，称作元枵。枵就是耗，虚也是耗的意思，不利于行商。如果能守正而任用别人，还有利可图。

问功名：得到的是初爻，必定是初次求名。“磐桓”，是要进步而做不到。重要的是志愿和行为正直，为人谦逊，主动居于下位，这样终究会有所得。

问家宅：“磐”字从“石”，所谓“安如磐石”，可知这家的宅基巩固。说“利居贞”，可知居住安稳；说“利建侯”，可知一定是贵人的宅第

问婚嫁：说“以贵下贱”，这是富贵人家的女子下嫁之象，吉。

问胎孕：得初爻，生男。

二爻

问婚嫁：爻辞说“匪寇婚媾”，明说是佳偶而不是怨偶；但又说“女子贞不字，十年乃字”，可知出嫁还需要等待。

问征战：六二以柔爻居柔位，有濡滞之象，故说“屯如”。《左氏春秋》有“有班马之声，齐师其遁”的话，古时还师归朝称班师，故说“班如”。可知军队不可急于前进，必须养精蓄锐，“十年”后才能获胜。

问经商：“媾”与“购”字发音相同，含义也相通。就货物的求购来说，有迟回不决的意思，所以说“屯如遭如”。又说“十年乃字”，十是据成数而言。货物不可长久积存，或者是十日或十月吧？

问功名：士人求名，犹如女子求嫁，说“屯如”、“如”、“班如”，都是说一时无法成名。“十年乃字”，十年后才是成名的时候。

问胎孕：生儿子。

三爻

问征战：爻辞说“即鹿无虞，惟入于林中”，正如说行军而没有向导，冒进到危险的地方。应当见机而退，否则必定遭遇凶险。

问经商：玩味爻辞，可知这人既不熟悉商业，也不熟悉地理，前去不但买不到货，反而有损失。舍弃这次出行，才可以无大害

问婚嫁：属于钻地穴翻墙头而求婚，没有前途。

问功名：干求荣耀，乞怜宠爱，士人之道已经穷尽了。

问胎孕：六三以阴爻居阳位，生男孩

四爻

问征战：“乘马班如”，是不清楚进攻的道路的缘故。清楚道路以后再前往就会所向无敌，所以说“往吉，无不利”。

问功名：士人把利器藏在身上而等待时机，而不应该急于上进。等到在科举考试中高中了再出来做官临民，是“无不利”的。

问婚嫁：《诗经·关雎》说：“窈窕淑女，君子好逑。”逑，求的意思。必须等到君子求婚才能出嫁，才吉祥。

问胎孕：生女孩

五爻

问功名：士人要显扬声名，全靠上面施予恩泽。如果上面“屯其膏”，士人还有什么指望呢！

问征战：上面有厚赏，下面就愿意效力而死。如果恩泽不下施，势必离心离德，这样大势就失去了。凶。

问经商：膏指商业上的钱财和货物；“屯其膏”，指钱财和货物蓄聚而不流通。小买卖还可以固守，大经营也这样做，就未免穷困了。凶。

问疾病：膏在人体为血液，如果屯聚而不流通，就是闭塞郁积的症状。初病时治疗还容易，久病就危险了。

问胎孕：九五居尊位，主生男，并且主贵

上爻

问征战：上爻居屯卦的极位，进退维谷，日暮途穷，忧虑悲伤以至“泣血”，是军队失败、国家灭亡的时候。凶。

问经商：“乘马班如”一语，上文已经三次谈到，表明商业上的疑惑不决已经再二再三了。最后“泣血”，可知消耗和损失已经很多，所以说“何可长也”

问功名：上交居坎卦的终位，没有了前进的余地，能保全自身就算幸运了

问疾病：必定是吐血的病症，凶。

问胎孕：生女孩，恐怕无法长大`
]
const GUA_EXTRA_4 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_5 = [``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_6 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_7 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_8 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_9 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_10 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_11 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_12 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_13 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_14 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_15 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_16 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_17 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_18 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_19 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_20 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_21 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_22 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_23 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_24 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_25 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_26 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_27 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_28 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_29 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_30 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_31 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_32 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_33 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_34 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_35 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_36 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_37 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_38 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_39 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_40 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_41 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_42 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_43 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_44 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_45 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_46 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_47 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_48 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_49 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_50 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_51 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_52 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_53 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_54 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_55 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_56 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_57 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_58 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_59 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_60 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_61 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_62 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_63 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_64 = [
    ``,
    ``,
    ``,
    ``
]

GUA_EXTRAS = [
    GUA_EXTRA_1, GUA_EXTRA_2, GUA_EXTRA_3, GUA_EXTRA_4, GUA_EXTRA_5, GUA_EXTRA_6, GUA_EXTRA_7, GUA_EXTRA_8,
    GUA_EXTRA_9, GUA_EXTRA_10, GUA_EXTRA_11, GUA_EXTRA_12, GUA_EXTRA_13, GUA_EXTRA_14, GUA_EXTRA_15, GUA_EXTRA_16,
    GUA_EXTRA_17, GUA_EXTRA_18, GUA_EXTRA_19, GUA_EXTRA_20, GUA_EXTRA_21, GUA_EXTRA_22, GUA_EXTRA_23, GUA_EXTRA_24,
    GUA_EXTRA_25, GUA_EXTRA_26, GUA_EXTRA_27, GUA_EXTRA_28, GUA_EXTRA_29, GUA_EXTRA_30, GUA_EXTRA_31, GUA_EXTRA_32,
    GUA_EXTRA_33, GUA_EXTRA_34, GUA_EXTRA_35, GUA_EXTRA_36, GUA_EXTRA_37, GUA_EXTRA_38, GUA_EXTRA_39, GUA_EXTRA_40,
    GUA_EXTRA_41, GUA_EXTRA_42, GUA_EXTRA_43, GUA_EXTRA_44, GUA_EXTRA_45, GUA_EXTRA_46, GUA_EXTRA_47, GUA_EXTRA_48,
    GUA_EXTRA_49, GUA_EXTRA_50, GUA_EXTRA_51, GUA_EXTRA_52, GUA_EXTRA_53, GUA_EXTRA_54, GUA_EXTRA_55, GUA_EXTRA_56,
    GUA_EXTRA_57, GUA_EXTRA_58, GUA_EXTRA_59, GUA_EXTRA_60, GUA_EXTRA_61, GUA_EXTRA_62, GUA_EXTRA_63, GUA_EXTRA_64,
]

module.exports = GUA_EXTRAS

