// [周易卦辞,传统解卦,张明仁解卦,高岛易断]
const GUA_EXTRA_1 = [
    `乾:元亨利贞.
    
彖曰:大哉乾元,万物资始,乃统天.云行雨施,品物流形.大明始终,六位时成,时乘六龙以御天.乾道变化,各正性命,保合大和,乃利贞.首出庶物,万国咸宁.
    
象曰:天行健,君子以自强不息.

初九:潜龙勿用.象曰"潜龙勿用,阳在下也".
    
九二:见龙在田,利见大人.象曰"见龙在田,德施普也".
    
九三:君子终日乾乾,夕惕若；厉,无咎.象曰"终日乾乾,反复道也".
    
九四:或跃在渊,无咎.象曰"或跃在渊,进无咎也".
    
九五:飞龙在天,利见大人.象曰"飞龙在天,大人造".
    
上九:亢龙有悔.象曰"亢龙有悔,盈不可久也".`,
    `这个卦是同卦(下乾上乾)相叠.象征天,喻龙(德才的君子),又象征纯粹的阳和健,表明兴盛强健.乾卦是根据万物变通的道理,以“元,亨,利,贞”为卦辞,表示吉祥如意,教导人遵守天道的德行.
    
大象:天行刚健,自强不息.
    
运势:飞龙在天,名利双收之象,宜把握机会,争取成果.
    
事业:大吉大利,万事如意,心想事成,自有天佑,春风得意,事业如日中天.但阳气已达顶点,盛极必衰,务须提高警惕,小心谨慎.力戒骄傲,冷静处世,心境平和,如是则能充分发挥才智,保证事业成功.
    
经商:十分顺利,有发展向上的大好机会.但切勿操之过急,宜冷静分析形势,把握时机,坚持商业道德,冷静对待中途出现的困难,定会有满意的结果.
    
求名:潜在能力尚未充分发挥,只要进一步努力,克服骄傲自满情绪,进业修德,以渊博学识和高尚品质,成君子之名.
    
婚恋:阳盛阴衰,但刚柔可相济,形成美满结果.女性温柔者更佳.
    
决策:可成就大的事业.坚持此卦的刚健,正直,公允的实质,修养德行,积累知识,坚定信念,自强不息,必能克服困难,消除灾难.`,
    `天,表示极阳之象,为纯卦,六冲卦,是大好,大坏的卦象.对事一般为吉象,为主管,负责任,可以任用担当大事,或开业当老板,得此卦都属吉象,只是必须有一个好的助理更佳,升官,考试,升迁都较有利.

解释:刚健稳固

特性:积极,刚毅,努力,认真,有耐性,坚忍,正派,主动,慷慨,严律,重名誉.

运势:有地位擢升,名利双收之象,功名荣显得贵子.六亲和睦,凡事谦和为贵可吉

家运:繁昌兴隆,须小心口舌之争.

疾病:病情恶化,宜细心调养,注意头,脑,骨髓等病变.

胎孕:有不安之兆,宜小心保养

子女:儿女健康,幸福有为.

周转:虽不成问题,尚宜心平气和来处理.

买卖:小利可得,大则勿取,勿太张扬为吉.

等人:一定会来.

寻人:已远走高飞,不易找到,在西北方向.

失物:可望寻回

外出:利于出行,结伴而行更佳

考试:有望取得好成绩.

诉讼:宜据理力争.

求事:有贵人提拔,可发展,称心.

改行:占得此卦不宜改行.

开业:开业者需要耐心观望.`,
    `问天气:二、三、四、五爻如果发生变动,一定是晴天。

问买卖:不利于买而利于卖。

问祸福:所谓“积善之家,必有余庆；积不善之家,必有余殃”,恐怕不是应验在当代人身上,而是应验在后代身上。

问常人:有置身过高,不了解日常事务的忧虑。

问贤人:有知道天命而独自行道之象。恐怕成群的阴柔潜伏,有被众多小人用谗言罗织陷害的危险。

初爻

问征战:乾为武人,有征战之象。初爻阳气开始发动于黄泉,还处于潜伏状态,故称“潜龙”。在军事,象征军令刚刚下达,大军还没有集结起来的时候,所以应该按兵不动,等待条件成熟。吉。

问经商:龙在潜隐状态而说“勿用”,可见虽然是一种好贸易,但是只可以安居守分,不可急于行动。

问功名:龙本是飞黄腾达的动物,而初爻却说潜,说明没到风云际会的时候,所以又说“位在下”。

问婚姻:乾卦初爻变阴则全卦为姤,姤卦说“女壮,勿用取女”,所以应当戒止。

问家宅:震为龙,在东方,说明住宅的东面必定有深水。这水闭塞不流,应该加以修凿,使它流动。

问胎孕:生男孩。

二爻

问征战:龙本来属于灵物。初爻说潜,是指伏兵。二爻说见,是从潜隐中出现而可见了。又说“在田”,一定列阵在田野等空旷的地方。《象传》说“德施普也”,指一定会得胜而论功行赏。

问经商:爻辞说“见龙在田”,可知货物大体是米麦丝棉之类。见,指物价开始上涨；“利见大人”,是说应当有官场人物出来购买。

问功名:隐伏在田间的人,应当乘时上进,发挥作用。会得到贵人的帮助,所以说“利见大人”。

问婚姻:二爻和五爻相应,五爻为地位崇高,主女婿家必定尊贵。说“见龙”,一定是刚刚被任用的年轻人。大吉。

问胎孕:生男孩,并且主贵。

三爻

问征战:征战是危险的事情。爻辞说“终日乾乾,夕惕若”,说明问卦者能“临事而惧”,所以没有灾祸。

问功名:九三在下卦的上位,而在全卦则爻位还低,象征功名还不显著,所以称君子；在多忧患和危险的位置,所以说“乾乾”、“惕若”,这样才能避免灾祸。

问经商:居于不得中的位置,行走于“重刚”的险地,想来贸易处一定是个危险的地方,日夜防备才能脱险而获利。

问家宅:观察爻象,必须谨慎地把持自身,勤劳节俭地保持家业,这样才没有灾祸。

问婚嫁:三爻以上九为应爻,三爻地位低,上爻地位高。高则不免过亢而有悔恨,所以不宜向地位高的人攀结亲事。

问胎孕:生男孩。生产时稍有危险和惊惧,但最终没有灾祸。

四爻

问征战:观察爻象,在行军前进的时候,一定有深水阻隔,应该安排船或筏；或者在临渊处有敌军埋伏,应当预先设防,才能避免灾咎。

问经商:爻辞说“或跃在渊”,如果贩运海货,恐怕有遇到波涛的危险。或许物价一时上涨,但爻辞说“无咎”,可以保证无害。

问功名:有一举成名之象,大吉。

问家宅:渊是水,跃是飞跃,家道有一时振兴之象。

问胎孕:生男孩。

五爻

问征战:九五居君位,一定是天子御驾亲征,以王者之师讨伐有罪的人,所以说“大人造”。

问经商:九五爻辰在申,在天上值毕宿,附星有咸池。咸池是苍龙的宅舍,也叫五车,主稻黍豆麦,所以他的贸易一定是五谷之类。说“飞龙”,可以知道物价的飞升；说“利见大人”,可知贩运或许出自政府的命令。

问功名:有直达云霄之象。

问疾病:有应上天的召唤之象,不吉。

问胎孕:生男孩,主尊责。

上爻

问征战:上九居乾卦的极位,以阳爻在上位,所以亢；亢就会因为胜利而骄傲,所以“有悔”。《象传》说“盈不可久”,可知征战无法持久。

问经商:亢是太过的意思。买卖之道,不可以过分追求盈利,过于盈利就一定会发生亏损,所以说“不可久”。

问功名:上九的位置已到极致,应该自己返身后退,否则必定因为盈满而遭受损害。

问家宅:一定是宅基太高。太高就危险,也是值得畏惧的。

问疾病:是龙阳上升的病症。《象传》说“盈不可久”,可知性命已经在旦夕之间了。可怕。

问婚嫁:不利。

问胎孕:生男孩,恐怕养不大。`
]
const GUA_EXTRA_2 = [
    `坤:元，亨，利牝马之贞.君子有攸往，先迷后得主，利西南得朋，东北丧朋安贞，吉

彖曰:至哉坤元，万物资生，乃顺承天.坤厚载物，德合无疆.含弘光大，品物咸亨.牝马地类，行地无疆，柔顺利贞.君子攸行，先迷失道，后顺得常.西南得朋，乃与类行；东北丧朋，乃终有庆.安贞之吉应地无疆

象曰:履霜坚冰，阴始凝也.驯致其道，至坚冰也

初六:履霜坚冰至

六二:直，方，大，不习无不利.象曰"六二之动，直以方也.不习无不利地道光也"

六三:含章可贞.或从王事，无成有终.象曰"含章可贞；以时发也或从王事知光大也"

六四:括囊；无咎，无誉.象曰"括囊无咎，慎不害也.

六五:黄裳，元吉.象曰"黄裳元吉，文在中也"

上六:战龙於野，其血玄黄.象曰"战龙於野，其道穷也"

用六:利永贞.象曰"用六永贞，以大终也"`,
    `这个卦是同卦（下坤上坤）相叠，阴性.象征地（与乾卦相反），顺从天.承载万物，伸展无穷无尽.坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺.它以“先迷后得”证明“坤“顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利.

大象:大地承载万物，以德服众，仁者无敌运势:诸事不宜急进，以静制动为宜

事业:诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰.切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行.取得朋友的关心和支持最为重要，在他人的合作下.共同完成事业.因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率，方正，含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功.

经商:机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验.注意储存货物，待价而沽，处处小心为是

求名:比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥

婚恋:阴盛.以柔克刚，女方柔顺，美好姻缘，白头到老.

决策:忠厚，温和，待人真诚，热心助人，因此也能得到他人的帮助，可往往因不提防小人而受到伤害，但无大碍.性格灵活，工作方法多样，可以左右逢源，得到赞许`,
    `地，表示大地为母，天生之母性也.六冲纯卦，主大好大坏之卦象.优点，如母亲般地柔顺，牺牲，付出，有事事和顺之意.缺点，过于委缺求全，没有了自己的想法和观念.此卦论感情，有前世因缘的影响，自己就有如母亲大姊般地照顾对方，无怨无悔，会很辛苦，多劳累.事业，适合当任副手之职位，忌任主事者，容易软弱难成事.

解释:在母胎里孕育中，不宜创业

特性:为人较为保守，善于计划与研究工作，适合任辅佐幕僚之职，做人朴实，人缘佳，大好人型，男性桃花多，女性则爱情专一

运势:诸事不宜急进，退守以静制动者吉.坤者大地平静，任其他物所摧而不为所动者大利也.若醉心私欲，违背常理，则有无妄之灾

家运:幸福平静之象

疾病:病情严重，为腹，肠胃，肌肉等慢性病（腹疾，脾胃之疾，饮食停滞从而食不化)

胎孕:生贵子女儿亦福

子女:儿女众多，和睦幸福也

周转:须耐心去求，否则难成

买卖:勿急交易可成

等人:不会来须再待些时日

寻人:此人为色情之事出走，于西南方附近之地也

失物:难以寻回，大部份均不知下落

外出:宜结伴而行.可去陌生的地方

考试:希望不大

诉讼:防房地产之争，宜和解，有始无终之兆

求事:不称意亦不理想，另寻

改行:改行不利宜固守本份

开业:开业者再观望，目前尚未筹备妥当，不宜`,
    `问征战:坤为地，为众。势是有力量的意思。就行军打仗来说，既得地利又得势力，还得到了兵众，理应攻无不克。
    
问功名:有上等智慧的人能效法坤卦的深厚德行，积功累德，以至流光溢彩，声名自然显达。

问经商:坤为富，为财，为积，为聚，都是经商的吉兆。说“厚德载物”，德是得的意思，可以有求必得，满载而归。

问家宅:可知住宅在地势上占有优势，大吉。

问婚嫁:坤是顺的意思，柔顺就是了，这是地道，也是妇道。大吉。

问胎孕:生女孩。

初爻

问经商:初六阴气还很微弱，说“履霜，坚冰至”，是从微弱推论到盛大，犹如商业从小到大，通过逐渐积累而致富。问功名:初爻象征年轻人刚刚上进的时候，地位由卑微到尊贵，犹如“履霜”而“至坚冰”，随着时间而来，不可躁进。

问征战:初爻是阴气的开始，有“履霜”之象；到上爻“龙战”，则是阴气的极致，有“坚冰”之象。上爻说“其血玄黄”，指两败俱伤。所以应当先审慎于事情的开始。

问家宅:坤是纯阴的卦，而初爻阴气还微弱，所以说“履霜”；“坚冰至”，则阴气已经旺盛了。阴气旺盛了就会衰弱，是不吉的征兆。

问婚嫁:坤卦纯阴，说霜说冰都是阴象。纯阴而无阳，不利。

问胎孕:生女孩。

问疾病:恐怕是阴邪的病症。初起的时候可以治疗，日子一久就难治了。

二爻

问经商:六二是坤卦的本位，“直方”是地的性质，大是地的作用。由此可知，所经营的商业必定是土地所产，如谷米、木材、丝棉之类。“不习无不利”，“习”与“袭”相通，指不必重新占筮，就知道能够获利。

问功名:二爻居中正的爻位，行动就会获利，指不需要修养，功名就会自然成就，其成名是必然的

问征战:征战的事以得到有利的地势为要点。依法行动，气势大，力量强，可以通过一次作战而平定地方。

问家宅:六二居中得正，主家宅适宜，所以说“地道光”。问嫁娶:“直方大”是地道，而妻道通于地道，所以婚娶也有利。

问疾病:爻辞说“直方大”，可知这人平素身体强壮，不必用药就有喜庆。

问胎孕:生女孩。

三爻

问征战:爻辞说“含章可贞”，是说平时含蓄才智而不显露，一旦做事，自然能够制胜，即使不成功也不会有大的失败。所以说“无成有终”。

问经商:坤为地，各种货物都产生于地，而商人能蓄积各种货物，故说“含章”。凡从事商业的人，因时宜而贩运各种货物出售，故说“以时发”。内卦到第三爻就到了极处，正是盛满的位置，故说“光大”。所以一时虽然或许没有取得成功，但是一定会有结果，吉。

问功名:求功名的人最应该等待时机。时运不宜行动，就“含章可贞”；时运应当行动，就出来“从王事”。懂得这个道理的人，一定能始终保持功名。吉。

问疾病:玩味“无成有终”一语的含义，可知已经不可救药了。凶

问胎孕:生女孩。

四爻

问经商:六四是巽爻，巽为商，为利，即《说卦传》所谓巽近利市三倍。爻辞说“括囊”，可知过去一定曾经得到利益，钱财已收入囊中，不再拿出来了，所以说“括囊，无咎无誉

问征战:六四是重阴的一爻，正值闭塞的时候，即使有智囊的才能也无处运用。这表示宜于闭关不战，像括结囊口一样，这样就没有祸咎了。

问功名:六四是上卦的初爻，变阳则为否卦的九四，所以《文言》说“天地闭”。“括囊”就是闭结囊口。天地尚且闭塞，还有什么功名可求？如果虚妄地追求功名，只足以导致祸患。有名誉反而就有祸害了，应当审慎

问家宅:六四以阴爻居阴位，所居不是中位，住宅一定在山谷幽僻处，适宜隐遁的人居住

问胎孕:生女孩，或许会得到两个孪生女儿。

五爻
问征战:坤为臣道，五居君位，是人臣中极尊贵的人，就像舜投政时惩罚共工、欢兜、三苗和螺四区，周公摄政时株杀管叔和蔡叔一样。辞说“黄裳，元吉”，说明是由文德发越而成就武功的人，所以《文言》说“文在中”。

问功名:六五支辰在卵，得到了震卦之气，而震卦有功名振兴之象。五又是离卦的主艾，离为黄色，卦位接近午，在天上值七星，而七星主衣裳文绣，所以说“黄裳”。离又为明，有文明发达之象，所以说文在中。

问经商:坤卦的五变阳则全卦为比，比卦吉祥，是辅助的意思。商业一定要得到亲比和辅助才能成功。比卦的下卦为坤，上卦为坎，而坤为裳，所以说“黄裳”；比为美，所以说文在中”。由此可知，所经营的商业必定是锦绣的服饰之类。说“元吉”，一定会获得利润。

问疾病:坤为大腹，黄为中色，裳为下体的服饰，可见病在中下两焦。

问胎孕:生女孩。

上爻
问征战:卦象已经明白表示，结果是两败俱伤

问功名:上爻处在外卦的极位，是老年参加科举考试。抑塞已经很久，这次又将失败，值得悲衰。

问经商:上六居坤卦的终，前面的道路已经穷尽，象征钱财用尽后，血本又运到亏损，商业没办法经营下去了。

问疾病:一定是阴亏的病症。阴极盛而对抗阳，肝血暴烈流动，已经到了命终的时候。

问胎孕:阴爻因为穷尽而变阳，有生男孩的希望`
]
const GUA_EXTRA_3 = [
    `屯:元，亨，利，贞，勿用，有攸往，利建侯

彖曰:屯，刚柔始交而难生，动乎险中，大亨贞.雷雨之动满盈，天造草昧宜建侯而不宁

象曰:云雷屯；君子以经纶

初九:磐桓；利居贞，利建侯.象曰"虽磐桓，志行正也.以贵下贱，大得民也"

六二:屯如邅如，乘马班如.匪寇婚媾，女子贞不字，十年乃字.象曰"六二之难，乘刚也.十年乃字，反常也"

六三:既鹿无虞，惟入于林中，君子几不如舍，往吝.象曰"既鹿无虞，以纵禽也.君子舍之，往吝穷也"

六四:乘马班如，求婚媾，无不利.象曰"求而往，明也"

九五:屯其膏，小贞吉，大贞凶.象曰"屯其膏，施未光也"

上六:乘马班如，泣血涟如.象曰"泣血涟如，何可长也"`,
    `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险.雷雨交加，险象丛生，环境恶劣.“屯”原指植物萌生大地.万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣

大象:屯者难也，万事欲进而不得进

运势:身处困境，步步为营，有初难后解之意

事业:起初多不利，必知难而进，小心翼翼，勇往直前，灵活机动，可望获得大的成功，时机到来时一定要抓住，却也不得操之太急，且仍有困难，务必有他人相助，故平时应多施恩惠

经商:创业初期步履艰难，多有挫折.坚定信念最重要，不要为表面现象所迷惑，应积极进取，行动果断，打开出路.若仍无法摆脱困境，则应退守保全，等待机会，再展宏图.

求名:积极争取，主动追求，可以成功

婚恋:好事多磨，忠贞纯洁，大胆追求，能够成功，婚姻美满

决策:初始困难，但若具有坚忍不拔的毅力和锲而不舍的奋斗精神，前途不可估量，但往往不为他人理解而陷于孤独苦闷，事业会因此处于困难状态，需要得到贤德之人的帮助才能摆脱如能以乐观主义精神处世，能取得成就`,
    `屯，表示刚出生的小草，主凶象，四大难卦第一卦.因为刚出生的小草，脆弱易折，表示凡事都会很困难，很容易就会夭折，失败.但是只要有心小心地护持，小草还是有机会长成大树的

解释:不明不白

特性:理想远大，奋斗不懈，苦尽甘来，最后能达成目标，获得他人的肯定.一生困境多，烦恼厌烦多，朋友少助

运势:逆势，多有困惑，但不可妄进，宜守不宜进.坚定意志，凡事不可为一己之利而执意强行，皆有不成损破之象.宜步步为营排除困难，始可通达，有初难后解之象.

家运:多波折，若能努力排除困难，可得通顺

疾病:病在肠胃，足部或泌尿系统，不宜掉以轻心

胎孕:不安产母有虚惊，但可无虑

子女:有辛苦，但以后可得安逸

周转:困难重重须用心忍耐奔波

买卖:不利交易有损

等人:不会来

寻人:出走者不知去向，难寻.东或北方去矣失物难以寻回

外出:慎重为好，有危险，宜改日动身

考试:不理想

诉讼:小事粘滞纠缠，大事反无大害，宜和解

求事:不利

改行:不宜

开业:不宜，有困难亦难成也`,
    `问功名:内卦为震，外卦为坎才是屯卦。震为雷，坎为云，故说“云雷”；震为出，坎为入，要出而又入，故说屯。另外震为人，为上，坎为经，为法，所以说“君子以经纶”，意思是君子怀抱经纶天下的才能，而运途正值屯难，应当等待行动的时机。

问征战:以勤劳的兵众守卫叫做屯。“云雷”相当于蓄势，“经纶“是指怀有才能，但是在屯难的时候，适宜固守而不适宜前进。

问经商:《彖传》说“刚柔始交而难生”，一定是初次经商凡创始的事业，多半苦于艰难。经纶是治丝的事，可知所经营的一定是丝棉之类。

问家宅:震为东方，坎为北方，震为动，坎为陷，恐怕住宅东北方有问题，应当加以整修

问婚姻:雷为阳气，云为阴气，“刚柔始交而难生”，象征初婚的时候双方不融洽，应当有适当的人劝解他们。

问胎孕:生男孩，恐怕开始生产时有险难。

初爻

问征战:“磐桓”，行而不进的样子。说“利居贞，利建侯”尽管值于屯难的时期，但是内心要以正自守，对外要求得贤人的辅佐，这样就会民心归附，众志成城，而终究没有不利问经商:初九爻辰在子，子在北方，在天上值虚宿，称作元枵。枵就是耗，虚也是耗的意思，不利于行商。如果能守正而任用别人，还有利可图。

问功名:得到的是初爻，必定是初次求名。“磐桓”，是要进步而做不到。重要的是志愿和行为正直，为人谦逊，主动居于下位，这样终究会有所得。

问家宅:“磐”字从“石”，所谓“安如磐石”，可知这家的宅基巩固。说“利居贞”，可知居住安稳；说“利建侯”，可知一定是贵人的宅第

问婚嫁:说“以贵下贱”，这是富贵人家的女子下嫁之象，吉。

问胎孕:得初爻，生男。

二爻

问婚嫁:爻辞说“匪寇婚媾”，明说是佳偶而不是怨偶；但又说“女子贞不字，十年乃字”，可知出嫁还需要等待。

问征战:六二以柔爻居柔位，有濡滞之象，故说“屯如”。《左氏春秋》有“有班马之声，齐师其遁”的话，古时还师归朝称班师，故说“班如”。可知军队不可急于前进，必须养精蓄锐，“十年”后才能获胜。

问经商:“媾”与“购”字发音相同，含义也相通。就货物的求购来说，有迟回不决的意思，所以说“屯如遭如”。又说“十年乃字”，十是据成数而言。货物不可长久积存，或者是十日或十月吧？

问功名:士人求名，犹如女子求嫁，说“屯如”、“如”、“班如”，都是说一时无法成名。“十年乃字”，十年后才是成名的时候。

问胎孕:生儿子。

三爻

问征战:爻辞说“即鹿无虞，惟入于林中”，正如说行军而没有向导，冒进到危险的地方。应当见机而退，否则必定遭遇凶险。

问经商:玩味爻辞，可知这人既不熟悉商业，也不熟悉地理，前去不但买不到货，反而有损失。舍弃这次出行，才可以无大害

问婚嫁:属于钻地穴翻墙头而求婚，没有前途。

问功名:干求荣耀，乞怜宠爱，士人之道已经穷尽了。

问胎孕:六三以阴爻居阳位，生男孩

四爻

问征战:“乘马班如”，是不清楚进攻的道路的缘故。清楚道路以后再前往就会所向无敌，所以说“往吉，无不利”。

问功名:士人把利器藏在身上而等待时机，而不应该急于上进。等到在科举考试中高中了再出来做官临民，是“无不利”的。

问婚嫁:《诗经·关雎》说:“窈窕淑女，君子好逑。”逑，求的意思。必须等到君子求婚才能出嫁，才吉祥。

问胎孕:生女孩

五爻

问功名:士人要显扬声名，全靠上面施予恩泽。如果上面“屯其膏”，士人还有什么指望呢！

问征战:上面有厚赏，下面就愿意效力而死。如果恩泽不下施，势必离心离德，这样大势就失去了。凶。

问经商:膏指商业上的钱财和货物；“屯其膏”，指钱财和货物蓄聚而不流通。小买卖还可以固守，大经营也这样做，就未免穷困了。凶。

问疾病:膏在人体为血液，如果屯聚而不流通，就是闭塞郁积的症状。初病时治疗还容易，久病就危险了。

问胎孕:九五居尊位，主生男，并且主贵

上爻

问征战:上爻居屯卦的极位，进退维谷，日暮途穷，忧虑悲伤以至“泣血”，是军队失败、国家灭亡的时候。凶。

问经商:“乘马班如”一语，上文已经三次谈到，表明商业上的疑惑不决已经再二再三了。最后“泣血”，可知消耗和损失已经很多，所以说“何可长也”

问功名:上交居坎卦的终位，没有了前进的余地，能保全自身就算幸运了

问疾病:必定是吐血的病症，凶。

问胎孕:生女孩，恐怕无法长大`
]
const GUA_EXTRA_4 = [
    `蒙:亨.匪我求童蒙，童蒙求我.初噬告，再三渎，渎则不告.利贞.彖曰"蒙，山下有险，险而止，蒙".蒙亨，以亨行时中也.匪我求童蒙，童蒙求我，志应也.初噬告，以刚中也.再三渎，渎则不告，渎蒙也蒙以养正,圣功也

象曰:山下出泉，蒙；君子以果行育德

初六:发蒙，利用刑人，用说桎梏，以往吝.象曰:利用刑人，以正法也.

九二:包蒙吉；纳妇吉；子克家.象曰:子克家，刚柔接也.

六三:勿用娶女；见金夫，不有躬，无攸利.象曰:勿用娶女，行不顺也.

六四:困蒙，吝.象曰:困蒙之吝，独远实也

六五:童蒙，吉.象曰:童蒙之吉，顺以巽也

上九:击蒙；不利为寇，利御寇.象曰:利用御寇，上下顺也`,
    `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险.卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦.但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象.

大象:蒙者，昏而无所见也，故宜启蒙.

运势:初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通.

事业:事业开始，混乱无序，危机四伏，以勇敢坚毅的行动可以扭转局面.然而必须接受严格教育，培养这种奋发图强的精神.务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地.

经商:务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜.

求名:必须接受良好的基础教育，陶冶情操.且动机纯正，可以达到目的.

婚恋:注意考察对方品德，不可以金钱为诱铒.夫妻需相互宽容，理解.

决策:有时会陷入迷惘困顿的境地，加上胆小，不果断，往往误事.如能接受长辈的教诲，甚至严酷的考验，抛弃疑惧的心理，等待适当时机，必然一帆风顺.`,
    `蒙，表示被蒙蔽不明之意.主小凶象.事情迷蒙不明，不宜轻信于人，此卦易犯小人，需诚心求教于有智慧经验的友人长者，受其启蒙开智慧，方能转危而安.若是一意而行必现大凶象

解释:被蒙蔽，被欺瞒

特性:喜欢追求新的知识，过平稳生活，做事谨慎，对下属要求较严，领导统御能力略差.宜防受朋友之拖累蒙蔽

运势:气运不发，多迷惑.初时不顺，须忍耐待机，渐可佳.切勿贸然行事或为人认保，作保，否则必有损失.凡事宜从上辈教诲则运可通也

家运:初时辛苦多端，上下无法沟通，只要以诚相待，必有开运之时

疾病:病情不明，反覆难治.为肠胃，腹水之疾及传染病

胎孕:胎孕无碍

子女:应注重子女教养，将来方得幸福之象

周转:困难，防止上当受骗

买卖:不利有损失

等人:可能走错路，会迟到

寻人:受诱惑而出走，因本身蒙昧无知而受骗.在东北或北方，日前难寻

失物:遍寻不获.似乎在大门下陷之处遗失，忘记带走，可试问人.

外出:等候有利时机再行动，等待期间应积极做准备.

考试:不理想

诉讼:因外人引起事端，目下未明，有理讲不清

求事:未能如愿，再等时机

改行:改行不宜

开业:开业者不宜.再等一段时间，筹备好资金再做打算.`,
    `问征战:《大象传》说“山下出泉”，即潜伏的水，有伏兵之象。“君子”指军队中的将帅。“果行育德”，果是果敢，育是蓄养，指应当养精蓄锐，而果决地前进，

问经商:玩味《大象传》的话，想是开凿矿山的生意。应当果决地从事，吉。

问功名:这是士人素有德行而隐居在深山之象。说“山下出泉”，所以终究会出山济世。

问家宅:这座住宅的坐向为坎艮。说“山下”，必定靠近山；说“出泉”，一定有泉水从山下流出。由君子来居住，住宅必定吉祥。

问婚嫁:坎卦于十二辰在子，在天上值女宿。《圣冷符》说女宿主嫁娶。艮在下兑在上的卦为咸，二气互相感应，所以说“取女吉”。“山下出泉，蒙”，是婚姻的开始。

问疾病:艮为止，坎为险，病势一定是热邪逐渐进于体内，到初爻“发蒙”的时候邪气会外发，可以保证没有危险，

问胎孕:生男孩

初爻

问征战:爻辞说“发蒙”，说明是讨伐暴虐有罪者的军队，如大禹征有苗，感化了有苗就罢师还朝，所以说“以正法也”。

问经商:初爻在内卦的开始，一定是初次经营。坎为险难，爻辞说“发蒙”，说“用刑”，可知经商必定有阻碍，几乎要兴起诉讼。但得了理就应该马上停止，追究到底恐怕有害，故说“往吝”。

问功名:要前去乞求荣宠，恐怕反而会受辱，应当中止。问嫁娶:初爻居全卦开始的位置，爻辞说“发蒙”，一定是在少年时期订婚。既然屡次发生事端和变化，罢婚就是了。

问胎孕:初六以阴爻居阳位，生女孩。又恐怕生产过程中有危难

二爻

问征战:九二以阳爻居阴位，爻辞说“包蒙”，有囊括众阴爻之象。《象传》说“刚柔接也”，刚柔即双方的军队，接就是交战，“克家”，如同说克敌。占例以妇为财，以子为福，象征既战胜敌军，又收纳他们的财物，并且承受他们的福分，大吉。

问经商:二爻和上爻以两个阳爻包括三个阴爻，一个阳爻在内，一个阳爻在外，有包罗财物，贩运到外地之象，故说“包蒙吉”。“纳妇”，一定是在旅居过程中纳娶了妇人，而且有了儿子。所谓“克家”，这儿子一定能继承父业

问功名:想来功名不在本身，而在他的儿子，所以说“子克家”。

问家宅:说“包蒙”，即以艮包坎，一定在山环水抱的地方。说“纳妇”，说“克家”，宅中必定有好妇人和好儿子，能够振兴家业。吉。

问婚姻:玩味爻辞，有两件吉事。明言既有妇人又有儿子，没有比这更大的吉事了

问胎孕:生男孩，主富贵

三爻

问征战:爻辞说“勿用取女”，女指阴爻。所有的占筮书都以妻爻为财，金也是财。在行军过程中，应该通过散财来容纳更多的人，而不应该因为敛财而招致怨恨。如果抢掠财物，一定会导致兵败身亡。说“勿用”，其中诫止的意思太深了！

问经商:六三以阴爻居阳位，内阴而外阳，一定是外出的行商。行商最忌贪色。如果男人恋色，女人贪财，只要一陷入骗局，就会小则破财，大则伤身。《象传》说“行不顺也”，顺”与“慎”字音相同，辞义相通，可以不慎重吗？

问家宅:玩味爻辞，所谓“牝鸡司晨，惟家之索”，这是应当深深戒止的。

问功名:为妇之道通于为臣之道，见利忘义必定导致身败名裂。做女人不贞，就是为臣不忠。

问胎孕:生男孩

四爻

问征战:行军适宜暗中深入，明着出离。说“困蒙”，是进入阴险的地方而出不来了，所以说困。阳为实，说“远实”，可知救兵在远处而鞭长莫及。凶。

问经商:经商之道，应该亨通而不应该困顿，应该畅达而不应该吝啬。“实”在这里指资本，“远实”主丧失资本。“困蒙”的吝，是无路可走了。

问时运:蒙，暗昧的意思；困，困厄的意思。蒙昧而又困厄，就困厄到底了，

问家宅:据爻辞看，家中生活困苦，宅地也偏僻。《象传》说“独远实”，这里一定是孤村，缺少邻居。

问胎孕:生女孩。这女孩一定没有兄弟，所以说独

五爻

问征战:五爻互坤，坤于十二辰在未，在天上值井宿，弧矢九星在井宿的东南方，主讨伐叛乱。另外，东面为子孙星，爻辞说“童蒙”，指率领子弟从军，所以吉。

问经商:五爻为卦主，爻辞说“童蒙”，店主一定还在童年阶段。五爻应二爻，《周易正义》说“委物以能”，指把事务委托给有能力的人，即委托给二爻。五爻店主知道自己年少，顺从二爻，以它为经营者，所以说“童蒙吉”。

问功名:年纪还在“童蒙”阶段，功业还没有成，名誉还没有就，只有听从二爻老师的教导，将来的成就才不可限量，所以说吉。

问婚姻:蒙的上卦为艮体，艮为少男，象征幼年订亲，所以说“童蒙吉”。

问胎孕:生男孩

上爻

问征战:上爻爻辰在戌，在天上值奎宿，奎宿主兵器库，禁制不违背时令，所以说“利御寇”。

问经商:商业之道全在利用，又贵在顺理取利。逆理而取属于寇盗，顺理而取则属于防御寇盗。“上下”指卖买两家，卖买双方和谐融洽，就上下都顺利了。吉。

问婚姻:“击蒙”，马融、郑玄作“系蒙”，恰好符合月下老人红丝系足的意思。屯卦两次说到“匪寇婚媾”，是以佳偶为婚姻，以怨偶为仇人的说法。“利用御寇”，一定属于佳偶。妇道以顺为贵，《象传》说“上下顺”，说明家室必定和睦安宁。吉。

问胎孕:生男孩。这男孩的童年，必须严加管教`
]
const GUA_EXTRA_5 = [
    `需:有孚，光亨，贞吉.利涉大川

彖曰:需，须也；险在前也.刚健而不陷，其义不困穷矣.需有孚，光亨，贞吉.位乎天位，以正中也.利涉大川，往有功也

象曰:云上於天，需；君子以饮食宴乐

初九:需于郊.利用恒，无咎.象曰"需于郊，不犯难行也.利用恒，无咎；未失常也"

九二:需于沙.小有言，终吉.象曰"需于沙，衍在中也.虽小有言，以终吉也"

九三:需于泥，致寇至.象曰"需于泥，灾在外也.自我致寇，敬慎不败也"

六四:需于血，出自穴.象曰"需于血，顺以听也"

九五:需于酒食，贞吉.象曰"酒食贞吉，以中正也"

上六:入于穴，有不速之客三人来，敬之终吉.象曰"不速之客来，敬之终吉.虽不当位，未大失也"`,
    `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意.以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功

大象:云登天上而未雨，不能急进，等待时机之象.

运势:智者必须待时而行，急进反见凶险.

事业:关键在于审时度势，耐心等待，事成于安祥，切勿冒险，欲速不达.自己要充满自信，临危不惧，坚守中正，必可化险为夷.情况有利时，仍得居安思危.

经商:行动之初，情况困难，必须以极大的耐心，创造条件和机会，行事光明磊落，观时待变，实现愿望.事情接近成功时，更应小心谨慎，切莫功亏一篑.

求名:时机尚不成熟，应耐心等待.这时应坚定信念，不为闲言流语所动摇，努力丰富自己，再求助可靠的人便可成功.

婚恋:慎重，切不可草率行事，逐渐培养感情，以诚实，热情相待，会发生变故，仍可以有良好的结局.双方都应懂得以柔克刚的道理.

决策:前途光明，有雄心大志，且可实现.为此需要积蓄实力，等待时机，大器晚成.本人具有坚强的意志，冷静的头脑.前进途中会遇到困难和险阻，必须十分谨慎，坦然对待小人的中伤，在灾祸在面前能镇静自若.不轻举妄动，冷静选择方向.为人谦和，坦率，多有他人相助，促使事业成功.当时机成熟后，必然一帆风顺.`,
    `需，表示需要，需求，但却又是时机未到.此卦凶中带吉，需耐心等待，则事情可成.健康方面，要特别注意

解释:需要等待时机.

特性:谦恭有礼，性格保守，稍被动，但为人诚恳，欲求不高，中晚年才渐入佳境.不利早婚，有宗教艺术兴趣

运势:宜退守正道，不宜冒险前进，投机急取反而失利.须知贪小失大智者必须待时也

家运:初为多事之秋，须凭智慧耐心挽救颓势

疾病:病情拖延，须留心治疗，为头，胸，肺，泌尿系统等病

胎孕:临产之时才占卜，表示会有障碍.防克产母

子女:得子迟

周转:不能预期而得，有延滞

买卖:有口舌不可成就，亦勿贪小而失大.

等人:迟到

寻人:此出走之人因感情之事于西北或北方

失物:即时不能寻回，需经过一段时间将会出现

外出:充分准备齐全后，可平安无事

考试:要多用功

诉讼:暂时未能了结，以和为贵

求事:不宜急取，急亦不得，再等待，再寻求

改行:不宜

开业:不宜 `,
    `问征战:需是等待的意思。云在天上，阴阳二气没有相交， 还不可以征战。乾为君子，又为武人，这是就主帅而言。坎 为酒，所以说“饮食宴乐”。这是说行军要先准备军粮。

问经商:玩味爻辞，想是贩运粮食或开设酒馆。说“云上于天”，是云在天上而雨没有降下，想是资本还没有集中起来，所以说需。

问功名:风云还没有际会，还要有所等待。

问疾病:应当用饮食来调剂，以安乐自我消遣，久后自然痊愈。

问胎孕:生男孩

初爻

问征战:爻辞说“需于郊”，一定屯营在郊外。坎为险，为 难，前进必有险难，所以《象传》说“不犯难行”。初爻为全 卦的开始，可知是初次出动军队；说恒，说需，可知宜于长久等待。长久等待之后再前进，必定无咎。

问功名:在卦的初爻，可知是刚出山求功名。郊为草莽地方，“需于郊”是说应该退居郊野。恒是久的意思，“利用恒” 是说适宜长久等待，这样才可以得利。《象传》说“不犯难行 ”，是说它不涉险难；“未失常”，是说它能持守恒久之道，所以无害。

问经商:行商的经营之道，利益在于恒久。“需于郊”，可知前途必有险难，需要暂时把货物堆积在郊外，等待时机再前进。《象传》说“未失常”，可知货物没有损失。

问疾病:郊是田野空旷处，指适宜在野外幽居养病。“无咎”，疾病无害的意思。

问胎孕:生男孩

二爻

问征战:坎为隐伏，玩味爻象，是指应当伏兵在沙漠一类地方。或许会因为间课的情报而导致失误，而小有挫折，但结果必定吉祥。

问经商:二爻爻辰在寅，在天上值天江四星。石申说“天江明动，大水不具，津梁不通。”货物不能运输，所以“需于沙”。沙是水边。虽然小有口舌，但是无害于商业，所以“终吉”。

问时运:“沙”字从“水”从“少”，是缺水的地方，无法行船。“ 需于沙”，犹如说时运不通。二爻爻辰在寅，在天上又值箕 宿，《诗纬》说箕为天口，主出气。“小有言”指谗言，但以 需道等待时机，故“终吉”。

问胎孕:生男孩

三爻

问征战:九三居内卦的终位，逼近外卦，而坎为寇，也为灾，故说“灾在外”。有敌寇来侵犯叫“寇至”，我自己去招惹 敌寇叫“致寇至”。必须以谨慎自我把持，先立于不败之地。

问经商:泥，拘泥的意思。行商这种行业宜于流转，不宜拘泥。倘若拘泥不化，内心怀有疑忌，就会导致外部的变故。 慢藏诲盗即“致寇”，可以不谨慎吗？

问功名:爻辞说“需于泥”，泥指水边的污泥。需在这里，就必将趋于下流而难期上达了，这样而不失败，只是侥幸罢了

问婚姻:《周易》以寇与婚媾对举，说寇就一定不是婚媾、 而是怨偶。“需于泥”是无法前进之象，婚事一定不成。 

问胎孕:生男孩

四爻

问征战:四爻为坎卦的开始，坎为血卦，“需于血”，指在战 斗中受了伤。“出自穴”，指虽然受伤，但还能脱离险难。它能够脱离险难，原因不在于强争而在于顺听，顺听才能避免危害。

问家宅:说“需于血，出自穴”，有出自幽谷，迁于乔木征 象。顺，指家道和顺。吉。

问经商:玩味爻辞，想必是采矿生意，“出自穴”就得利了。

问功名:所谓“呕尽心血方得出人头地”，有“需于血，出自穴"之象。

问疾病:想是吐血的症状，必须调养气血，使阴阳和顺，这样自然可以脱离危险而得以生存。

问胎孕:生男孩。虽然有小的险难，但最终得以安全生产

五爻

问征战:爻辞说“需于酒食”，有得胜后班师回朝，论功行赏 之象，故说“贞吉”。

问功名:正是与佳宾宴乐的时候，吉。

问经商:五爻互离卦，离于十二辰在午，在天上值柳宿，附 星有酒旗，有外厨，主宴享和饮食，可知一定是经营酒馆、 粮食等行业。另外坎为人，为纳，可知商业的输入一定有 余，所以“贞吉”。

问婚嫁:需卦五爻变阴则全卦为泰。泰卦六五说“帝乙归 妹，以祉元吉”，另外九三说“于食有福”，这就是“需于酒食” 的道理所在。“有福”，所以“贞吉”。《象传》说“以中正也”， 指体现了婚嫁的正道。

问胎孕:生男孩。得了儿子必定置办酒席，古今都是这样，所以爻辞说需于酒食

上爻

问征战:上爻为坎卦的终位，穴指坎险，“入于穴”，是说凭坎险而自守。“三人”指内卦的三个阳爻；“不速”指不请自来，即有敌兵从三面来包围。既然进入了险地，就不适宜继续战斗，而应该以礼接待而求和解，故说“敬之终吉”。

问经商:坎为劳卦，为万物所归，故说“入于穴”。穴即穴窟，指贮藏货物的地方。”三人来”指买主，用恭敬的礼仪接待他们，价格合适就销售，所以“终吉”。但坎为有水的穴窟，不适于贮藏货物，幸而有客人来，可以马上销售，所以说“虽不当位，未大失”。

问家宅:这屋子必定阴暗潮湿，幸而三面有阳光来照，故说吉。

问婚姻:需卦上六变阳则全卦为小畜，小畜的上九说“妇贞厉”。称妇，说明是已嫁的女人，故说“不当位”；但因为它“贞厉”，所以“终吉”。“入于穴”，有生则同室，死则同穴的意思。“三人来”，指媒人。

问疾病:说入穴，是凶象；说“终吉”，终结后才吉，占病也凶。

问胎孕:生男孩。说“终吉”，以前一定是缺少男孩`
]
const GUA_EXTRA_6 = [
    `讼:有孚，窒.惕中吉.终凶.利见大人，不利涉大川

彖曰:讼，上刚下险，险而健讼.讼有孚室，惕中吉，刚来而得中也终凶；讼不可成也.利见大人；尚中正也.不利涉大川；入于渊也象曰"天与水违行，讼；君子以作事谋始"

初六:不永所事，小有言，终吉.象曰"不永所事，讼不可长也.虽有小言，其辩明也"

九二:不克讼，归而逋，其邑人三百户，无.象曰"不克讼，归而逋也自下讼上患至掇也"

六三:食旧德，贞厉，终吉，或从王事，无成.象曰"食旧德，从上吉也"

九四:不克讼，复自命，渝安贞，吉.象曰"复即命，渝安贞；不失也"

九五:讼元吉.象曰"讼元吉，以中正也"

上九:或锡之带，终朝三褫之.象曰"以讼受服，亦不足敬也"`,
    `这个卦是异卦（下坎上乾）相叠.同需卦相反，互为“综卦”.乾为刚健，坎为险陷.刚与险，健与险，彼此反对，定生争讼.争讼非善事务必慎重戒惧

大象:乾天升于上，坎水降于下，相背而行而起讼

运势:事与愿违，凡事不顺，小人加害，宜防陷阱

事业:起初顺利，有利可图，继而受挫，务必警惕，慎之又慎，不得固执已见，极力避免介入诉讼纠纷的争执之中.与其这样，不如退而让人，求得化解，安于正理，可免除意外之灾.陷入争讼，即使获胜，最后还得失去，得不偿失

经商:和气生财，吃亏是福.切勿追求不义之财.商业谈判坚持公正公平，互利的原则，尽量避免发生冲突.这样，会有好结果

求名:不利.自己尚缺乏竞争实力，应坚守纯正，隐忍自励，自强自勉，切莫逞强.依靠有地位的人的帮助，及早渡过难关

婚恋:虽不尽人意，倒也般配，彼此理解，未尝不可.双方应以温和的方式处理生活

决策:争强好胜，不安于现状，为改变命运和超越他人而奋斗头脑聪颖，反应敏捷，有贵人相助.但缺乏持之以恒的毅力，容易露出锋芒，得罪他人，带来诉讼之灾.宜承认现实，顺其自然知足，适可而止.接受教训，引以为戒，可功成名就`,
    `讼，表示诉讼，争端之象.主大凶象.事情冲突到必须见官上法院，可能必须以法律途径来解决了！凡事皆不利，而且已引起很大口舌是非争持，而必须摊牌互相攻击的程度了。

解释:官司缠讼

特性:不服输，好竞争辩论，反应快，口才佳，易得罪他人，是自立自强之人

运势:百事闭塞不通，伤害频繁，受中伤而又易陷于奸计，不如意之运也.得饶人处且饶人，得过且过，莫再争讼，否则皆不利也.

家运:家庭内部不和，有口舌争端之害，并有散离之象

疾病:病情严重，为腰，血液，泌尿系统，头部疾患

胎孕:生产无惊阻，安也

子女:父子之间存有歧见，无法沟通之象.子女生来劳碌，与父母缘薄，多辛劳忧苦也.

周转:不得要领难成

买卖:因处理不当，有冲突争端，常招损失，不利也

等人:不会来.就算会来，双方必有争执情事发生

寻人:此人因争执事由负气出走，并有生命危险，又寻找不易，尽量往西北与北方寻找

失物:不会出现

外出:途中多有变故，宜改日出行

考试:不理想.

诉讼:两败俱伤，宜找中间人调解，久争无益

求事:难成.

改行:不利

开业:不宜`,
    `问征战:天之象是乾，乾为刚健勇武；水之象是坎，坎为寇盗，所以讼卦主讼事，也主军事。两军互相违背以至互相征战，而其相违背的原因在于尚未征战的时候，所以说“君子作事谋始”。这也是孔子慎于征战的旨意。

问经商:讼卦内卦互离，离为资财和斧钺；外卦互巽，巽为利市，有经商的意思。经商之道，彼此相合就会成功，相违就会失败，而且乾为开始，坎为谋划，所以说“作事谋始”。善始才能善终，商业才能长久而盛大。吉。

问功名:乾为健，坎为险，象征乾要前进而陷于坎险。这就是求功名为什么艰难。

问婚姻:婚姻是两姓间的情好相合而成，有相合之道而没有相违之理。男有家，女有室，是人伦的开始，所以君子一定要娶淑女，这是婚姻的谋始之道。

问疾病:疾病的发生一定是由于阴阳不和，不和就会相违而行，相违而行才成了疾病。治病的人应该先审慎于治疗的开始。

问胎孕:生男孩。

问失物:指东西从高处落入水中，不可能再得到。恐怕有大的口舌之争

初爻

问征战:讼是两人相争，战是两国相争，所以终极讼事与穷兵黩武都是凶事。爻辞说“不永所事”，是说一战而胜，不再滥用军队，从中越发能看出圣人是不得已才用兵的，而绝不好战。

问疾病:初爻象征初病，“不永所事”，是说不久就会痊愈，故说吉。占久病则凶

问功名:初爻居全卦的开始，是初次出门求名。“不永所事"，是说不会久困在人下，所以说“终吉”。

问经商:爻辞说“不永所事，小有言”，指商家贩卖货物，应该立即售出，即使买卖中小有争论也无大碍，故说“终吉”

二爻

问征战:二爻的应位是五爻，而五爻居尊位，为大国。二爻势力弱小，自己知道不能取胜，坎为隐伏，所以“归而逋”。三百户"为小邑。二爻既已逃窜，五爻也就停止了作战，于是“三百户”得以“无告”。

问经商:九二爻辰在寅，在天上值尾、箕、斗宿，附星为天弁，主在里巷和市区陈列货物，有经商之象。二爻变阴则全卦为否，否有损耗和失败之象，故说“不克”。外互卦为巽，巽为归，故说“归逋”。三百是小数目，所以说“无告”

问疾病:玩味爻象，一定是在外面得了病，应当迅速回家调治。病人归来后，病气不至于传染，故说邑人“无告”。

问功名:爻辞说“不克”，一时无法成名，退回来隐居也无害处。

问婚嫁:二爻与五爻相敌，尊贵与卑贱不相应，应当中止婚约。没有灾祸。

问胎孕:生男孩，恐怕无法保全

三爻

问征战:六三居坎卦的终位，逼近乾卦，即所谓“阴阳相薄”、“战乎乾”。坎本是乾元再索而得的中男，而乾为旧，为德，故说“食旧德”，即是儿子食用父亲原有的俸禄，安常守分，保有旧业，不去争战，所以吉。如果要出动君王的军队，那么坎为破，为灾，一定不会成功，故说“无成”，

问经商:爻辞说“食旧德”，可知这商业属于先辈的遗产。谨慎地固守，终究会得到吉祥。

问功名:应该继续谨守前人的旧业。或许想出外求官，必定不成。

问疾病:以仍服前一位医生开的方剂为吉。

问家宅:应该安居旧宅，不必另建新居。另建新居恐怕不会成功。

问胎孕:生男孩。这孩子长大后，也以继承父业为吉

四爻

问征战:四爻与初爻为敌，初爻既“不永所事”，四爻也失去了征战的对象，故说“不克”。乾为君，命指君命，“复即命”即凯旋而向君王复命。征战是危险的事，能转危为安，故吉。

问经商:玩味爻象，可知其商业必定是与初爻合办的，初爻既“不永所事”，四爻也复回而“即命”。复命即中止事情，故吉。

问婚姻:内卦坎为女方家，外卦乾为男方家。坎的初爻说“不永所事”，乾的初爻也复归而“即命”，即改变主意而另结婚约。《象传》说“不失”，指不失正道。

问疾病:至于“不克”，属于凶象。复为再生；坎为疾，为炎症；乾为生，为喜庆。复命即复乾。变凶险为安康，所以吉。

问胎孕:生男孩

五爻

问征战:五爻居君位，是主持战事的君王。师出有名，体现中道和正理，就是王者之师，就无敌于天下，故说“元吉”。

问商业:乾为利，坎为平。商业固然要谋利，但也要公平正直，这样才不至于争夺，商业才能符合正道，所以吉。

问功名:“讼”字从“言”从“公”，五爻为全卦的主爻。求名是以言论谋求考官的知遇。元指三元，即功名的魁首，吉祥没有比这更大的。

问婚姻:五爻为卦主，与五爻结亲，是以卑贱从尊贵，以贫乏从富有，所以说“元吉”。

问胎孕:生男孩。这孩子品貌端正，而且有福

上爻

问征战:上爻居乾阳的极位，乾阳至极就会相战。胜利已经很难了，却至于在一天内三胜三败。这样，败了固然耻辱，而胜了也不光荣。

问功名:锡，即赐。褫，夺的意思。或，表示非必然，只是假设“锡之带”，而至于在“终朝”间而三次被夺。这是个患得患失的卑鄙小人，哪处值得敬重呢！

问商业:玩味爻辞，是屡得屡失而最终得不偿失的意思。况且所得的财来路不正，所谓以悖逆纳入的，必定以悖逆支出，到底不是他的。这也是可鄙的。

问疾病:这病一定忽好忽犯，一日之间病状不一。在上爻，处在卦的极处，难以好转，恐怕最终凶险。

问胎孕:生男孩。恐怕男孩多半无法养大，一定要到第四胎才能养大`
]
const GUA_EXTRA_7 = [
    `师:贞，丈人，吉无咎

彖曰:师，众也，贞正也，能以众正，可以王矣.刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣

象曰:地中有水，师；君子以容民畜众

初六:师出以律，否减凶.象曰"师出以律，失律凶也"

九二:在师中，吉无咎，王三锡命.象曰"在师中吉，承天宠也.王三锡命怀万邦也"

六三:师或舆尸，凶.象曰"师或舆尸，大无功也"

六四:师左次，无咎.象曰"左次无咎，未失常也"

六五:田有禽，利执言，无咎.长子帅师，弟子舆尸，贞凶.象曰"长子帅师，以中行也.弟子舆师，使不当也"

上六:大君有命，开国承家，小人勿用.象曰"大君有命，以正功也小人勿用必乱邦也"`,
    `这个卦是异卦（下坎上坤）相叠.“师”指军队.坎为水，为险；坤为 地，为顺，喻寓兵于农.兵凶战危，用兵乃圣人不得已而为之，但 它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能 化凶为吉.

大象:养兵聚众，出师攻伐之象，彼此有伤，难得安宁

运势:困难重重，凡事以正规行事，忌独断独行，投机取巧，提防 潜在敌人.

事业:阻力很大，困难很多，处于激烈的竞争状态，必与他人密 切合作，谨小慎微，行为果断，切忌盲目妄动，适度即可，注意保 全自己.机动灵活，严于律已.从容沉着对付一切，必能成功

经商:已有一定的积蓄，可以从事大的营销活动，但必卷入激烈 商战，以刚毅顽强的精神和高尚的商业道德，辅以灵活的方法。勿贪图小利，勿掉以轻心，加强与他人的沟通，必可摆脱困境，化险为夷

求名:具备很好的条件，但须有正确的引导，务必严格要求自己，克服不利因素的干扰，经过扎实努力，必可名利双全.

婚恋:慎重，专注，否则会陷入“三角”纠纷.痴情追求可以达到目的.

决策:天资聪颖，性格灵活，具有坚强的意志，对事业执着追求， 迎难而进.可成就大事业.喜竞争，善争辩，富有冒险精神，不免带来麻烦，务老成持重，不贪功，以中正为要`,
    `师，表示军队打仗强烈抗争之意.师亦为师长，老师，是为强烈教训的现象，若在事，在人，均表示会受到很大教训，挫折.或是与人结怨甚深而遭到其强力的打击，迫害

解释:要师出有名.

特性:讲求实力，具有毅力，不怕困难，挑战艰巨任务，虽然时常会遇到逆境，都能一一化解克服，赢得他人的赞许

运势:事虽有不顺，但要引以为镜，记取教训.不要图私利而投机取巧.凡事应以正规而行，事物多变动，切忌独立而行.困难多端，靠自己努力，摒除一切困难为上策.

家运:外柔顺而内险恶，故家内常生不和，需慎重处理.行正道可化险为安

疾病:病况严重，提防心脏或腹腔肿瘤等

胎孕:喜中有忧或有不安或不孕

子女:大出息之象

周转:无望另觅别处

买卖:有阻，不太顺意，寅午戌日交易可成

等人:来者不善

寻人:此人因家内失和而出走，速往北方或西南找，否则有危险.

失物:不会出现，即或寻回，也已损坏

外出:“行险而顺”.虽有可能遇到麻烦，但结果一定十分顺利，可放心出行

考试:很认真，但不理想，继续努力终有成就

诉讼:宜进不宜退，内心虽忧，但得贵人之助求事:独立无望，有人扶持则可

改行:不宜

开业:须待时机行事，勿过急`,
    `问征战:以师为卦名，爻的意思也就很明白，可以根据各爻的情况而推究，吉凶自有应验

问经商:坤为财，为聚，坎为入，为纳，自有容纳和保护的器量。水在地中，为地所包容；财源如水，流动不息，所以商业会导致富有。吉

问功名:水在地中，犹如读书人还在草野而尚未显达。但是其德行和器量自能包容人民和万物，一经任用，就会像水流向海一样，利益很广。“君子”是对有德有位者的称谓。吉

问婚嫁:坤卦和坎卦相互为用，地和水彼此相亲，必定是旧亲之间联姻。大吉

问疾病:一定是水满腹胀的病症。坎为心，为忧患，应当息心调气，解忧取乐，这样自会痊愈。

问胎孕:生男孩

初爻

问功名:初爻象征初次出来求名。军队以“出师以律”为正犹如士人以道为重。倘若失去士人之道，即使一时荣显，最后也会受辱。凶。

问经商:得初爻，可知是新建立的事业；水在地中，可知属于海运商务。总之，依道义谋利的吉，背离道义的凶。

问家宅:师的内卦为坎，外卦为坤，住宅必定坐子丑，朝午未。宅中人口众多。“出师以律”，犹如说治家应当凭法度。否，不的意思；臧，善的意思。不善治家，家道必定凶。

问疾病:师卦一个阳爻而五个阴爻，必定寒气多而热气少。病症属于初起，应当请良医调治，否则凶险

二爻

问功名:九二以一个阳爻统率五个阴爻，爻辞说“在师中，吉”，说明他鹤立鸡群，属于杰出的人才。“王三锡命”，指按能力授予官爵，显示荣膺君王的任命，

问经商:九二为全卦的主爻，所象征的人一定谋略出众，在商务活动中有老成练达的称誉，是可以推举为商业公司经理的人。吉

问家宅:说“在师中，吉”，这家一定是一乡中的巨室，也是一乡中的善人。

问婚姻:九二变阴则全卦为坤，坤为地道和妻道。水和土的特性相合，所以吉，

问疾病:是水气停积中宫的病症，必须使水气流动，中焦宽舒，这样病才无害。吉。

问胎孕:生男孩

三爻

问商业:坎为大舆，舆用来载货物。坎又为陷，为破，大舆遇到险隘，就会车破货散。死后的人体叫尸，等于说车毁物丢。“或”字表示不一定。“大无功”即大失利。行商虽然未必会遇到这样的凶险，但也不可不防，因为爻象是这样戒止的。

问功名:“君子得舆”，得即德，舆用来载德而行。君子，对有德有位者的称呼。有人说“舆尸”是无德而尸位的人，所以凶。

问家宅:阴阳家称作堪舆，堪为天，舆为地，舆尸是地有尸气，哪能不凶？

问婚嫁:三爻居坎卦的终位，得到了乾元之气。乾在下而巽在上的卦为小畜，小畜的三爻说“舆说辐，夫妻反目”，《象传》说“不能正室”，凶险由此可知。

问胎孕:虽然生的是男孩，但是凶险

四爻

问家宅:四爻出了坎卦，进入坤卦。坤为西南，住宅必定朝西南。吉事崇尚左，住宅逼近东方，而青龙主喜，所以吉没有灾祸。

问功名:官职下降称为左，如所谓“左迁”。说“左次”，不吉。

问经商:右高左低，次也是低的意思。占得四爻，可知货物必定不属于高品位。但货物虽次，却可以获利，所以说“未失常"。

问婚姻:男人崇尚右，女人崇尚左，爻辞说“左次”，或许是入赘到女方家吧？不过入赘也无害，

问疾病:春天的生气发生在左方，得到春天的生气，病一定无害。

问胎孕:生女孩

五爻

问经商:爻辞说“田有禽”，等于说农业有谷物，商业有利润。“执言”，指契约和证券。在商业上，总要以老成练达的人为主才有利，否则凶险。

问家宅:住宅想是立约新买的，利益在于长房，不利于众子弟。

问功名:这人才能素来出色，有在一天早晨猎获十只禽兽的技能。但重要的是品德优于别人，如果品德差于别人，即使有技能也凶险。

问婚姻:“有禽”，指奠雁的礼仪；“执言”，指媒妁的书信。所约的婚姻，以长子长女为吉

问胎孕:生男孩，是震卦所象征的长男

上爻

问家宅:爻辞说“大君有命，开国承家”，可知这家必定是阀阅巨室。“小人勿用”，是对其后嗣的禁诫。

问经商:上六爻辰在巳，得到了巽气，而巽为商，为“近利市三倍”，所以这家一定是因为商业而兴盛的。巽又为命，爻辞说“大君有命”，则又将因为富有而尊贵，家道日益隆盛。但富贵而生骄气，亲昵小人，则是所应当戒止的。

问功名:上六居卦的终位，值论功行赏的时候，正可以看出功名的显赫。震卦所象征的长子自然能够“承家”，只是坎卦所象征的中男不可任用，所以说“小人勿用”。

问婚姻:师卦三至六爻为坤，坤为妻道。爻辞说“开国承家”，主两姓都是巨室；说“大君有命”，媒妁一定是有官位的人。吉。

问胎孕:生男孩，并且主贵`
]
const GUA_EXTRA_8 = [
    `比:吉.原筮元永贞，无咎.不宁方来，后夫凶

彖曰:比，吉也，比，辅也，下顺从也.原筮元永贞，无咎，以刚中也不宁方来，上下应也.后夫凶，其道穷也

象曰:地上有水，比；先王以建万国，亲诸侯

初六:有孚比之，无咎.有孚盈缶，终来有他，吉.象曰"比之初六，有他吉也"

六二:比自内，贞吉.象曰"比之自内，不自失也"

六三:比之匪人.象曰"比之匪人，不亦伤乎！"

六四:外比之，贞吉.象曰"外比於贤，以从上也"

九五:显比，王用三驱，失前禽.邑人不诫，吉.象曰"显比之吉，位正中也.舍逆取顺，失前禽也.邑人不诫，上使中也"

上六:比之无首，凶.象曰"比之无首，无所终也"`,
    `这个卦是异卦（下坤上坎）相叠，坤为地，坎为水.水附大地，地纳 河海，相互依赖，亲密无间.此卦与师卦完全相反，互为综卦.它 阐述的是相亲相辅，宽宏无私，精诚团结的道理

大象:一阳统五阴，比邻相亲相辅，和乐之象

运势:平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑

事业:顺利能够成功，向前发展，可以得到他人的帮助和辅佐， 以诚实，信任的态度去做事.待人宽厚，正直，主动热情，向才德 高尚的人士学习听取建议

经商:愿望能够实现，且有较丰厚的利润，但需要与他人密切合 作，真诚交往，讲究商业道德，遵守信义，如唯利是图，贪心不足，或自以为是，会导致严重损失

求名:有成功的希望，不仅要靠个人的努力，更为重要的是他人 的赏识和栽培.

婚恋:美好姻缘，相亲相爱，彼此忠诚，白头到老.

决策:心地善良，待人忠诚，厚道，乐于帮助他人，也能得到回报. 工作勤恳，对自己要求严格，可以实现自己的理想，但要多动脑 筋，多思考，善于判断是非，尤其要注意选择朋友，一旦结上品 行不端的人，会成为自己的祸患.如果与比自己高明的人交朋 友，并取得帮助，会终身受益`,
    `比，表示兄友比肩而站，一片融合互持，比和之意.主吉象.水溶入土中，胶和在一起，是个很亲密的卦象，尤其是论男女之情事业投资有亲密的伙伴相助，共同扶持打拼，事事当然顺利进行.

解释:平等，比合

特性:勤劳，认真，善良，谦恭，务实，踏实，重生活享受.异性缘多，感情烦恼也多

运势:平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑

家运:合家和乐家运亨通

疾病:新病宜速就医，久病则危，为腹，肾，耳等疾

胎孕:孕安

子女:儿女温顺且侍亲至孝，亲情融合之象周转必成，找同年之兄弟，朋友可成

买卖:莫太贪心.交易反覆难成，勿贪则有利可成

等人:会来，

寻人:不在杏花处，则是有妇人相留，不可寻，恐生不测之祸.此人会自己回来

失物:不会再现.通常均已遭损毁

外出:旅途平安，一路顺风

考试:金榜题名

诉讼:宜以和解态度面对，虽小人多，但可胜诉求事有贵人帮助，可成

改行:有利，可得友人支持

开业:可大发利市，但须注意有人背叛`,
    `问征战:玩味爻象，军威盛大，像水就下一样沛然而不可阻遏。一战平定之后，就应当裂土封侯，建立藩镇。

问经商:水在地上无处不流，商业也靠流通来赢利。比是亲辅的意思，得以与亲比的人共事，这样商业就可以长久了。

问功名:建国封侯是士人贵显的极致。比卦反过来是师卦，师卦的上六说“大君有命，开国承家，“说的就是这件事。

问家宅:住宅一定低洼而接近水，也接近贵人的住宅。宅基很吉。

问婚姻:比是亲好的意思。地与水本来相亲比。占婚姻而得到这一爻，必定是百年好合，并且主贵。

问疾病:坤为地，也为腹；坎为水，也为心。恐怕是心腹水肿的病症。诸侯能治国，犹如医生能治病，应该就近求治。吉。

问胎孕:生女孩，并主贵

初爻

问征战:有禹中止讨伐停止进贡的三苗，以文德和干羽之舞使他们受到感化之象，故说“有孚比之，无咎”。

问经商:商业以信实为主，这样远近的客商才能前来亲比，才能广泛地贸易，更多地获利。吉。

问功名:“有孚比之”，即中孚卦所谓“信及豚鱼”。中孚九二说“我有好爵，吾与尔靡之。”靡，共同的意思，指我愿意与你亲比，共同发展。所以说“比之初六，有他吉”。

问婚姻:玩味爻辞，是说既相感孚又相亲比，亲近极了。凭这订婚，吉而无咎。

问家宅:比是比邻。近的既信义相孚，往来亲密，远的也闻风来做比邻，故说“终来有他吉”。

问胎孕:生女孩

二爻

问征战:士卒同心协力，上级和下级结为一体，战无不胜，故说“比之自内，贞吉”。

问功名:内即自己。自己有实在的学识和修养，足以感孚别人，就是所谓“实至而名归”。吉。

问经商:全店伙计性情亲和融洽，自然做什么都和顺。凭这一点出去贸易，别人都信服，没有不获利的，所以《象传》说“比之自内，不自失也。”

问疾病:内为心腹。有病总要心平气和，内脏充分发挥作用，外邪就会自然消除，所以吉。

问婚姻:必定是内亲之间重又联姻，吉。

问胎孕:生女孩

三爻

问征战:任用太监做监军，偏听奸佞之人的参谋，爻辞所说“比之匪人”就是，怎么能不败？

问经商:商业的盛衰在人。经商的人天天与市井无赖之辈征逐往来，“匪人”日益亲密，正经人日益疏远，不但事业立刻失败，连人的品质也不可问了。

问功名:交往之道不正，人品日益下流，不但名誉扫地，灾祸也会随后到来。

问婚姻:女子羡慕贞洁，男子效法良才，这是人伦的正道。如果不是配偶，却为之贻误终身，不也值得悲伤吗？

四爻

问征战:爻辞说“外比之”，是外部夷人归服之象，故说“贞吉

问经商:想是海外商业，货物的流通无处不到，所以说“外比之，贞吉"。

问功名:四爻在外卦而比五爻，五爻居君位，有为君王所知遇之象，功名的显赫由此可知。

问家宅:二爻在内卦，四爻在外卦，都说“贞吉”，自然内外亲比，全家和睦。

问婚嫁:玩味爻辞，想是在外地订亲。吉。

问胎孕:生男孩

五爻

问征战:有投降者不杀戮、奔逃者不禁止的大恩德大威武，所以说“王用三驱，失前禽”；有耕作者不变色、贸易者不停止的德化，所以说“邑人不诫，吉”。

问经商:玩味爻辞，只要不贪目前的小利，不图意外的财物，舍逆取顺，开头虽有损耗，后来自然盈利。

问疾病:症状已经明显，以前服用了驱除邪气的药剂，邪气已经像消失了一样。不必害怕，自会痊愈，吉。

问功名:在驱驰中发生事情，前面的成功虽然失去，后来的效果一定显著。吉

上爻

问征战:首指军队的首领，即主帅。“无首”意味着没有主帅，所以凶。

问经商:五爻为卦主，而上爻不来亲比，犹如经商的伙计不与店主相亲比，是目中“无首”，所有的谋划都必然没有结果。凶。

问功名:求名以成绩最高的为首，叫做榜首、魁首，既然”无首“，哪里有名次？凶。

问家宅:恐怕损丧一家之主，凶。

问婚姻:不知为什么没有主婚人？婚庆人家的来历不太明白。凶。

问胎孕:生女孩，恐怕有怪病`
]
const GUA_EXTRA_9 = [
    `小畜:亨密云不雨，自我西郊

彖曰:小畜；柔得位，而上下应之，曰小畜.健而巽，刚中而志行，乃亨.密云不雨，尚往也.自我西郊，施未行也.

象曰:风行天上，小畜；君子以懿文德

初九:复自道，何其咎，吉.象曰"复自道，其义吉也"

九二:牵复，吉.象曰"牵复在中，亦不自失也"

九三:舆说辐，夫妻反目.象曰"夫妻反目，不能正室也"

六四:有孚，血去惕出，无咎.象曰"有孚惕出，上合志也"

九五:有孚挛如，富以其邻.象曰"有孚挛如，不独富也"

上九:既雨既处，尚德载，妇贞厉.月几望，君子征凶

象曰:既雨既处，德积载也.君子征凶，有所疑也`,
    `这个卦是异卦（下乾上巽）相叠，乾为天，巽为风.喻风调雨顺，谷物滋长，故卦名小畜（蓄）.力量有限，须待发展到一定程度，才可大有作为

大象:蓄养之量有限，力不从心，故宜忍耐蓄养实力，静待时机.

运势:运势反覆，有口舌之争，但难于短期内解决，须忍耐，静待时机.

事业:时机尚不成熟，应当耐心而积极地积存力量，切不可冒险行动.遇到挫折不可灰心，鼓起勇气战胜困难，坚持原则，加强团结合作，提前做好各项准备，会有所成

经商:已有一定的基础，但有失去危险，一定要特别慎重，争取与他人真诚合作，共同获利，决不贪心，适可而止，但更不能满足现状不图进取

求名:树立远大目标，尽最大努力去争取，虚心求教他人，取得真诚帮助，实现自己的理想，警惕小人的破坏

婚恋:双方必须十分忠诚，第三者插足的现象极有可能发生.

决策:不很顺利，前进途中会遇到一些意想不到的困难.但由于本人性格坚强，具有战胜不利条件的意志.因此，可以实理自己的理想.但极有可能遭到小人的伤害，必须得到志同道合者的真诚相助，才能可能排除障碍.对所得应满足，适可而止，切不可过度追求以免满招损`,
    `小畜，表示小有积蓄.是个小吉卦，事事不可贪大，投资理财均需保守为佳.健康无碍，平顺

解释:稍有积蓄

特性:上进心，求知欲强，思想灵敏，察言观色，善解人意，追求精神层次，美好事物有艺术美学方面天分

运势:有蓄聚，阻止之意.一阴畜五阳，虽有云雨而不下，雨之不下，大地不能得到滋润，故此运势有反覆，有口舌，又难以急调，诸事宜忍耐，等待时机.尤其女人得此卦更应在行为上，对事或对人有所节制

家运:不和且多是非，衰而不振，多劳，要耐心应对，以待时机.雨过天必晴

疾病:危，重病，注意肝胆，头部病变

胎孕:宜防流产

子女:因子女而劳碌之象，但晚年有福也

周转:有女人从中阻碍不成也

买卖:景气不好，买卖难成或利薄

等人:不会来临时变卦

寻人:因感情或家庭不和出走，只在原处.东南或西北之向

失物:似乎遗失的是金器或现金支票等物，有被硬物夹住，或者第三格的地方

外出:准备尚未充分，不得仓促出行，尤其忌长途旅行，会有意外的灾害应另择他日外出

考试:不理想

诉讼:会因证据不足而败诉

求事:希望渺小

改行:不宜

开业:不宜，已开业者则困难，口舌多`,
    `问时运:目前平平常常，有行动被人牵制和阻碍的忧虑。

问商业:有外表完美，内部却多有损耗之象。

问出行:主有风波。

问家宅:主小康人家，要防止口舌导致祸患。

问征战:虽有雷厉风行的气势，但恩泽还没有感通，只能获得小捷，难以得到大胜。

问胎孕:生女孩，并要防止流产。

问行人:恐怕乘船时因为风向而受阻，迟一些可以归来。没有灾祸。

问婚姻:主得美貌的淑女，吉。

问年成:主多风少雨，收成平平。

问疾病:主风火的病症，小儿吉，大人凶

初爻

问时运:目前平常，应该退守，没有灾祸。

问商业:适宜稳妥地守住旧业，不宜创立新的事业。

问家宅:所谓“士食旧德，农服先畴”，返求于自己，不羡慕其他，家道自会亨通。

问疾病:应当静心休养，这样自然可以复原。

问胎孕:生男孩。

问行人:马上归来。

问年成:丰收

二爻

问时运:因人成事，自然能够获利，大吉。

问商业:适宜创立与人共有的公司，或者重振旧业，都吉。

问家宅:主兄弟和睦，恢复先辈的家业，一定会使家道兴隆，是大吉之象。

问疾病:一定是旧病复发，只要小心调治就无妨。

问行人:即日与伴侣一同归来。

问征战:主连日得胜。

问胎孕:生女孩。

问年成:丰收

三爻

问时运:阴盛阳衰，内外都不安宁，最应当以谨慎自守。

问商业:有积货，应当赶快销售掉。凡众人所争售的货物千万不要卖，众人所不卖的货物要赶紧经营，这叫做反其道而行，必定得利。

问家业:阴阳颠倒，家室不和。

问疾病:要防止医生失察，以寒为热，以虚为实，药不对症，以至阴阳相反。应当赶紧另外选择良医，这样病一定会脱体，吉。

问征战:军心不和，防止有车辙错乱、旗帜倒下、倒戈相向的祸患。

问行人:即日可以回来。

问出行:恐怕中途有危险。

问胎孕:生男孩，主眼睛有病。

问年成:不好。

问婚姻:不利

四爻

问时运:目前不免忧虑，切忌与人争斗，以免受到损伤。应当出门远远地躲避，这样才会无祸。

问功名:一定会得到上级的契合，马上就有升迁，大吉。

问征战:有利于出兵进攻，可以得胜。

问家业:对妻妾和仆从的管理要得法，否则必定反受他们的制伏，这是应该充分注意的。

问行商:利在西北，不利于东南。

问疾病:是外寒里热的病症，治疗宜于宽解，不宜用燥烈的药物。

问谋事:能得到邻里的相助。

占行人:恐怕中途遇到危险，应当穿低贱者的服装，在潜隐中行路，凭忍隐避难。

占胎孕:这一胎生女孩，以后可以连生五个男孩

五爻

问商业:有各种货物辐辏而来，众商人悦服之象，非常有利。

问时运:一生气运亨通，做什么都有利。

问功名:主连续得到升迁，官位与财俸禄两全。

问家业:主历代忠厚，恩惠泽及邻里，不但富有，而且能尊贵显达。

问征战:主将士同心协力，有国土日益开辟之象。

问胎孕:有孪生之象。

问疾病:主麻痹不仁，手足挛拘的病症。

问失物:应当从邻近处寻觅，自会得到。

问出行:应当结伴而行，不宜独自前往

上爻

问时运:有过去希望无法实现，现在得以如意之象。

问家业:有先困顿而后亨通之象。

问经商:应当得到利润就停止，倘若贪得无厌，最终恐怕因为盈满而导致凶咎。

问征战:既然已经得胜，就应当立即停战，倘若继续进攻，将不利于主帅。

问年成:旱，但不成灾害。

问胎孕:生女孩。

问行人:马上归来。

问出行:不利`
]
const GUA_EXTRA_10 = [
    `履:履虎尾,不咥人,亨,

彖曰:履，柔履刚也说而应乎乾，是以履虎尾，不咥人，亨刚中正，履帝位而不疚，光明也

象曰:上天下泽，雁；君子以辨上下，安民志

初九:素履，往无咎.象曰"素履之往，独行愿也"

九二:履道坦坦,幽人贞吉.象曰"幽人贞吉,中不自乱也"

六三:眇能视，跛能履，履虎尾，咥人凶.武人为于大君象曰"眇能视；不足以有明也.跛能履；不足以与行也，咥人之凶；位不当 也武人为干大君；志刚也"

九四:履虎尾，觀塑终吉，象曰"愬愬终吉，志行也"

九五:夫国，贞厉，象曰"夬展贞厉，位正当也"

上九:视履考祥，其旋元吉.象曰"元吉在上，大有庆也"`,
    `这个卦是异卦（下兑上乾）相叠，乾为天，兑为泽，以天喻君，以泽喻民，原文，“履（踩）虎尾，不咥（咬）人”.因此，结果吉利.君上民下，各得其位.兑柔遇乾刚，所履危.履意为实践，卦义是脚踏实地的向前进取的意思.

大象:柔弱遇刚强，欲行却难行之象，难且危也.

运势:先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险

事业:起初很不顺利，受到种种威胁，若能提高警惕，谨小慎微，脚踏实地，逐个地去克服困难，不改变自己的决心，一定可以达到目的.办事有自知之明，务必量力而行，不可不顾实际，尤其不得逞强急于求成.

经商:宜待观动静，勿为小利而动摇自己计划，尤其不得贪得无厌，遵循商业道德，了解全面信息

求名:务必有恒心，孜孜以求，不为财富利诱，不为世俗干扰，坚持自己的志向和理想，可以取得成功

婚恋:双方安贫乐道，可和睦相处，若一方为富贵所动，会发生婚变.

决策:诸事必须小心慎重，不利的情况经常会出现，但若能处理得好，总会是有惊无险，化险为夷.为此，办事必须认认真真，遵循正道，虚心听取别人的建议，量力而行，切莫自负逞强，一定会有好的结果.`,
    `履，表示战战兢兢，如履薄冰而行，却是有惊无险，为小凶带吉之象.履又为礼也.得此卦者，需尽快反省自己的态度，对人，对事，对长辈是否有轻忽，不敬之意.虽有危急之事幸好能平安度过.

解释:只要履行契约承诺则吉

特性:竞争，积极，冒险，热枕，独立，自立自强，有骨气

运势:先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险

家运:新婚而刚建立家庭者，多碍，劳苦.但此卦有先苦后甘之象，和气可生财，过些时日即可雨过天晴也

疾病:病虽重.但注意调理亦可愈，防头，口，肺等疾

胎孕:临盆产妇占得则吉，否则有受惊吓之象，需安胎

子女:初运有劳苦，障碍，困难之象，但以后能获得幸福也

周转:虽有些困难，但不必急躁，谦恭而施则可成也

买卖:虽有是非但终可成，牛马猴之月或日方成

等人:迟来

寻人:走失之人有生命危险，在西方或西北方向，难寻，须争取时效申未日可见

失物:赶快去找有可能寻回，留意行过的路上，或者有鞋的地方

外出:有惊无险，可以外出，但非紧急情况可以缓行

考试:不理想

诉讼:敌强而我弱之象，宜步步为营

求事:有贵人提拔，可发展，称心

改行:不宜

开业:不宜 `,
    `问家业:有门庭肃穆，仆人和妻妾都很顺从之象。

问任官:有品级逐渐提高之象，但如果通过攀援寻求进步，则反而不利。

问经商:且辨别货物的品位，切实考察行情，等待销售的时机，一定能得到高价。

问出行:利于滨海之类地方。

问胎孕:生女孩。

问疾病:应当疏通中焦。

问遗失:一时被东西所遮掩，久后会自然出现

初爻

问功名:应当安居乐道，等待时运亨通，到那时做事就无往不利了。

问经商:应当持守旧业，久后一定能获利。

问谋事:宜于宽缓地等待，不宜急迫

问征战:应当独自在暗中刺探敌情，没有灾祸。

问家宅:“福履绥之”，门庭吉祥。

问胎孕:生男孩

二爻

问功名:有志愿高尚之象

问经商:一时物价平平，只可以得到微利。

问出行:平稳而得吉。

问终身:有以恭敬修身的志愿。

问家宅:有分财产之象。

问失物:有意外损耗的忧虑

三爻

问家宅:有暗昧不明，少的欺凌老的，小的欺凌大的之象。

问商业:有被人欺骗或玩弄，急切而无法售出的忧虑。

问征战:应该退守而不应该进攻，妄动的人凶险。

问行人:恐怕中途遇到危险。

问失物:就近寻觅，自会找到。

问胎孕:生男孩，但要防婴儿有残疾

四爻

问时运:以温和待人，以笃实担当事，即使面临危险，最终也能够免于祸患，是气运平稳的时候。

问商业:不宜急于脱货，应当谨慎耐心地守候，终究会得到利益。

问征战:面临危险，宜于固守，遇到救助而获胜，可以扭转战局，转败为胜。

问胎孕:平稳得到男孩

五爻

问时运:先苦后甜。目前正是拨云见日的时候，还应当不忘过去的苦境，兢兢业业地做事，这样才能长保富有。

问商业:应当和衷共济。有货不要急于出售，久后必定得到厚利。

问失物:有不用寻找就自然得到之象。

问功名:目前已经得到升迁，只要谨慎就可以长久地保有。

问疾病:先危险后安然

上爻

问时运:目前正是安乐的时候，这人平素的行为一定没有亏欠，所以晚运亨通，福寿双全。大吉。

问商业:往返的经营都得到大利益。

问家宅:“祸福无门，惟人自招”，只要积善行德，就一定有意外的喜庆。

问疾病:恐怕寿命有限。

问失物:不用寻找，自然会得到。

问胎孕:必定生尊贵的儿子。

问征战:获得大的胜利，高奏凯歌而回`
]
const GUA_EXTRA_11 = [
    `泰:小往大来吉亨

彖曰:泰，小往大来，吉亨.则是天地交，而万物通也；上下交，而其志同也.内阳而外阴，内健而外顺，内君子而外小人，君子道长小人道消也

象曰:天地交泰，后以财成天地之道，辅相天地之宜，以左右民

初九:拔茅茹，以其夤，征吉.象曰"拔茅征吉，志在外也"

九二:包荒，用冯河，不遐遗，朋亡，得尚于中行.象曰"包荒，得尚于中行以光大也"

九三:无平不陂，无往不复，艰贞无咎.勿恤其孚，于食有福.象曰"无往不复天地际也"

六四:翩翩不富，以其邻，不戒以孚.象曰"翩翩不富，皆失实也.不戒以孚，中心愿也"

六五:帝乙归妹，以祉元吉.象曰"以祉元吉，中以行愿也"

上六:城复于隍，勿用师.自邑告命，贞吝.象曰"城复于隍，其命乱也"`,
    `这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭.反之则凶，万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）.

大象:天地阴阳之气相交感，上下和睦，流通无阻

运势:诸事吉祥顺利，凡事宜内求，不宜外求，防乐极生悲

事业:坚持由小而大，循序渐进的原则，事业已达到顺利的境地，更应小心从事，居安思危，积极寻求，开拓新的事业，方可继续前进，若因循守旧，不思进取，必遭失败

经商:顺利.务必注意市场动向，开拓新的领域，展开新的竞争.为此，密切与他人的合作，争取各方面的帮助，但需谦虚谨慎，警惕巧言令色的小人.

求名:具有成功的条件，但一定得更加努力，刻苦追求，最忌聪明反被聪明误

婚恋:美满姻缘.谈恋爱却不可不认真对待

决策:吉祥如意.适应能力强，各项事业能成功.能谋善断，长于人际关系，能团结他人共创业绩，灵活机动，很能适应形势的变化，不断向新的领域迈进.但在人生途中必须兢兢业业，尤其不可麻痹大意，在择朋选友方面更应慎重，切防小人倒运.`,
    `泰，表示三阳开泰，万事亨通.吉卦之象，诸事皆顺

解释:否极泰来鸿运当头

特性:交游广泛，包容性大，有雅量，个性开朗，乐观，积极，主动又能接受他人意见，心胸开阔

运势:诸事如意吉祥，前途事业均顺利.切不可骄傲或任意从事，亦宜自惕勿太活跃，始能免于灾难.凡事宜求内在之实，不求外在之虚否则有破

家运:家庭和合，有通亨之象，凡事宜检点得失，不可胡为，否则招灾不利

疾病:久病不利，注意肠肺及头部之症

胎孕:生贵子.安而无灾.生女亦均无碍

子女:亲子和睦，幸福圆满.留心教养，勿使太任性，否则沦于不幸之破运

周转:可成

买卖:交易有益得利

等人:会来

寻人:在朋友或亲戚家里，有信息也.可寻

失物:不会出现

外出:一帆风顺

考试:上榜有望，宜再努力勿懈

诉讼:是非由小事化大，终可和解

求事:吉利亨通

改行:吉

开业:开业者吉利之象`,
    `问国家气运:正是君明臣良、百姓安泰的全盛时期，但盛极就会衰落。好在否泰在天，回挽却在于人，所以应当深谋远虑。家道也是这样。

问谋事:事情一定会成就，但必须防止后来的败坏。

问婚嫁:属于阴阳合体的卦，是大吉之象，

问商业:买卖都吉，但卖出利益微少，买入利益大，这从“小往大来”的说法可以知道。

问年成:雨水调和，是丰登之象。

问胎孕:有男女孪生之象。

问失物:要从左右近处寻觅，自能见到

初爻

问时运:有因人成事之象。

问家宅:有家室团圆，人口平安的吉庆。

问经商:有主人和伙计志同道合，货物和钱财汇萃而来之象。

问功名:有逐渐升迁的喜庆。

问征战:凭进攻获得胜利。

问失物:应该在丛草处寻觅。

问胎孕:初胎生女孩，三四胎生男孩

二爻

问时运:正是功名显达的时候，可以远游海外，兴办事业。

问功名:有奉使远行或从事军事征伐的征兆，都能得吉。

问商业:有利于行商贩运外地的货物

问失物:一定坠落在水中，恐怕难以寻得。

问疾病:不吉。

问家宅:用人要宽容，处事要果决，不可偏信仆从的话，以致损耗家业。

问征战:有恩抚偏远处的人民，征伐不朝贡的地区，而疆土日益开辟的趋势。

问胎孕:生男孩

三爻

问时运:行事谨慎的人昌盛，耽于逸乐的人失败，这是最该留意的。

问商业:现在虽然失意，以后必得大利。

问征战:必须防止敌兵埋伏，适宜固守，不适宜进攻。

问失物:不久就会得到。

问生产:虽然危险，但没有灾祸，必定生有福的儿子。

问家业:应当谨守先人的家业，可以长保富有。

问疾病:少年无害，老年人命限有阻碍

四爻

问时运:好在得到朋友的同心相孚，凡事可以图谋。

问商业:外表场面很好，内里却已经空虚，全靠同行相助才能成事。

问征战:粮饷缺乏，应当劫掠敌人的，来供应军队的需要。军心稳固，只有胜利，没有失败。

问家业:本来是一个富厚人家，目前却外强中干，幸而亲戚邻里都能互通有无，所以不忧虑匮乏，

问失物:主遗落在比邻的人家，询问就能得到

五爻

问时运:目前亨通，适宜谦虚柔顺，这样凡事都吉。

问商业:适宜到海外进行贸易，吉。

问家宅:得到贤良的内助。

问婚嫁:适宜远嫁或远娶，吉。

问胎孕:主生贵女。

问疾病:必定得到神的保佑，吉。

问失物:拾到的人必定亲自来归还

上爻

问时运:目前气运颠倒，应该谨慎自守，还须防备小人拨弄是非。

问商业:应该保守从事，以等待时运。

问征战:攻城略地，必定胜利

问家宅:防止颠覆破败，适宜稳守旧业。

问生产:生女孩。

问失物:恐怕难以复得`
]
const GUA_EXTRA_12 = [
    `否:否之匪人，不利君子贞，大往小来

彖曰:否之匪人，不利君子贞.大往小来，则是天地不交，而万物不通也；上下不交，而天下无邦也.内阴而外阳，内柔而外刚，内小人而外君子小人道长，君子道消也

象曰:天地不交，否；君子以俭德辟难，不可荣以禄.

初六:拔茅茹，以其夤，贞吉亨.象曰"拔茅贞吉，志在君也"

六二:包承.小人吉，大人否亨.象曰"大人否亨，不乱群也"

六三:包羞.象曰"包羞，位不当也"

九四:有命无咎，畴离祉.象曰"有命无咎，志行也"

九五:休否，大人吉.其亡其亡，系于苞桑.象曰"大人之吉，位正当也"

上九:倾否，先否后喜.象曰"否终则倾，何可长也"`,
    `这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通.它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果

大象:天气上升，地气下降，天地之气不交，主闭塞不通

运势:上下不和，百事不通，凡事宜忍，须知否极泰来

事业:陷入逆境，事业处于衰退阶段，多有不顺利.受小人干扰而不得志，多挫折.应坚持正道，勿与小人合流，团结志同道合者，自保以等待时机.保持自信心，戒慎恐惧，形势定会好转，事业终能成功

经商:遇到强大的竞争对手，处于不利地位.信息不灵造成重大损失.应格外小心谨慎，坚持守势，等待有利时机到来，再发展自己的营销事业.

求名:条件还不成熟，再努力一阵子，并得到他人的帮助，理想可以实现.

婚恋:容易出现节外生枝的事情，甚至发生挫折和变故，双方若都充满信心，好的结果会出现

决策:本人聪慧，精明，勤奋努力，但不注意人际关系，加上小人的排斥，命运或遭厄运.意志坚强，具有奋斗精神，且克服了不足，尽管付出的代价很高，必能成全事业.`,
    `否，表示不好，坏掉了！主凶象.否显现出阴阳之气不协调，在人及事方面诸多不被认同，有内外不合，众说纷纭的现象，因此事事难以进行，最好此时能彼此互相退让静下心来理性的沟通。方能转吉.婚姻，感情，已有个性，意见的冲突产生，若不能好好退让协商，恐有离异分手的结局

解释处在困境中.

特性:自尊心强，个性刚烈，不服输，反应快，学习能力强，高傲不亦亲近.财运佳，有领导才能，与上司不易相处

运势:凶且衰，君子以险德避难，不可荣以禄也.运势不通达，诸事不顺，有损失且波折多.故宜守固正道，若稍偏差，则灾害至也.

家运:夫妻彼此不能协调，是非很多，劫财又带衰，慎之

疾病:占病为凶兆，病在脑，肺及肠胃等，慎防癌症

胎孕:不安

子女:与双亲感情不睦，任其自然发展吧

周转:告货无门

买卖:多有损失，但有贵人应在午未申日.

等人:不会来，因别的事情而违约

寻人:因感情不睦而出走，去向不明，难寻.东南方.

失物:寻不回

外出:会遇到不少麻烦和困难，宜推迟或提前行动

考试:不理想

诉讼:各走极端，有口难言，宜及时求和

求事:先难后易，须有耐心去争取胜利，否则凶改行难如愿

开业:最好另择吉日.然此卦有先难之困，若能舒之则利`,
    `问时运:目前各种事情都不利，宜于谨慎地持守本分，不宜妄动。

问经商:适宜买入，不适宜卖出。隐藏货物，等待高价，以后可以获利。

问征战:不利于进攻，利于退守。

问家业:应当克俭克勤，这样才能免于祸患。

问疾病:是痞隔的病症，应当节制饮食。

问生产:恐怕生男孩而无法养大。

问失物:恐怕不可能再得到。

问婚嫁:有分离之象。

问谋事:不成

初爻

问时运:吉，适宜合伙谋事。

问经商:对新创立的商业来说，用人要慎重。

问征战:应当与左右营联合起来，一并前进。吉。

问家宅:主有亲戚同居，吉。

问疾病:恐怕患传染的病症，但是无害。

问胎孕:生女孩。

问失物:可以复得

二爻

问时运:目前气运顺适，能以包容的态度待人，凡事都吉。

问商业:买卖双方都有利。

问讼事:防有贿赂、伪造等弊端发生，初审或许不利，上诉则吉。

问家宅:家中人口平安，年老的家长或许有病，但是无害。

问征战:必定得胜，但主将或许受到小害。

问失物:必须看包裹里面，一定能得到。

问生产:生女孩，产母有病，但是无妨

三爻

问时运:目前正是好运将来的时候，应当谨慎自守，以避免羞辱。

问商业:防止内部有暗中的损耗，而在外表上加以掩饰，这是用人不当的缘故。

问家宅:恐怕闺中的德行不好，有男女间发生不正当关系的羞耻。又不宜以妾为妻。

问征战:防止被敌军所困。

问疾病:预防寒中包热的病症，恐怕药不对症，应该马上看良医。

问讼事:恐怕辩护律师人选不当。

问失物:防止偷窃者含羞自尽，这样反而导致多事。

问行人:防止行人贪恋女色，一时不能归来

四爻

问时运:目前已经得到盛运，随意谋划的事情，都一定获利。

问商业:得到了大的转机，但必须立定志愿，审察和衡量行情，这样，从前所失去的，现在可以复得，而且有盈余。

问家宅:宅运已经转变，吉。

问征战:命令将帅出征，大吉。

问疾病:命根牢固，无害。

问失物:一定夹杂在用品中，一找就能得到

五爻

问时运:目前逐渐进入好境遇，只因为安泰而不忘危亡，所以凡事都吉。

问商业:恰好遇到绝好的机会，但必须另用伙计，谨慎做事，这样必定能得利益。

问家宅:祖业深厚，吉。

问征战:应该暂时休战。

问疾病:有妨碍。

问讼事:和好。

问失物:防止难以复得。

问行人:不利。

问生产:大人无碍，婴儿难以保全

上爻

问时运:亨通。

问商业:春夏不利，秋冬大吉。

问家宅:迁居大吉，住在老宅不利。

问讼事:当日就可以了结。

问征战:先有小的失败，后有大的胜利。

问胎孕:生男孩。

问失物:马上得到。

问疾病:马上痊愈，但复发的危险值得忧虑`
]
const GUA_EXTRA_13 = [
    `同人:同人于野，亨利涉大川，利君子贞

彖曰:同人，柔得位得中，而应乎乾，曰同人.同人曰，同人于野亨.利涉大川，乾行也.文明以健，中正而应，君子正也.唯君子为能通天下之志

象曰:天与火，同人；君子以类族辨物

初九:同人于门无咎.象曰"出门同人，又谁咎也"

六二:同人于宗，吝.象曰"同人于宗，吝道也"

九三:伏戎于莽，升其高陵，三岁不兴.象曰"伏戎于莽，敌刚也.三岁不兴安行也"

九四:乘其墉，弗克攻，吉.象曰"乘其墉，义弗克也，其吉，则困而反则也"

九五:同人，先号啕而后笑.大师克相遇.象曰"同人之先，以中直也大师相遇，言相克也"

上九:同人于郊，无悔.象曰"同人于郊，志未得也"`,
    `这个卦是异卦（下离上乾）相叠，乾为天，为君；离为火，为臣民百姓，上天下火，火性上升，同于天，上下和同，同舟共济，人际关系和谐天下大同

大象:二人同心，其利断金，君子正心诚意，与人和同之象

运势:如意吉祥，与人共事，上下皆和，又得长辈提拔

事业:顺利，平安，尤其是在与他人的合作方面会十分成功，宜广泛开展人际活动，建立广泛的联系，克服狭隘的门户之见，照顾各方面的利益，求大同，存小异，坚持正确的原则，必能成就大事业.

经商:以真诚合作，精诚团结的态度与同行共事，公平竞争，必可获得自己应得的利益

求名:自己必须刻苦努力，尤其必要取行师长和志同道全的朋友的指教，帮助，自己虚心进取，完全能够达到目的

婚恋:多情，善交际，认识的异性朋友多，故需慎重选择，注意维护双方关系和家庭和睦

决策:性格开朗，乐观，为人热情，人际关系好，社交能力强，要善于同他人合作，尤其要协调多方面的关系，要有原则性，与不良风气斗争，有魄力，敢作敢为，富有自我奉献精神，并具有统御能力，适于担任一定的负责`,
    `同人，表示有志一同，相和而成.主吉象.理念相同共处愉快.事业投资，感情皆是和睦融洽.最适合找人合伙事业或寻求认同自己理念的吉卦

解释:结合志同道合的人集思广益

特性:喜团体生活户外活动，有领导才能.善交际，人际关系佳有幽默感.

运势:得此卦为诸事开通，平安，吉祥，如意之象，有同情心，互爱亨通之象，故宜好好掌握时机，维持盛泰.若有稍涉偏私或为私情之爱则有破兆，应以事业为重

家运:上下和乐，运势亨通，可得意外之财，宜把握良机，努力求取.

疾病:病轻，不久可愈，注意心脏，头肺等疾

胎孕:无碍.与六亲和睦，得缘之吉卦

子女:上下皆能和睦之象

周转顺利，并可进取大业利也

买卖:利益大，与人共事吉

等人:一定会来，且会带来好消息

寻人:此人非故意出走，自己会回来

失物:遗失似文件眼镜等物，可能被压在底层，尽快找寻，则可取回.

外出:很平安，顺利，并可以结交新朋友，获得帮助.

考试:成绩优良

诉讼:凡事以和为贵

求事:吉利

改行:吉利亨通

开业:吉利亨通`,
    `问时运:目前很有升腾之象，并且能得到朋友的扶助，大吉。

问商业:适宜于合资公司等事业，非常有利。

问家宅:有全家和悦之象，吉。

问征战:主军士同心，应该马上调兵进攻，非常有利。

问疾病:是火症，恐怕医药有误，应该另求良医。

问讼事:防有同党私自庇护，一时无法结案。

问胎孕:生女孩。

问失物:细细在同类物中寻觅，才能得到。

问行人:当日可以回家，必定与朋友一同到来

初爻

问时运:目前气运平顺，适宜出门经营，有利。

问家宅:一家人雍雍和睦，无咎。

问商业:有利于行商，不利于坐贾。

问疾病:适宜避到外地调养，没有妨碍。

问讼事:防有受惩罚或服劳役的忧患，应预先出门躲避，可以免于祸患。

问失物:必须在门外寻觅。

问胎孕:马上可以生产，得男孩

二爻

问时运:目前不佳，虽然有人相助，但忌妒的人多，不能事事遂心。

问商业:有利于大宗买卖，只是出纳应该多留意。得利。

问讼事:不利。

问家宅:以勤俭起家，得到长子的帮助。

问疾病:有魂归宗庙之象，凶。

问行人:即将归来。

问胎孕:生女孩。

向失物:被拾到的人隐藏起来，不会归还

三爻

问时运:目前应该潜伏，三年后才可以出来谋事。

问商业:适宜开山林，三年后可以大获利益。

问家宅:防止有盗贼窥伺。

问征战:须防止敌军埋伏。

问讼事:恐怕有意外的麻烦，一时无法了结。

问失物:要在草丛中寻找，或许是山上的草丛。

问行人:等到三年后可以回来

四爻

问时运:目前应该退守而不行动，这样才吉。

问商业:应当垄断货物，等待价格上升而不出售，以后必定获利。

问家宅:应当修葺墙垣，吉。

问征战:应该修筑坚固的营垒，防止敌人的袭击。

问讼事:现在虽然不得理，以后反而能得胜。

问失物:久后可以得到。

问疾病:虽然凶险，但无害

五爻

问时运:目前正是欢乐的时候，从前的苦心孤诣，现在终于如愿以偿了。

问商业:虽然有小的挫折，但最终会获得大利。

问家宅:防有惊惶忧虑，但最终会平和。

问疾病:先危险，后痊愈。

问讼事:只有请最好的辩护律师，才能申冤。

问行人:防止中途有阻碍，缓一时才能回来。

问胎孕:生男孩

上爻

问时运:目前顺适，各种事情没有障碍，但应该待在闲静的地方。

问商业:应该在集市的尘嚣外立业，这样不用忧虑耗损，但一时也无法获得大利。

问征战:应该在荒地屯营。

问失物:在郊外寻觅。

问讼事:恐怕难以申冤。

问家宅:平顺，没有灾祸。

问寿命:本卦为归魂卦，用来占寿命，到上爻的时候必死。可以参看师卦的上爻`
]
const GUA_EXTRA_14 = [
    `大有:元亨.

彖曰:大有，柔得尊位，大中而上下应之，曰大有.其德刚健而文明，应乎天而时行，是以元亨

象曰:火在天上，大有；君子以竭恶扬善，顺天休命

初九:无交害，匪咎，艰则无咎.象曰"大有初九，无交害也"

九二:大车以载，有攸往，无咎.象曰"大车以载，积中不败也"

九三:公用亨于天子，小人弗克.象曰"公用亨于天子，小人害也"

九四:匪其彭，无咎.象曰"匪其彭，无咎；明辨晰也"

六五:厥孚交如，威如；吉.象曰"厥孚交如，信以发志也.威如之吉，易而无备也"

上九:自天佑之，吉无不利.象曰"大有上吉，自天佑也"`,
    `这个卦是异卦（下乾上离）相叠.上卦为离，为火；下卦为乾，为天.火在天上，普照万物，万民归顺，顺天依时，大有所成.

大象:太阳在天，遍照大地万物，但五阳争一阴，须知有盈即缺.

运势:得时得运，昌荣大吉，但防物极必反，盛极而衰

事业:事业已经取得一定的成就，最忌得意忘形，胡作非为.务必止恶扬善，坚守中止，交往正直的朋友，戒惧谨慎，兢兢业业，真正做到大而不盈，满而不溢，事业可望迈上新的台阶.

经商:兴隆昌盛，已摆脱困难状态，进入兴旺发达的阶段，如能克制贪财的心理，确守诚信原则，公平待人，克勤克俭，尤其应时刻注意市场动向，适时转轨，可望长久

求名:已经小有名气，切勿就此满足，停顿不前，尤其不可陷入世俗圈内，应继续努力，在真正朋友的帮助下，更上一层楼.

婚恋:条件优越，可供选择者多，以慎重为好.对于家庭双方应尽力维护

决策:性格坚强，勇于战胜困难，奋斗向上，前进途中困难和厄运很多，唯有认真对待才能不断取得成功，如放松警惕，骄傲自满，将带来惨重失败.朋友很多，交际广泛，对事业很有帮助，但其中也有拆台的小人`,
    `大有，表示有很多的收获，是个吉卦.易经解释大有卦为，春耕夏耘，秋收，冬藏，是个努力坚持之后的愿望期待实现.很利于投资，合伙感情婚姻

解释:旺盛大有收获

特性:具有组织能力，能扩展大事业，吸收各方专才，克服困难有努力完成大目标勇气荣誉心重

运势:得时得运，隆盛昌荣也.然卦象藏有盛极必衰的预兆，不得不慎，以期保持其全盛之枢纽，可众望所归.有走红，赚钱之势须谨慎不可骄纵

家运:生平富贵吉利.切勿因富而凌贫，过于傲气凌人者不利也

疾病:治疗可愈，防高血压，心脏，头肺病患

胎孕:生贵子女，宜往大医院

子女:儿女有成，父母欢欣之象

周转:大有所得

买卖:交易有获大利之象，但亦宜审慎行事

等人:会带来好消息

寻人:此人为感情或金钱之事出走，宜速找寻，否则恐有走极端之险.以东南再南方再西北三向寻之

失物:找寻费时，惟可失而得

外出:平安，可动身

考试:会取得好成绩

诉讼:可圆满解决

求事:顺利可行

改行:可以，依计划进行.

开业:开业吉利`,
    `问时运:目前亨通，如同日在天上，有光明普照之象。

问商业:可以放胆大力去做，有富有和日新之象。

问家宅:祖上虽无官爵封邑，却必定是富比王侯的积善人家。应当劝诫子弟，培植积善的根因，这样家业才能长久地保有。

问征战:主将帅明智，赏罚得当，有千军用命之象。

问行人:必定满载而归，非常有利。

问胎孕:生男孩。

问疾病:不利。

问讼事:主公正明哲地断案结案，否则也一定因为和解而止息

初爻

问时运:目前还没交盛运，需要以刻苦自我勉力，等待好运的到来，那时自然得利。

问商业:想是初创的基业，货物还没有采办。只要谨守现有规模，自然无害而有利。

问征战:一定是初次用兵，还没有交锋。只要慎于开始，自然没有后患。

问家宅:必定是刚刚致富的人家。艰难创业，以后自有福庆。

问讼事:还没有投诉，以和解为好。

问行人:还没有归来的心思。

问胎孕:生男，离产期还远。

问失物:一时难以复得，长久等待才可以得到

二爻

问时运:目前正交好运，一路顺风，做什么都有利。

问商业:贩运货物，互通有无，乃至与国外通商，没有不获利的。

问征战:利于陆地作战。率领军队径直前进，攻取都能告捷。

问家宅:平安而没有灾祸，谋求升迁更吉。

问疾病:适宜出外就医，吉。

问行人:因为在外面谋事有很多利益，一时不能回来。

问讼事:得胜。

问胎孕:生男孩，但过月生女

三爻

问时运:目前正值显荣的时运，有利于为公，不利于营私。

问功名:正值得到宠任和荣赏的时候，只要收受贿赂，就必定失败，应当谨慎。

问商业:不但得到利益，而且得到名誉。

问征战:有犒赏三军之象。打了胜仗，只恐怕对兵众有损害。

问家宅:有喜庆宴会之象，家中食物丰富。但在使用婢仆的时候应当留意。

问讼事:若为饮食而发生争讼，恐怕难以得理。

问胎孕:生男孩，并且主贵，但幼小时须防止多病和多灾四爻

四爻

问时运:在六爻中已经值四爻，是已经到了极盛的气运，应当持盈保泰，知止不辱。

问商业:已经得到利益，不要过分贪求，这样才无害。

问家宅:必须稍微富有就看作完备，达到富有就看作美好，像卫公子荆对居室那样，否则未免因为盈满而受到损害。

问疾病:防有膨胀的病症。

问胎孕:生男孩。

问讼事:遇到明达果决的人才，判断适宜。

问失物:到竹篚中寻找

五爻

问时运:平生为人所信服，并且有威望，是晚运亨通的时会。

问商业:一时众商人信服，货物通行，可以长保富有。

问征战:兵众勇跃，威名远扬。这时尤其要加强戒备，以防敌军。

问家宅:主一家和睦。恐怕有盗窃现象，应该预防。

问失物:盗窃者是平时信任的人，威逼就会交还，但恐怕得而复失。

问胎孕:生男孩。

问讼事:被告一定畏惧威力，并因而和解。

问行人:如期归来

上爻

问时运:目前一路好运，凡事都吉。

问商业:各种货物都能获利。

问家宅:满门福庆。

问征战:这一战获得大捷，就可以结束战争了。

问行人:马上归来。

问疾病:默得神的佑助，吉。

问胎孕:生男孩。

问失物:就高处寻觅，可以得到`
]
const GUA_EXTRA_15 = [
    `谦:亨，君子有终

彖曰:谦，亨，天道下济而光明，地道卑而上行.天道亏盈而益谦，地道变盈而流谦，鬼神害盈而福谦，人道恶盈而好谦.谦尊而光，卑而不可踰，君子之终也

象曰:地中有山，谦；君子以裒多益寡，称物平施

初六:谦谦君子，用涉大川，吉.象曰"谦谦君子，卑以自牧也"

六二:鸣谦，贞吉.象曰"鸣谦贞吉，中心得也"

九三:劳谦君子，有终吉.象曰"劳谦君子，万民服也"

六四:无不利，撝谦.象曰"无不利，摄谦；不违则也"

六五:不富，以其邻，利用侵伐，无不利.象曰"利用侵伐，征不服也"

上六:鸣谦，利用行师，征邑国.象曰"鸣谦，志未得也.可用行师，征邑国也"`,
    `这个卦是异卦（下艮上坤）相叠，艮为山，坤为地.地面有山，地卑（低）而山高，是为内高外低，比喻功高不自居，名高不自誉，位高不自傲这就是谦.

大象:山应在地面上，而今在地下，代表谦逊之德

运势:吉利平安.前途无限，但必须去除骄横之气

事业:尚未被人器重，但因品德高尚，终会为人发现.自己不必有意表现，尤其不可放弃谦虚的美德，埋头苦干，一定会得到他人的帮助，在事业上大有作为

经商:较为顺利，但不会获暴利，须逐步积累，故应极其小心谨慎，诚心与他人合作，遵守商业道德，通过自已的勤劳努力，取得商业的发展

求名:天资聪明，但因性格不善于表现自己，起初往往被埋没，自己只要不灰心，继续努力钻研业务，保持谦逊好学精神，更大的成功正在未来

婚恋:美满的婚姻应由双方共同去努力争取.否则，恋爱不成功，家庭不能和睦

决策:具有内高外低的谦虚美德，善于团结他人，也能得到别人的帮助，事业很顺利，遇到困难，很快可以化险为夷，有惊无险由于能够认真吸取别人的长处，进步很快，会畅通无阻，但需要特别注意学业德业和修养.`,
    `谦，表示谦虚不出风头之意.主吉中带小凶.谦卦显示除了谦虚不与人争之外，还有一个很重要的意义，就是被压抑！在目前到处都充满竞争的时代里，彼此竞争，排斥，是很正常的一种现象，所以，谦卦就是告诉你，虽然一时被压制了，但是忍辱负重，很快就会再意气风发.因此不要气馁，灰心.另外，也显示，事事不可强出头，目前局势下，谦让不意气用事，才可得吉象

解释:要谦虚才可得到助力

特性:待人谦恭，随和，交游广泛，喜休闲活动，重视生活安排及财物的规划，并不断追求新知

运势:吉利平安，欣欣向荣之象，谦者前途大利，骄者横行招败.故以君子谦德，纵涉大川而无险也，卦利君子.正所谓谦受益满招损也.

家运:幸福之吉运

疾病:防旧病发，腹部或背部之疾，但仍属吉象

胎孕:生男儿无灾生女儿亦无灾

子女:子女多温顺，事亲孝，可贺也周转诚实谦恭可成也

买卖:终成，有是非 获薄利，益也

等人:准时到达

寻人:未见，待一段时间自回

失物:难以发现，有失窃的可能

外出:顺利，但应准备充分，途中小心，渐可忽视安全

考试:金榜题名

诉讼:宜速和解，拖延不利

求事:吉利可成

改行:可行

开业:开业者吉利，但诸事勿太急，以谦则受益`,
    `问时运:目前平顺，有一步步逐渐升高之象。

问商业:物价平均，利益顺适，事业可以保持长远问

家宅:想来住宅接近山麓，家道平顺，很有利。

问征战:营屯适宜接近山，必须整理队伍，严明赏罚。到五爻的时候进军，六爻的时候可以攻取城邑，获得大胜。

问讼事:应该平和，不应该纷争

问疾病:是内郁的病症，应当放宽胸怀而调治。

问行人:乘船归来，吉。

问失物:在积土中寻找，可以得到。

问年成:风调雨顺，在不丰不歉之间，平平.

初爻

二爻

问时运:目前名誉很高，一定有很多得意的事情。

问商业:得利。

问家宅:家中财产富足，外面的名声也好。

问征战:可以鸣鼓径直前进，攻取敌人的中营，大捷。

问疾病:是用心过度的病症。

问功名:有必得的喜庆。

问讼事:鸣冤才能申冤。

问失物:马上得到。

问胎孕:生女孩

三爻

问时运:一生劳苦，目前万事亨通，老年的运气更好，

问商业:开始经营时非常勤劳，现在基业成就，可以长久获利了

问家宅:一定是凭辛苦起家，靠积攒致富。只要能持盈保泰，家业就可以长久保有。

问疾病:恐怕疾病使身体衰弱，生命终结。

问失物:以后还可以得到。

问胎孕:生男孩。

问讼事:诬枉的人自己会顺服，马上可以了结。

问功名:有这样功劳，自然必定升迁

四爻

问时运:目前正值好运，凡事吉利。

问商业:听从指挥，没有不获利的；所有买卖，以留些余地为好。

问家宅:全家以谦和的态度做事，事事吉利。

问征战:指挥如意，必定获得大捷。

问疾病:适宜用发散的方法，吉。

问胎孕:生女孩

五爻

问时运:目前虽然处于正运，但或许有龃龉之处，应该自己振作，不可一味姑息。

问商业:所获得的利益，要防止被他人分取，以致发生事端。

问家宅:能选择邻居而居住，自能得到互相守望、互相帮助的好处。

问婚姻:得与邻近的女子谈论婚姻，非常有利。

问疾病:适宜用攻伐的药剂，吉

问讼事:应当请邻人作证，得以申冤。

问失物:从邻居家寻觅，能够得到

上爻

问时运:盛运已经过去，目前不得意。

问商业:有名无实，应该整顿旧业。

问家宅:防止有鬼怪作祟，不时出现响动，需要用法术镇压。

问疾病:应该自己调养心志。

问胎孕:生女孩`
]
const GUA_EXTRA_16 = [
    `豫利建侯行师.

彖曰:豫，刚应而志行，顺以动，豫.豫，顺以动，故天地如之，而况建侯行师乎？天地以顺动，故日月不过，而四时不；圣人以顺动，则刑罚清而民服.豫之时义大矣哉！

象曰:雷出地奋，豫.先王以作乐崇德，殷荐之上帝，以配祖考

初六:鸣豫，凶.象曰"初六鸣豫，志穷凶也"

六二:介于石，不终日，贞吉.象曰"不终日，贞吉；以中正也"

六三:盱豫，悔.迟有悔.象曰"盱豫有悔，位不当也"

九四:由豫，大有得.勿疑.朋盍簪.象曰"由豫，大有得；志大行也"

六五:贞疾，恒不死.象曰"六五贞疾，乘刚也.恒不死，中未亡也"

上六:冥豫，成有渝，无咎.象曰"冥豫在上，何可长也"`,
    `这个卦是异卦（下坤上震）相叠，坤为地，为顺；震为雷，为动.雷依时出，预示大地回春.因顺而动，和乐之源.此卦与谦卦互为综卦交互作用.

大象:雷出于地上，阳气奋发，万物欣欣向荣

运势:如意安泰，可得长辈扶助，但须防色难，凡事应有备而战

事业:十分顺利，事业可以获得成功，但必须符合实际，顺应潮流，且得自己努力奋斗，树立远大目光，尤其不可因事业的顺利而放松谨慎小心的态度，陷于懒散享乐.否则，必将后悔莫及

经商:时运已到，应大胆行动，即使发生挫折，也可以很快化险为夷.应加强同他人的合作，开诚布公，共同开发事业.

求名:天资聪颖，如能坚守正直的品德，严格要求自己，努力上进，不因有成绩骄傲满足，停止前进，而是兢兢业业，不惰不怠，必定可以有重大成功

婚恋:十分顺利，一生顺利和吉祥，但万不可掉以轻心，更不可玩弄感情，否则将会出现悲剧

决策:一生顺利，不会出现大的波折，容易比较顺利得到自己应该得到的.但关键在于自己的努力和奋斗，不得耽于安乐，不可玩物丧志.豁达，大度更有利于健康和长寿.一旦遇到意外的灾害，只要时时严格要求自己，坚守纯正，乐不忘忧，居安思危，必可转危为安`,
    `豫，表示高兴悦乐之意，主小吉象.此卦显示做事积极，有力，性情柔和，圆融，充满令人喜乐之气象.凡事可尽力去做，无大碍婚姻感情，可得良缘

解释:顺应天命

特性:稳重，有组织领导的能力，心地善良乐于助人，做事积极务实有效率精于计划，有金钱观念

运势:此卦象征万物欣畅，如意安泰，可得上辈之助.切不可因繁华而怠惰，或沉醉于声色欢场之中.好运不常有，当好好把握.

家运:吉象.切不可迷于情而招破相

疾病:凶险之卦，注意腹腔，肝胆之疾

胎孕:安康会喜得贵子

子女:儿女均能相亲相爱，前程美好

周转:稍有阻过后顺利

买卖:好时机.秋更吉，有贵人

等人:途中有碍，一定会来.

寻人:东方或西南方可寻，或他人自来相寻

失物:难以寻回

外出:充分准备，从容出发，会十分顺利和平安

考试:金榜题名

诉讼:有始而无终，易被多人连累，破财，受惊

求事:可得上辈提拔，有希望

改行:吉大有可为

开业:开业者大吉大利之象`,
    `问时运:目前如春雷发动，正得时运，凡事都吉。

问商业:正值新货刚到，市价飚升，是绝好的机会，必定得到大的利益。

问家宅:防止有变动，应该拜神祭祖，求神降福和保佑，能够得到安宁。

问疾病:应该祈祷。

问征战:雷厉风行，是必胜的征兆。

问功名:所谓“平地一声雷”，是指日高升之象。

问失物:自然出现。

问胎孕:生男孩

初爻

问时运:初运比较好，但一经得意，假如加以夸饰，就会导致穷困。

问商业:初次一定得利，但不可过于贪求。

问家宅:恐怕鸟啼猿啸，有怪异现象的惊吓，凶。

问疾病:不利。

问讼事:鸣冤而不得申，应当自己中止诉讼。

问失物:得不到

二爻

问时运:这人品行高尚，不随世俗沉浮，吉。

问商业:有自己的志愿，不为奸商所蛊惑，贩运迅速，得以获利。

问家宅:主持家事的人应该态度严正，凡不正派的人来了，就马上斥退，并与他们断绝关系。吉。

问征战:所谓“守之如山，发之如火”，善于审度机宜。

问疾病:新病马上痊愈，旧病马上死亡，时间在一天内。

问胎孕:生女孩，马上生产

三爻

问时运:目前不是气运不好，而是自己的作为不正派，所以有悔恨。

问商业:能窥探商情是商家的本事。但一得到消息，卖买就应当决断，如果迟疑，就会落在别人后面。

问家宅:必须防止盗窃，应当迅速戒备。

问失物:赶快寻找，可以得到，迟了就没有了。

问讼事:应当迅速了结

四爻

问时运:目前正是大运刚刚通达的时候。

问商业:会聚众多货物，很能得到利益。

问家宅:门庭豫乐顺利，得到钱财和福祉，是富有人家。

问功名:马上就有弹冠的喜庆。

问讼事:从现在停止诉讼，两家都豫悦。

问行人:必主满载而归。

问出行:从这里前去，一路顺风，深得喜悦，可以“勿疑”。

问胎孕:生男孩，容易长大成人，并且主贵。

问失物:马上得到

五爻

问时运:这人本来尊贵，因为一向性情柔弱，所以不能自己振作。

问商业:基业很好，但因为用人不当，钱财落入别人手中，几乎导致亏耗。

问家宅:恐怕被借居的人侵占，房主反而无法自主。

问征战:因为偏将擅权，主帅失去威风，虽然没有损失军队，也属于幸免。

问疾病:是带病托延年月之象。

问胎孕:生男孩，一定有病。

问失物:可以得到

上爻

问时运:目前坏运已经到了极致，好运即将到来，只要奋然振作，就大有可为。

问商业:应该改变计划，去掉旧的，改就新的，这样一定得到利益。

问家宅:老宅不利，迁居或改造都吉。

问征战:应该另派主帅，改变旗帜，变易辙迹，这样才能得胜。或者从别的路进兵。

问讼事:应该停止诉讼，彼此和好，无咎。

问胎孕:过月可以生产，得女`
]
const GUA_EXTRA_17 = [
    `随:元亨利贞无咎.

彖曰:随，刚来而下柔，动而说，随.大亨贞，无咎，而天下随时，随之时义大矣哉！

象曰:泽中有雷，随；君子以向晦入宴息

初九:官有渝，贞吉.出门交有功.象曰"官有渝，从正吉也.出门交有功不失也"

六二:系小子，失丈夫.象曰"系小子，弗兼与也"

六三:系丈夫，失小子.随有求得，利居贞.象曰"系丈夫，志舍下也"

九四:随有获，贞.有孚在道，以明，何咎.象曰"随有获，其义凶也.有孚在道，明功也"

九五:孚于嘉，吉.象曰"孚于嘉，吉；位正中也"

上六:拘系之，乃从维之.王用亨于西山.象曰"拘系之，上穷也"`,
    `这个卦是异卦（下震上兑）相叠，震为雷，为动；兑为悦，动而悦就是“随”.随指相互顺从，已有随物，物能随己，彼此沟通.随必依时顺势，有原则和条件，以坚贞为前提

大象:震木在兑泽之下，木必随水漂荡，随者，顺也

运势:有去旧迎新之吉象，宜与人合作，可获厚利，忌三心两意，或独断独行

事业:对社会和人生有正确的估价，重视人际关系，善于同他人合作，事业会很顺利.为了保证取得更进一步的成功，不得贪图小利，向比自己优秀的人学习，择善而从，心存诚信，努力开拓事业.

经商:顺利.在与他人的真诚合作下，能够达到预期的目的.在竞争中应保持清醒头脑，从大处，长远考虑，遵守商业道德，保持至诚的态度对待顾客和同行，会保持竞争优势

求名:在自己刻苦钻研的基础上，虚心向有德有才的师长学习借助外界的力量，促使自己更快的进步，实现个人的理想

婚恋:双方情投意合可以成功，家庭和睦，但若迷恋于情爱，会影响双方的事业务必注意

决策:个人成长道路并不十分顺利，但由于谦虚，随和，人际关系好，尤其能够得到长辈的器重，各种事都能在他人的帮助和关心下成功.但务必注意追随他人应有的立场和原则，不可趋炎附势，招致祸凶`,
    `随，表示随遇而安，一切随缘，随和.主吉象.事事均可依随着自己的心思计划来执行，会顺利地达成.事业，投资，理财，感情，均会有令人满意的发展和收获

解释:跟随上司主意行事

特性:交际佳，贵人运多，善谋略，为辅佐良才，保守，被动

运势:物事均有去旧迎新之吉象，凡事与他人互相通达，协商，可名利双收.倘若三心二意，或独立单行，不听人言劝，有自招灾祸之虞

家运:本身有相当不错的收入，富有之象.但不可过于放纵，守操节为宜

疾病:病重，须长期治疗，注意口腔，肝，足患等症

胎孕:无碍无惊险

子女:亲情融洽，与六亲和睦，幸福之象

周转:和气相商有利，意气用事则难成

买卖:勿顽强固执，则交易有利.否则失之，有阻.

等人:会迟到

寻人:不必去找了，过些时日会自己回来，勿急

失物:即将疏忽之时，会突然察觉

外出:吉利可以改变处境

考试:成绩理想

诉讼:宜决意和解，目前无忧，但不久须防有祸

求事:虽吉，然若能谦逊待人，多接受别人意见，会得人提拔

改行:有充份计划者可行

开业:吉利`,
    `问时运:目前气运平常，适宜暂时晦藏；明年利于远行；到第五年可以得利。

问征战:应当退守。明年应当有小功。必须等六年，那时敌人就都就缚了。

问商业:货物一时难以售出，来年春天可以获利。

问家宅:防有伏藏的怪异，导致夜间多惊惧。

问讼事:恐怕有牢狱的灾难；明年还要防止因为征役而远行。凶。

问失物:应该在枕席间寻觅。

问胎孕:生女孩。

问行人:马上归来。

问出行:明年有利

初爻

问时运:目前正值换运的时候，交入新运后，一动就很恰当，尤其有利于出门。

问商业:货物应当贩运到外地，这样才有利益。

问家宅:应当修造，吉；或者迁居出外，更有利。

问征战:袭击东部的改为袭击西部，进攻南部的改为进攻北部，吉。

问疾病:恐怕药不对症，改变药饵才吉；或者到远方求医，这样更有利。

问失物:到门外寻找，得到。

问胎孕:生男孩

二爻

问时运:目前气运颠倒，应当自己审慎。

问商业:有贪小失大的忧虑。

问家宅:阴阳倒置，有女子或小人弄权，反而使家主受制之象。

问征战:只能捕捉敌兵，不能获得斩将拔旗的大捷。

问胎孕:生女孩。

问失物:小物可以得到，大件必定失去。

问婚嫁:恐怕不是良缘

三爻

问时运:目前交了正运，求财或求名，没有不如意的。

问商业:小往大来，一定能得到利益。

问征战:主生擒敌人的将领，必定得到大捷。

问家宅:家道丰盈，但要防止小儿辈有灾。

问疾病:大人无妨，小儿恐怕有所不利。

问胎孕:恐怕出生后无法养育。

问失物:得到。

问婚嫁:主缔结高贵的亲缘

四爻

问时运:目前有凶有吉。利于单月，不利于双月。明年则吉。

问商业:获利以后，防止有意外的灾祸，必须等到辨明才行。

问家宅:或新买或新造，都不吉。

问征战:小的胜利之后，要防止大的失败。

问疾病:先凶后吉。

问讼事:初审凶险，上诉无咎。

问失物:一时难找，等以后才能见到

五爻

问时运:目前处于盛运，凡事都吉。

问商业:因为货物美好而获利百倍。

问家宅:一定是积善人家，众人都信任和听从，为一乡所瞩望。

问征战:兵众同心，必定获得胜利，吉。

问婚嫁:百年好合，大吉。

问讼事:和好。

问疾病:吉。

问胎孕:生男孩

上爻

问时运:目前左支右绌，不太如意。

问商业:坚固、结实、稳当，可以做，但不能事事如意。

问家宅:恐怕防范和约束过严，以致家人有怨言。

问疾病:祷告就吉。

问婚嫁:有以赤绳系手臂的因缘。

问讼事:恐怕有披枷戴锁的祸患。

问失物:是自己包裹收藏起来了，不曾失去。

问胎孕:生女孩`
]
const GUA_EXTRA_18 = [
    `蛊:元亨，利涉大川.先甲三日，后甲三日

彖曰:蛊，刚上而柔下，巽而止，蛊.蛊，元亨，而天下治也.利涉大川，往有事也.先甲三日，后甲三日，终则有始，天行也

象曰:山下有风，蛊；君子以振民育德

初六:干父之蛊，有子，考无咎，厉终吉.象曰"干父之蛊，意承考也"

九二:干母之蛊，不可贞.象曰"干母之蛊，得中道也"

九三:干父小有晦，无大咎.象曰"干父之蛊，终无咎也"

六四:裕父之蛊，往见吝.象曰"裕父之蛊，往未得也"

六五:干父之蛊，用誉.象曰"干父之蛊；承以德也"

上九:不事王侯，高尚其事.象曰"不事王侯，志可则也"`,
    `这个卦是异卦（下巽上艮）相叠，与随卦互为综卦.蛊本意为事。引申为多事，混乱.器皿久不用而生虫称“蛊”，喻天下久安而因循，腐败，必须革新创造，治理整顿，挽救危机，重振事业

大象:风入山下，闭而不出，即物腐生虫，意气不通，因循败事

运势:诸事不如意，艰难迷惑，宜大胆革新，否则引来内忧外患

事业:运气处于不佳状态，或因外界条件，或因个人因素所致唯有谨慎分析原因，找出弊端，坚决，大胆，不惜冒险，战胜阻力这时一要头脑冷静，二要向高明的人请教，必能创造业绩

经商:诸多不利困扰着自己，不宜继续走老路.应全面分析市场动向，当机立断，另外找寻出路

求名:会遇到许多困难和不利，应看作是对自己的考验，要以百倍的勇气，继续奋斗.同时，虚心寻找自己的不足，加以补救.

婚恋:不顺利.双方如情投意合，则应全力以赴促成此事，夫妇应共同努力维系家庭

决策:生不逢时，家道或事业有中落现象，个人陷入多事之秋.唯有正视现实，勤奋勉励，不屈不挠，有所作为，甚至不惜冒险，挽救败落状况.必要时还需耐心等待时机.`,
    `蛊，表示受到蛊惑，毒害.主大凶象.蛊毒是因内在腐朽而生虫化毒，显示问题的根因存在已久，却未诚实面对处理而导致愈来愈严重.易做出错误的决策，慨大都被人所迷惑，而一时心神错乱引致祸事

解释:中蛊毒无可救药

特性:内心犹豫，猜疑心重，多事之秋，宜大胆革新

运势:诸事不如意，积弊已深，未能进展，气运杂乱.逢此宜鼓起勇气，大胆加以革新，有内忧外患之象

家运:家庭易生烦心之事，不彻底改革有破家，损财之象.

疾病:宜把握治疗时机，冬季占得险象，为内脏恶性疾病

胎孕:胎有惊

子女:双亲不堪其忧之苦象耳

周转:信用不好周转无望

买卖:交易不成，另谋生计为要

等人:中途有变不会来.

寻人:因家庭感情失和而出走，或与人私奔，于东南或东北

失物:找不回来，遗失似是木制工艺品，在门口或旅馆遗失，或者是寄失了

外出:宜推迟或提前.否则会出现危险，务必小心谨慎.

考试:落榜

诉讼:慎防桃色纠纷，会拖一段时间，不易解决.

求事:不利

改行:弃旧迎新，或革新内部人事

开业:开业者不宜，有损财或官符之灾`,
    `问时运:目前好运刚来，必须努力振作，这样才能改变旧面貌。

问商业:防止货物因堆积而败坏，应该赶快贩运或出售

问征战:屯营应该在空旷的地方，不应该接近山。防止有风声鹤唳之类惊恐。

问家宅:必须整肃门庭，警惕关于诲淫和蛊惑的禁戒。

问疾病:防止巫蛊咒诅，或者腹中患蛊毒的病症

问讼事:想是听人蛊惑所致，应该赶快停止诉讼。

问婚嫁:恐怕有男女私情。

问失物:失物已经败坏。

问出行:防止因为风而受到阻碍。

问胎孕:防止有异样的胎孕

初爻

问时运:刚交好运，应当克勤克俭，以光大前人的事业。吉。

问商业:旧业重新振兴，必定多获利益

问家宅:想是祖先的旧宅，应当改造一新，这样非常有利。

问征战:如同勾践灭掉吴国，伍子胥征伐楚国，一定可以重新振兴。吉。

问讼事:以前不能申冤，还应该上诉，没有灾祸

问疾病:虽然危险，但是无妨。如果是没有儿子的人，得到这一卦不利

问婚嫁:好儿子好媳妇，吉。

问胎孕:生男孩，一定能振兴家业，吉

二爻

问时运:目前以将就调剂为贵，不可草率

问商业:防止有旧债和积弊等事，应当以宽缓的方式调节和处置。

问家宅:恐怕母亲一党专擅权力，挑起事端，应该忍耐而善于处置。

问征战:防止有暗中的危险，不可径直前进

问疾病:在壮年，防止是疟母痞块等病；在小儿，或许是胎气不足的缘故。应当服柔和的药剂。

问行人:在半路上，后日可以归来。

问失物:能得到。

问婚姻:应当得到好媳妇

三爻

问时运:目前应该痛改前非，纵使小有挫折，最终也有所成就。

问商业:应该重兴旧业，改立章程，或许会有小的损失，但必定得到大的利益。

问家宅:恐怕栋宇年岁已久，多半会生蛀虫或腐朽，不要吝惜小的费用，应该迅速改造。

问征战:凭刚武径直前进，不免有小的失败，但一定没有大害。

问失物:得是必得的，但要防止小小的口舌之灾

问胎孕:生男孩，但生下小孩未免有小的疾厄。

问疾病:无妨

四爻

问时运:气运平常，但由于一味因循，最终导致自我贻误。

问商业:只知道持守常道，不知道革除弊端，长此下去，难以得利。

问征战:威仪不足，命令不严，不可前去，前去必定失败。

问家宅:父亲的产业虽然充裕，但是弊病已经深入，难保它的未来。

问疾病:外形还好，但内部病患已经深入，如果不赶快治疗，以后就无法救治了。

问胎孕:生女孩

五爻

问时运:虽然家运衰败，财产微薄，但只要能自我振作，就足以立身扬名。

问商业:旧业虽然不很理想，但是经过一番改革，一定会得到名利。

问家宅:祖上的遗产不丰厚，幸而能扩充前人的事业，一定能光大门楣。

问征战:能夺回城池，使军威远扬，吉。

问疾病:应当请名医治疗。

问胎孕:生男孩。

问嫁娶:一定是名门贵族

上爻

问时运:应当以退为进。

问商业:目前货价必将逐渐升高，不必急于出售。能得利益。

问家宅:应该依傍高阜一类地方，吉。

问疾病:属于归魂卦，恐怕寿命有阻碍

问婚嫁:一定女子贞正，男子才高，属于天缘巧合。

问征战:想来已经到了战胜凯旋的时候。

问出行:适宜做行商，不适宜求名`
]
const GUA_EXTRA_19 = [
    `临:元，亨，利，贞.至于八月有凶

彖曰:临，刚浸而长.说而顺，刚中而应，大亨以正，天之道也.至于八月有凶消不久也

象曰:泽上有地，临；君子以教思无穷，容保民无疆

初九:咸临，贞吉.象曰"咸临贞吉，志行正也"

九二:咸临，吉无不利.象曰"咸临，吉无不利；未顺命也"

六三:甘临，无攸利.既忧之，无咎.象曰"甘临，位不当也.既忧之，咎不长也"

六四:至临，无咎.象曰"至临无咎，位当也"

六五:知临，大君之宜，吉.象曰"大君之宜，行中之谓也"

上六:敦临，吉无咎.象曰"敦临之吉，志在内也"`,
    `这个卦是异卦（下兑上坤）相叠.坤为地，兑为泽，地高于泽，泽容于地.喻君主亲临天下，治国安邦，上下融洽

大象:池泽之水灌溉地面万物，相辅相成，生生不息

运势:诸事亨通，上下和合，前途有望，但不宜过于急进

事业:正是成功的极好时机，务必抓紧，不可失去良机.但却不可就此满足，时运会很快消失，一定要从长计议，注意总结经验，团结他人，共同开拓新领域

经商:会十分顺利，并有收获，但须随时注意市场动向，兢兢业业，防止出现意外的事故，尤其应妥善处理人际关系

求名:自己的努力已到了收获的季节，应更加虚心，严格要求自己，谨慎小心地实现自己的目标.很可能出现意外，应以刚强的意志去从容对付，过于软弱将失去机会

婚恋:加紧进行，全力以赴，双方以诚信相待，美满，和谐

决策:头脑灵活，善于同他人交往，并有主见，具有领导才能.务必加强个人的全面修养，诚信待人，树立良好的个人威望，尤其要有远大的眼光，长久的计划，可以保证事业的发达和前程的光明.`,
    `临，表示大驾光临，贵人来到之意.主吉象.临又为君王临幸之意，是上者对下者之象，在事业投资，为责人相助之意.在感情则有期待而至的欢喜感.

解释好事即将来临.

特性:待人热心，心胸开阔，乐于助人，尊重他人，体会别人心意，谦恭有礼.自然贵人多来帮助，财运丰厚.

运势:运势渐增，诸事亨通如意，前途有望，仕途有成，可得贵人相助，上下安合.以和顺可奏大功，宜诚心待人，可诸事顺畅，急进或忘形者有破财之象.

家运:幸福圆满，切勿意气用事，否则有反.

疾病:病情较轻，为肠胃，口腔之疾，并防泌尿生殖系统病变.

胎孕:生贵子.求佛及家神则安.产妇慎饮食.

子女得孝顺之儿女.

周转:可成

买卖:防口舌，勿过急，和顺交易有利.

等人:有好消息且准时到，

寻人:西方或西南方，不必急，目下其人已动，自回.

失物:不能立即发现，很久才能找回.可能被埋在地下.是件会发声或震动的物件.

外出:在准备充分的情况下，立即行动，不必再犹豫.

考试:金榜题名.

诉讼:宜柔不宜刚，因本欲欺他人，反伤自己.

求事:顺利可成

改行:吉利

开业:开业正得其时，大吉大利.`,
    `问时运:目前作事，恰如一潭活水，流行自在，好运正长。

问商业:泽是货物，地是贩运的地方，得到这一卦，获利不但丰厚，而且特别绵长。大吉。

问家宅:住宅必定在接近水泽的地方，家业正兴旺，人财两方面都昌盛，大吉。

问征战:阵地适宜在临水处，不但一时能够得胜，而且有万民归附之象。

问疾病:性命可以保住，但疾病必定绵延很久，一时难以痊愈。

问讼事:恐怕许久不能了结。

问婚嫁:两姓和合，五世子孙都昌盛，大吉。

问胎孕:生女孩。

问行人:一时不会归来。

问失物:在河岸处寻觅，保证可以得到

初爻

问时运:目前刚交新运，能守自己的正道而行，就没有不利。

问商业:值新货上市的时候，市价平稳正常，尽可以贩运，没有不如愿的。

问家宅:一定是忠厚、中庸、正派的人家，现在正有吉事临门，非常有利。

问征战:初次临阵，应该从大路进军。吉。

问疾病:病是刚得的，正气充足，可以保证马上痊愈。

问婚嫁:门户相当，品行端正，是一对好配偶。

问讼事:一经审判就可以了结。

问胎孕:生男孩，临盆时有喜事

二爻

问时运:目前时运正好，又得到贵人的照应，大吉。

问商业:初次已经获吉，第二次更为有利。

问家宅:有福星照临之象，前后都吉。

问征战:再接再厉，行动都吉。但必须防止偏裨将领中有不服从命令的，以致坏事。

问婚嫁:都有利，而属羊的最理想。

问讼事:不至于失败，但一时得不到顺从。

问胎孕:生男孩，但还没有生产。

问行人:行人的归期还没有决定

三爻

问时运:运势既不好，行为也不正，幸而能知道改悔，以后有希望。

问商业:店址不得当，只有贩运糖业有利。

问家宅:屋运不好，以迁徙为吉。

问征战:屯营的位置不当，迁营才吉。

问疾病:药不对症，应该服苦辛的药剂。无害。

问婚姻:不合。

问行人:在外面不得利，近期可以归来。

问失物:可以得到。

问胎孕:生女孩，恐怕难以长大

四爻

问时运:好运已到，凡事无不得当，有吉无凶。

问商业:目前贩运正是时机，贩运什么都有利。

问家宅:住宅位置得当，家业兴隆，无害。

问征战:时运已到，正可以临阵杀敌，夺取胜利。

问疾病:虽然到了危险严重的地步，但还可以无咎。

问婚姻:彼此欢乐融洽，门户也相当。

问行人:马上就到。

问失物:马上得到

五爻

问时运:目前正得气运，又得到好人的相助，应该事事成功。吉。

问商业:知道以往，了解未来，通晓商情，自然得以获利。吉。

问家宅:有五福临门的征兆，吉。

问征战:能得军心，就知己知彼，战无不胜了。

问疾病:应当得到良医，详细考察病因，治疗后自然痊愈。

问婚姻:宜于婚娶也宜于出嫁，大吉。

问失物:有人拾到，久后自然知晓。

问胎孕:生男孩，并且主贵。

问行人:还在半路上，后日可以到家

上爻

问时运:目前好运已经结束，只因存心忠厚，才得以无咎。

问商业:贩卖到内地，吉。

问家宅:世代都忠厚，内外都肃穆，吉。

问征战:应该增兵加饷，以保护内地，这很要紧。

问疾病:培养元气，不用药就会痊愈。

问胎孕:生女孩。

问失物:就在家里，不曾丢失。

问行人:当日可以归来`
]
const GUA_EXTRA_20 = [
    `观:盥而不荐有孚颙若.

彖曰:大观在上，顺而巽，中正以观天下.观，盥而不荐，有孚颙若下观而化也.观天之神道，而四时不忒，圣人以神道设教，而天下服矣.

象曰:风行地上，观；先王以省方，观民设教

初六:童观，小人无咎，君子吝.象曰"初六童观，小人道也"

六二:窥观，利女贞.象曰"窥观女贞，亦可丑也"

六三:观我生，进退.象曰"观我生，进退；未失道也"

六四:观国之光，利用宾于王.象曰"观国之光，尚宾也"

九五:观我生，君子无咎.象曰"观我生，观民也"

上九:观其生，君子无咎.象曰"观其生，志未平也"`,
    `这个卦是异卦（下坤上巽）相叠，风行地上，喻德教遍施.观卦与临卦互为综卦，交相使用.在上者以道义观天下；在下者以敬仰瞻上人心顺服归从

大象:风运行于坤地之上，喻有周游观览之意.阴长阳消，正道衰微，万物难行

运势:处身于变化之中，宜多观察入微，心身苦恼，并防外来诱惑.

事业:事业已出现不顺利的迹象，务必谦虚慎重，高瞻远瞩，尤忌短期行为，心胸开阔，注意搞好人际关系，团结他人，不宜轻率行动.必要时不妨投靠德行高的人，以图再度发展

经商:市场形势不稳定，正处于变动，应谨慎小心，随时观察动向，从长计议，做好退却的准备.

求名:贵在自知之明，虚心向他人求教，端正处世态度，尤其不可自我满足，更须守中持正，树立远大理想，勿丧失个人追求的目标勿偏离正道

婚恋:不顺利，双方应经受住考验，从长计议，会有理想的结果.

决策:具有组织能力，适宜担任负责工作，但人生旅途多曲折，必须注意培养自己的预见性和观察力，办事务必公正，实事求是，注意人心动向，关心他人.尤其不可以陷入小人之道和近视行为之中.应有决断精神，不可盲从，必要时可进行策略依附`,
    `观，表示观察，观看，是个最标准的状况卦，吉凶未定.凡事不可轻下决定，需要再观察一下局势再做打算.尤其是对长官，上位者的态度更是要察言观色，不可轻忽大意

解释:尚在观察中

特性:有创意，喜欢开发新事物，见解新颖，爱旅行，观摩他人，研究比较，不断修正反省自己

运势:处在有危险不稳的时运，要多观望时势之利弊，待机行事，于人事物，须以诚待之，才能感化而幸免陷入困难也

家运:正处于下坡时段，要知固守进退之机，听取长辈意见有助也.

疾病:有渐恶化之象，病情变化多，为腹，神经系统病症胎孕孕有不安之象

子女:儿女将来有成就幸福耳

周转:虽有好言，实际内在空虚.无指望居多

买卖:交易有碍.应在戌亥日可成，否则难成

等人:观望必有等待，而来者有随他人去之象

寻人:此人到处漂泊，行踪不定，有险象.目前在西南方，宜丑未日见

失物:若能细心四察，可以找回来

外出:有风险择日而行

考试:不理想

诉讼:小人当道，愈争论惹起纷争愈多，但终会和解

求事:不易

改行:擅自主张不宜，若由他人提拔则可

开业:开业者不宜`,
    `问时运:目前正值应该振作有为的时候，应该出外游历，不应该关门静守。

问商业:贩运洋货，必须防止风险。

问家宅:宅中或许有原来供奉的神佛像，或者是皈依了教门的人家，或者是家主人设置学馆，教授生徒。

问征战:有风雷疾卷的形势，可以掠得土地，获得民众吉。

问疾病:是风湿症，应该适当活动，血脉调和了，风湿自然痊愈。

问出行:远游吉，传教更好。

问讼事:得以公平地断案结案。

问胎孕:生男孩。

问天时:有风就会晴。

问失物:初爻在地上，被风吹远了，应该到处寻找，可以得到

初爻

问时运:初运不好，幸而没有大的妨碍

问商业:初立的场面，只适宜小的规模，无害。

问家宅:防止有仆人偷窃的忧患。

问征战:防止小胜之后有大的失败。

问疾病:对儿童无碍，对大人不利。

问行人:适宜就近，无害。

问胎孕:生女孩。

问婚嫁:自幼结亲，吉。

问失物:防止被小儿抛弃

二爻

问时运:目前运势不好，只可以株守；但妇女占问，却非常有利。

问商业:蚕丝业很有利，其余不理想。

问家宅:必定是妇女主持家政，有利。

问疾病:是阴寒的病症，无害。

问出行:必须带领眷属一同前往；

问行人，必定带着眷属一同归来。

问胎孕:生女孩

问失物:恐怕在门的缝隙中，窥探可以得到

三爻

问时运:目前运势平平，能揆度德行、衡量能力而不妄动，即使无所得也不会有所失。

问商业:谨慎地把握，随买随卖，按照行情确定价格，决没有损失。

问家宅:应该居住旧宅，不应该迁移。

问征战:应该审察军情，随机应变，这样决不至于失败。

问行人:归来的心思犹豫未决。

问胎孕:生女孩。

问疾病:应该静心自己休养，可以保证没有忧患。

问失物:马上得到

四爻

问时运:目前正值盛运，求利当然可以，而求名尤其理想。

问商业:适宜贩运出国，不但可以获利，而且可以得以名誉。

问家宅:主有喜事临门，为闾里增光

问征战:一定获得大捷，凭功绩邀得赏赐，姓名写进史书。

问疾病:不利。

问行人:不归。

问胎孕:生男孩，并且主贵

问讼事:得以申冤

五爻

问时运:目前正值好运，正直行事，无往不利。

问商业:应当自己拿主意，或买卖或贩运，没有不利。

问家宅:住宅是自己建造的，君子居住很有利。

问征战:应当审察自己的营垒，所谓“知己乃能知彼”。可以获得大胜。

问疾病:有命在天，无害。

问行人:马上返回。

问失物:仍在身边，没有失去。

问胎孕:生尊贵的儿子

上爻

问时运:盛运已经过去，能反躬自省，也不会有过失。

问商业:这种货物已经即将卖光，由我决定价格，自然获利。

问家宅:属于老宅基，在这里生息繁衍，有利无害。

问征战:军事行动即将终结，马上可以凯旋。

问疾病:性命不久了。

问讼事:马上了结。

问胎孕:生男孩`
]
const GUA_EXTRA_21 = [
    `噬嗑:亨利用狱

彖曰:颐中有物，曰噬嗑，噬嗑而亨.刚柔分，动而明，雷电合而章柔得中而上行，虽不当位，利用狱也

象曰:雷电噬嗑；先王以明罚敕法

初九:履校灭趾，无咎.象曰"履校灭趾，不行也"

六二:噬肤灭鼻，无咎.象曰"噬肤灭鼻，乘刚也"

六三:噬腊肉，遇毒；小吝，无咎.象曰"遇毒，位不当也"

九四:噬乾肺，得金矢，利艰贞，吉.象曰"利艰贞吉，未光也"

六五:噬乾肉，得黄金，贞厉，无咎.象曰"贞厉无咎，得当也"

上九:何校灭耳，凶.象曰"何校灭耳，聪不明也"`,
    `这个卦是异卦（下震上离）相叠.离为阴卦；震为阳卦.阴阳相交咬碎硬物，喻恩威并施，宽严结合，刚柔相济.噬嗑为上下颚咬合，咀嚼.

大象:上唇与下唇间有物，必须咬断，方能合拢，乃诸事被阻，务必去除，方可成功

运势:诸事阻隔，纷争难免，宜守常规，不为利诱，问题可解决.

事业:困难与阻力非常大，应以坚强的意志，果敢的行为，公正无私的态度去战胜种种厄运，争取事态好转.为了早日化险为夷，必要时可采取强硬手段，甚至诉诸法律

经商:处于不利的时候，头脑冷静，明察形势，寻求机遇，不为眼前小利所诱，不发非分之财.认真听取忠告，遵守法纪，秉公办事，不得徇私情，更警惕不得触犯刑律

求名:自己的努力尚不为人所知，不可急于求成，受到挫折应看作是对自己的考验，持之以恒，必能成功

婚恋:初不顺利，须有顽强精神可以取得满意的结果，不可以个人的情绪左右家庭事务

决策:一生不平坦，会遇到挫折和磨难，但应看作是对个人的考验，应认真总结经验教训，以更为坚强的意志，不屈不挠，继续前进.经过锻炼，各方面都会有较大的进展，终将进入光明境地，取得重大成就`,
    `噬嗑，表示如鲠在喉，难以决策.主吉凶未定，是个状况卦，有点偏小凶.也如同鸡肋一般，食之无味，弃之又可惜！是需要坚决下个决心的时候了

解释被吞没掉

特性:生命力强，坚守奋斗，百折不挠，对自己要求很高，不断充实自己，突破超越提升.克服困难，宜往大企业大单位任职，较能有所表现

运势:诸事不遂心，多受阻害.有纷争，无法前进之时，宜守原则不为利诱，以免被人中伤.然而一般人多有无法逃避利诱者，故必受祸，若能和气处事为安，更须突破困难方可通达

家运:家庭有不和现象，亦常有无法沟通之阻碍.除非彼此能够排除成见否则无法融洽相处

疾病:病情严重，注意足部，心脏，神经系统病变

胎孕:胎有惊

子女:儿女倔强反抗

周转:卦已明示有困难，但诚心或可圆满

买卖:多阻挠且多是非.但若积极推进，不要放弃.则有利，可成

等人:受到阻碍不能来

寻人:必因发生争端或涉嫌重大事件而出走.去庙观市井求之东，南方

失物:有被人捷足捡走的可能，寻回的机会不大

外出:另择他日为佳.若非出门不可，务必充分准备，小心为是

考试:不佳

诉讼:宜采取主动，据理力争.

求事:多生枝节，不利.唯有积极去谋求方有所成就

改行:有碍，但耐心排除可成

开业:开业吉，中途有是非，宜耐心解决`,
    `问时运:目前正值好运发动，有威仪，有光耀，有声名远播、上进发达之象。吉

问商业:买者和卖者同时汇集，有货物畅销之象。吉。

问家宅:天盘地盘都在动，要防止有火灾，必须小心谨慎这样才能免于灾祸。

问疾病:是郁热的病症，适宜透发。可能会因为热极而作狂态，必须慎重。

问讼事:判决明了而公允。

问天时:有雷雨骤然下降之象，雨后就会睛。

问婚嫁:阴阳本是一气，一定是百年好合，吉。

问行人:马上回来。

问失物:恐怕被人吞没

初爻

问时运:防止目前有小灾，幸而无大害，应当慎重。

问商业:木材交易最不利，其他商业也应该谨慎。

问家宅:有动工改造的意思，没有灾祸

问疾病:或许足部患有疮疡，或者患脚气。病症属于初发医治自然容易。

问征战:防止有埋伏，应该审慎。

问婚嫁:不利。

问行人:没有归来

问胎孕:生男孩。恐怕小儿有脚部的疾患

二爻

问时运:目前平平，因为才能肤浅，应该借助于别人的力量做事。

问商业:现在货物有辐辏集合之象，不妨深藏而等待价格提升，到时候乘机出售。吉。

问征战:肤是大的意思，鼻为开始。从现在开始可以成大功，吉。

问家宅:鼻为祖，“灭鼻”就是灭祖，居住老宅不利。

问疾病:现在邪气在肌肤，恐怕深入为害。

问行人:与伙伴一同归来。

问婚嫁:一定是兴旺的人家，可以成功

三爻

问时运:目前气运不正，得意的事中常常多有失意的成分或者以诚待人而反被怨尤，幸而无大害

问商业:明明可以获利的事情，或许反有小的损失，多半是由于处置不当

问征战:屯营的位置不合适，防止有小的失败，应该谨慎守

问家宅:宅神不安，恐怕有小的灾患，应该祈祷。

问疾病:药不对症，幸而是小病，无碍。

问行人:因为有事，没有回来。

问胎孕:生女孩

四爻

问时运:目前正值盛运，改变旧的，采取新的，凡事都吉

问商业:譬如吃肉而得到金，有利润超过于资本之象，大吉。

问家宅:家业素来丰厚，在安全的时候不忘危险，在平常的时候不忘变迁，是保家的重要方法。吉。

问征战:能获得敌人的粮饷，获得敌人的弓矢，无坚不摧所向有利。但得胜利时要更谨慎才好。

问婚嫁:因为是勤俭人家，吉。

问疾病:这病不容易治疗，必须谨慎调养。吉。

问胎孕:生男孩

问行人:在外面得利，还没有归来

五爻

问时运:正得时运，所谋求的事情没有不如意的，吉。

问商业:所贩运的货物都是上等，干净而完美，很得利益；不但一时是这样，而且事业可以保持长久。吉。

问家宅:方位得当，非常有利。

问征战:主敌人的城堡柔弱，容易攻取。吉。

问疾病:肉食应当禁忌，但时间久了也有危险，必须谨慎调养。

问行人:正是获利归来的时候。

问胎孕:生男孩。

问失物:马上得到

上爻

问时运:目前大运已经终结，能柔和处世，可以保证没有忧患；倘若任性用刚，就难免凶险了

问商业:得利就停止，不可过贪，这样才没有大的损失。

问家宅:防止有意外的凶灾

问征战:千万不要前进，前进必有凶险。

问疾病:或者耳鸣耳聋，或者颈上生毒疮，凶。

问胎孕:生男孩，防有耳聋的疾病`
]
const GUA_EXTRA_22 = [
    `贲亨小利有所往.

彖曰:贲，亨；柔来而文刚，故亨.分刚上而文柔，故小利有攸往.天文也；文明以止，人文也.观乎天文，以察时变；观乎人文，以化成天下.

象曰:山下有火，贲；君子以明庶政，无敢折狱.

初九:贲其趾，舍车而徒.象曰"舍车而徒，义弗乘也"

六二:贲其须.象曰"贲其须，与上兴也"

九三:贲如濡如，永贞吉.象曰"永贞之吉，终莫之陵也"

六四:贲如皤如，白马翰如，匪寇婚媾.象曰"六四，当位疑也.匪寇婚媾终无尤也"

六五:贲于丘园，束帛戋戋，吝，终吉.象曰"六五之吉，有喜也"

上九:白贲，无咎.象曰"白贲无咎，上得志也"`,
    `这个卦是异卦（下离上艮）相叠.离为火为明；艮为山为止.文明而有节制.贲卦论述文与质的关系，以质为主，以文调节.贲，文饰修饰.

大象:日落西山，照耀通明，华美灿烂，同时喻光明力量渐消，阴暗的力量扩大

运势:表面风光内里空虚，必须充实自己，凡事踏实，按部就班.

事业:顺利，小有成绩，宜即时总结经验，图谋更大的发展.树立信心，不计较一时的得失.追求实质性的内容，慎重诸事，不得随波逐流，寻求有实力的人物提携自己

经商:开始会遇到困难，不应灰心，宜全面分析形势，大胆开拓，勇敢地投入，联合他人，共同合作，根据市场，运转业务

求名:不可过多地注重外表，而应着重于内在的素质.大胆地推荐自己，但应坚持自己的理想

婚恋:慎重选择，有合适者，则应迫切追求，不可三心二意，务必专一.注重对方的内在气质，勿为表面现象所欺骗

决策:喜爱注重外表，缺乏追求内在气质的恒心.生性较为浮躁，好务虚名，往往因此而碰壁，或半途而废.在事实的教育下改变不切实际的做法，明察社会和人生，会有所收敛，变得自持，注重自身修养，成全事业，中年以后会大有作为，老年仍可发挥余热`,
    `贲，表示美丽得外表装饰，主小凶象.金玉其外，败絮其中，经过有心修饰，伪装的外表或事情，事业投资，感情皆不宜.慎防有心的小人，伪君子

解释:表面好看，里表不一

特性:重精神，轻物质，有艺术文学专才，感情敏锐，追求理想.在情爱上，易留下刻骨的回忆

运势:卦象是象征其人外表好看，内在空虚，因此，必须充实自己，凡事深思远虑，与人和睦相处，能获得意外利益.切忌因小失大，更无须为了掩饰外观而造成不必要的损失.凡事踏实，按部就班为是

家运:外美内虚而不为外人所知，应即时整顿家庭经济，使其安稳，充实，更须安份自持，莫以虚浮来掩饰空虚.踏实为上策

疾病:病情危重，为心脏，胸腹等病

胎孕:孕有不安之象

子女:子女身体虚弱，美丽而得人缘周转不宜大小调尚可 买卖有贵人速决有利

等人:会来但远方者不来

寻人:已在东北或南方亲友家，可寻

失物:在家中遗失，将可寻回.不妨试试注意门脚的地方

外出:慎远行.但只要准备充分，注意安全，不会出麻烦考试:不理想.但人家以为你读得不错

诉讼:宜速求解决，不可拖延，可得贵人调解求事条件勿太苛求，可成

改行:改行宜，但勿夸大或太过

开业:开业者吉利之象`,
    `问时运:目前正值好运发动，凡事顺心适意，但上面有阻止，不能依自己的意愿径直行事。

问商业:主经理人明达强干，足以担任事务；但是精明的人必定苛刻锐利，还应当留意。

问家宅:恐怕宅中有火光发动，幸而马上扑灭了，没有大害。

问征战:前面有山，不易进攻

问疾病:是郁火上蒸的病症，应该息火，尤其不可过分用寒剂，以免真火被扑灭

问行人:要归来却又中止，还没有决定。

问胎孕:生女孩

初爻

问时运:生性清高，不合时宜，凭德行而亨通，不是凭名声而亨通。

问商业:一定是肩负的买卖，而不是舟车贩运的事业。规模虽小，却也亨通。

问家宅:属于勤俭起家，很有“知足不辱”的风范。

问征战:陆军有利。

问行人:中途遇到阻碍，步行返回。

问疾病:病症属于初起，不用服药就可以痊愈。

问讼事:恐怕有惩罚或劳役的灾患。

问失物:已经舍去，徒劳寻找

二爻

问时运:目前平平，只可以依赖别人而成事。

问商业:与富商合作，一定非常兴旺，吉。

问征战:必须与大军一同前进，这样才能得胜。

问家宅:托贵人的福，得以光大门楣。

问婚嫁:“归妹以须”，还需要等待。

问胎孕:生女孩

三爻

问时运:值这样的盛运，光辉而润泽，名利双收，非常亨通。

问商业:财源如水，深受润泽，基业也可以长久保持。大吉。

问家宅:屋宇华美清洁，又得到流水的掩映，可以长久居住。吉。

问征战:全军都为身受的德泽而感动，欢喜融洽，同心同德，可以称为王者之师，天下无敌

问讼事:得以申冤，对方不敢再次侵犯。

问婚嫁:百年偕老，吉。

问胎孕:生男孩。

问行人:身着锦绣的服装，荣耀地回来。

问失物:向水中寻找，能得到

四爻

问时运:目前运势有阻碍，安分才吉祥。明年就可以亨通。

问商业:应该迅速贩运和销售，如果迟缓，就要防止货物变色。

问家宅:一座住宅中，既有丧事又有婚事，主先否塞而后亨通，没有灾祸。

问征战:有和亲通好的议论

问疾病:胸部有阻滞，所以上下不调和，阻滞消化掉就没有问题了。

问行人:有所爱的女子眷恋，一时不会回来。

问胎孕:生女孩

五爻

问时运:目前正行好运，但做事只应该勤劳节俭，这样才吉。

问商业:买卖最适宜木材和绸物两种，货物不一定多，但获利的情况很好。

问家宅:以农桑为事业，以勤俭为家风，吉。

问征战:应该召请山野老人作向导，可以得胜。

问婚嫁:聘礼虽然微少，但好在得到一位贤妇，大喜。

问胎孕:生男孩

上爻

问时运:好运已经结束，劳累者应该归于安逸，动作者应该返于静定。优游自适，聊以取乐罢了

问商业:货价已经很高，时令即将完结，不必装饰，马上就可以出售，一定赢利。

问家宅:家风清白，位置也高，吉。

问征战:身为上将，堂堂的阵脚，正正的旗帜，不用奇谋妙计而自然获胜，吉。

问疾病:病在上焦，适宜用清淡的药剂，吉。

问行人:得利归来。

问胎孕:生男孩。

问失物:向高处寻觅，可以得到`
]
const GUA_EXTRA_23 = [
    `剥:不利有攸往

彖曰:剥，剥也，柔变刚也.不利有攸往，小人长也.顺而止之，观象也.君子尚消息盈虚，天行也

象曰:山附地上，剥；上以厚下，安宅

初六:剥床以足，蔑贞凶.象曰"剥床以足，以灭下也"

六二:剥床以辨，蔑贞凶.象曰"剥床以辨，未有与也"

六三:剥之，无咎.象曰"剥之无咎，失上下也"

六四:剥床以肤，凶.象曰"剥床以肤，切近灾也"

六五:贯鱼，以宫人宠，无不利.象曰"以宫人宠，终无尤也"

上九:硕果不食，君子得舆，小人剥庐.象曰"君子得舆，民所载也小人剥庐终不可用也"`,
    `这个卦是异卦（下坤上艮）相叠.五阴在下，一阳在上，阴盛而阳孤；高山附于地.二者都是剥落象，故为“剥卦”.此卦阴盛阳衰，喻小人得势，君子困顿，事业败坏

大象:山附于地喻山石崩而落于地面上，五阴迫一阳，正义被损.

运势:恶运缠身，宜重新部署，不宜自作聪明，防被女子及小人连累.

事业:时运不佳，乃大势所趋，个人只能顺应时势而暂停行动，静观待变，不可冒险，积极创造条件，增强实力，谨慎隐忍，勿与小人同流.时来运转，成就事业，为期不远.

经商:已从高峰转入低落，进入不景气时期，需要认真总结经验教训，进行整顿，尤其不可孤注一掷.景气形势一旦到来，可顺势从容再起

求名:成功的可能性不大，不宜执意强求，应继续创造条件，努力提高自己，充实处世的本领，增强实力，待机东山再起.

婚恋:务须慎重考虑，除非有十分般配者，不要随便进行.双方应注意维护家庭的和睦

决策:一生曲折较多，往往隐入不顺利的境况，甚至绝境，但可绝处逢生.只要冷静分析形势，顽强拼搏，一定会彻底改变命运，获得美好的结果，为他人惊羡.关键是不可急于求成，尤其不可冒险.须顺应时势，并防小人陷害.`,
    `剥，表示剥落之意，主大凶象.地动山崩，一时群山崩落为平地，表示很严重的动荡，变化，而致使重大的伤害，不幸的产生.最易有急症，意外的血光之灾.事业，感情，婚姻，得此卦需有心理准备，所有之前的努力可能要重新再来了.唯此卦利于重新到外地发展，或另寻对象也可

解释:剥削，剥落.

特性:反应灵敏，思想新颖，走在时代尖端，有研发长才，有意料之外的机会和柳暗花明之遭遇

运势:运带破，带衰，有不利之灾祸，不可抱持野心，自作聪明，否则自掘坟坑.得此卦者，必有与欢场女子耗费钱财而又被陷害之苦恼，且有受部下连累而损财，为不得志之时运也

家运:正处于没落之时，辛苦劳心，有心挽回者可得安，否则有别离之险象

疾病:病情恶化之象，防头痛，肠胃，性病等疾

胎孕:虚惊之凶象

子女缘薄不和体弱

周转:无望 买卖难成若成亦有损

等人:不会来

寻人:在东北方的山上或水边寻之

失物:目前还隐藏在家中地上，可惜无法发现，不久会被扫走

外出:暂缓为好.可在充分准备之后动身.

考试:落榜

诉讼:因财而起纷争，小人当道，宜避之则吉

求事:顺而止，要谨慎行事，不可粗心大意

改行:不利必损财

开业:开业者有阻碍，切勿意气用事，否则有害，宜再待时`,
    `问时运:运势不太好，应该以安定自守，没有灾祸

问商业:必须使资本雄厚，然后聚积货物，贩运到国外，必定获利。商业以剥落别人的钱财为利，所以吉。

问家宅:寄居的住宅可以出钱买下，自己的住宅反而不利。

问征战:防止敌人的袭击，应该增加兵力。

问疾病:魂不附体，恐怕不吉。

问行人:随伴侣而行，马上可以回家。

问胎孕:生女孩，开始危险，后来安泰。

问失物:得是可以得到，只恐怕有残缺

初爻

问时运:目前正值消剥的运，防止有足部的疾病。

问商业:堆积货物，要防止底部朽烂；或者运载出国时，因为船底有水而被浸坏。

问家宅:防止梁柱、基础、门限有损坏，而将要倾覆。

问征战:防止敌人从地道进攻。

问行人:有足病，不能归来。

问疾病:是足少阴的病症，正气不胜邪气，凶

二爻

问时运:从去年以来，气运逐渐低下，被人剥削而无法辩白。凶。

问商业:置办的货物，价格逐渐低落，无法获利。凶。

问家宅:“辨”也通“变”，指家宅应该迅速改造或迁移，这样才能避开凶险。

问行人:买了行装就会归来

问征战:没有接应的军队，不可行动，行动就凶。

问疾病:病人已经卧床，没有良医，要防止无法治疗。凶。

问胎孕:生女孩，难以养育。

问失物:无法重新拥有

三爻

问时运:运势虽然不正，但只要反其道而行，就可以免于灾祸。

问商业:同伙都攀高价，自己独自暗中脱售，虽然有失同伙的心意，却能独自得利。

问家宅:拆去椽子和瓦，平整地基，剥落后重新建造，没有灾祸。

问征战:是军队中最有计谋的人。虽然不与各军约会而独自进攻，却可以得胜，没有灾祸

问疾病:应该服用消导攻伐的药剂，这样可以痊愈

四爻

问时运:时运很不好，有身体受伤的忧惧。

问商业:恐怕剥耗过重，还要防止意外的灾祸。

问家宅:住宅必定破败不堪，居住的人也寥落，以致需要防止倾塌。

问征战:恐怕主将有灾祸。

问疾病:凶。

问胎孕:生女孩，产妇也危险

五爻

问时运:目前气运堂煌，事事圆满到位，没有不利。

问商业:可以得到满贯满万的利润，北海海产生意尤其好。

问家宅:有妇女主持家政之象。

问征战:需要行离间敌军的计策，可以获胜。

问疾病:是阴亏的病症，必须自我珍爱，这样还可以无忧。

问行人:外面有宠妾，必将相伴而回。

问胎孕:生女孩

上爻

问时运:目前气运衰微，一年后就会值好运。

问商业:卖出的还能得到微利，买入的必定多有损耗。

问家宅:忠厚人家，还有多余的福泽；以刻薄起家的，恐怕有墙屋倾圯的忧患。

问征战:退守者无害，进攻者必败。

问疾病:有饮食不进的忧虑。

问胎孕:生男孩，是独生子`
]
const GUA_EXTRA_24 = [
    `复:亨.出入无疾，朋来无咎.反复其道，七日来复，利有攸往

彖曰:复亨；刚反，动而以顺行，是以出入无疾，朋来无咎.反复其道，七日来复，天行也.利有攸往，刚长也.复其见天地之心乎？

象曰:雷在地中，复；先王以至日闭关，商旅不行，后不省方.

初九:不复远，无只悔，元吉.象曰"不远之复，以修身也"

六二:休复，吉.象曰"休复之吉，以下仁也"

六三:频复，厉无咎.象曰"频复之厉，义无咎也"

六四:中行独复.象曰"中行独复，以从道也"

六五:敦复，无悔.象曰"敦复无悔，中以自考也"

上六:迷复，凶，有灾告.用行师，终有大败，以其国君，凶；至于十年，不克征.象曰"迷复之凶，反君道也"`,
    `这个卦是异卦（下震上坤）相叠.震为雷，为动；坤为地，为顺，动则顺，顺其自然.动在顺中，内阳外阴，循序运动，进退自如，利于前进.

大象:雷在地中振发，喻春回大地，一元始，万象更生

运势:开运亨通之象，万事不宜急进，按部就班可成

事业:已经渡过了困难时期，开始进入积极行动的阶段.但务必抓住时机，当机立断，却不可急躁，且应时常反省个人行动，严于修身，勇往直前，可望成功

经商:可大胆投资，与志同道合的伙伴坦诚合作，打开市场，勿因挫折而退缩.更可以打入外地，坚持商业道德，循序渐进，一定会有所赢利

求名:时机正在成熟，不要急于求成，继续奠定基础，机遇一旦到来，务必要抓住，必将转运.最忌自伤意志.

婚恋:顺利.但切不可性急，应冷静考虑.家庭的美满幸福，靠严于律己维持.

决策:性格活泼，精力旺盛，但因急躁情绪会造成事业损失.一定要冷静思考，勇于改正错误，必能重振事业.此时应抓住时机，明确方向，灵活机敏，脚踏实地改变处境.一旦出现意外，宜当机立断，暂行退让.如能准确驾驶自己，努力奋斗，成就事业十分顺利`,
    `复，表示重复再来，周而复始之意.是个状况卦，吉凶未定.好事会重复，但坏事也会重复再来的.此卦显现一种循环的状态，可能是好也可能是坏

解释:一年复始，万象更新

特性:为最佳辅佐人才，做事谨慎，调理分明，精企划，组织，一生财运丰足，乐于助人，排解别人困难，人缘佳

运势:一阳来复，万事苏伸，不久就会好转.初时不宜急进，脚踏实地则有一本万利，开运亨通之象也

家运:昌隆茂盛，渐曙光明之象

疾病:病防发，但可治，为肝，肠胃，神经系统病变

胎孕:主产母有惊惧之灾

子女:辛劳之后必得享福，儿女将来会出人头地周转难求，反覆终可入手

买卖:有是非，故勿太急，可有利

等人:会迟到

寻人:自身反覆终人不动，但七日内可回

失物:有失而得之可能

外出:无灾无祸，且有收获

考试:愈考愈好

诉讼:多人之事，但经多次扰攘才可解决

求事:勿太急，可成

改行:可行，但宜沉着，勿急躁

开业:开业者可行，但宜沉着，勿急躁`,
    `问时运:好运刚来，还没有发动，安静等待，自然获吉。

问商业:货物完好具备，时价也动了，应该暂时停止出售，这样一定能赢利。

问家宅:住宅现在闲置，必须等到春天，才可以迁入居住。吉。

问征战:防止敌军埋伏地雷，须暂时停战，以蓄养兵力。吉。

问疾病:是痰火的病症，饮食不进。交冬令的时候应该防备。

问讼事:一时无法审理结案。

问胎孕:生男孩，交春分时生产。

问婚嫁:现在因为媒人还没有前往说合，春初可以成事。吉。

问行人:冬季不回，开春才回来。

问失物:一时难以寻觅，日后可以得到

初爻

问时运:好运就要到来，渐渐发动，凡事顺利，大吉。

问商业:以前的损失，现在可以重新得到，可以免除悔恨。大吉。

问家宅:旧业的复兴就在眼前，大吉。

问征战:即日可以转败为胜，大吉。

问讼事:初审不得理，再次控告则必胜。大吉。

问婚嫁:主散而又成，大吉。

问行人:很快就会归来，吉。

问疾病:静养可以复原，元吉。

问胎孕:即日生男。

问失物:即日可以得到

二爻

问时运:目前气运还好，事事能择善而从，所以事事得吉。

问商业:能与人共享利益，他的事业就必定兴旺。吉。

问家宅:家庭多休祥之象，自然能复兴旧业。吉。

问征战:暂时停止进攻，姑且示弱，以蓄养锐气。吉。

问疾病:应该请最初治疗的医生再作诊视。吉。

问行人:必定随长辈回来。

问胎孕:生女孩。

问失物:就低下处寻找

三爻

问时运:一好一歹，不时有所得或有所失，能据有所得而不失去，全在于人。

问商业:有亏损也有盈利，能使盈利多亏损少，或亏损后又盈利，也可以获利。

问家宅:有迁移不定之象。

问疾病:屡次治疗屡次犯病，虽然危险，可以保证无害。

问讼事:有频繁翻供，反而导致危厉之象。

问行人:归心还没有决定。

问胎孕:生男孩，很有难产的征候，但是无害。

问失物:失去已经不是一次，应当可以找到

四爻

问时运:气运柔弱，虽然想要振兴，可惜力量不够。

问商业:谋划精当，不失正道，但资本不足，这是可惜的。

问家宅:女眷多，男丁少，未免有独自睡眠、独自歌唱的感慨。

问征战:防止中途设有埋伏。

问疾病:是虚弱的病症，应该听从最初治疗的医生调治。

问行人:中途返回，得到伴侣而归来。

问婚嫁:应该从以前的媒人。

问失物:在半路上寻觅

五爻

问时运:目前气运得正，只要事事敦厚，就有前定的成功，没有事后的悔恨。

问商业:资本充足，来回都可以获利。

问家宅:祖基深厚，旧业重新光大，吉。

问征战:军力雄厚，可以克复城池。

问疾病:病人精神旺足，身体丰腴，无害。

问胎孕:生男孩。

问失物:应当自己忖度，应该能回想起来

上爻

问时运:气运颠倒，作事乖张，谨慎才能免于祸患。

问商业:货物不齐全，日期的约定不准确，市价不确实，必定导致大的损耗，以至一时不能恢复经营。凶。

问家宅:防止有怪祟，居住者多不利。

问征战:车辙紊乱，旗帜倒伏，是大败之象。

问疾病:病症已经危险，能久病延年也属于侥幸。

问行人:在外面多凶险，十年内恐怕回不来。

问胎孕:生女孩。这女儿长大后，也是大败的命`
]
const GUA_EXTRA_25 = [
    `无妄:元，亨，利，贞.其匪正有告，不利有攸往

彖曰:无妄，刚自外来，而为主於内.动而健，刚中而应，大亨以正天之命也.其匪正有告，不利有攸往.无妄之往，何之矣？天命不佑行矣哉？

象曰:天下雷行，物与无妄；先王以茂对时，育万物

初九:无妄，往吉.象曰"无妄之往，得志也"

六二:不耕获，不菑畲，则利有攸往.象曰"不耕获，未富也"

六三:无妄之灾，或系之牛，行人之得，邑人之灾.象曰"行人得牛，邑人灾也"

九四:可贞，无咎.象曰"可贞无咎，固有之也"

九五:无妄之疾，勿药有喜.象曰"无妄之药，不可试也"

上九:无妄，行有告，无攸利.象曰"无妄之行，穷之灾也"`,
    `这个卦是异卦（下震上乾）相叠.乾为天为刚为健；震为雷为刚为动.动而健，刚阳盛，人心振奋，必有所得，但唯循纯正，不可妄行无妄必有获必可致福

大象:雷动于天，阳气舒发，为真实无虚妄之意

运势:凡事宜守正，若行为不检者，必招灾祸

事业:贵自知之明，从个人实际出发，不抱非分之想，脚踏实地，勤奋努力，检点行为，防意外灾祸.不计较得失，诚心追求，待机而动事业必成

经商:切勿勉为其难，遵循市场规律，讲究商业道德，屏弃投机心理，勿贪暴利，经过辛勤努力，日积月累，必将成功

求名:以良好的动机，刻苦努力，丢弃幻想，但问耕耘，不问收获，终将有所获.

婚恋:双方务以诚相待，绝不可抱以轻率的态度，亦不宜急于求成顺其发展水到渠成

决策:精力充沛，富有上进心，可有作为.但务必勤勉努力，诚心诚恳，奋发向上，刻苦钻研.不可因小有成就而得意忘形.不必追求所得，而应追求实干.遵循规律办事，等待时机再行动.尤其应清除非份的念头.这样，可实现自己的理想`,
    `无妄，表示不要有一些空幻的想法，或是你的想法可能有点虚妄不切实际，主小凶.建议凡事要务实，踏实一点.也表示目前所处的状况，是有一厢情愿的心态，或是有点妄想症的不切实际心理.

解释:无妄之灾

特性:言词犀利，易生是非，愤世嫉俗，不流俗，求知欲强，重精神层面.

运势:无妄的道理是提醒要真实无虚，踏实.故若做事操守而能坚贞固执者吉.若不行正道，行为不检点者，必然有灾祸至也切忌沉醉于利欲之中慎之

家运:有不和之情况，因受外界诱惑而心乱，须谨慎，否则导致破运.

疾病:不宜意气用事，应尽力疗养为宜，属呼吸系统，头，足之疾病.

胎孕:或有惊，终无碍

子女:注意与其父不和而离家出走

周转:诚心有望不诚免谈

买卖:若不要过份苛求，有利

等人:一定会来.但有不欢而散之象，宜以和为贵

寻人:已走远，不易寻找，东北或西北之向

失物:找不到，似已遗失

外出:不存妄想则平安无事.为谋私利或邪念而行则大为不利，不宜行

考试:笔试有利，口试不利

诉讼:因女人或死亡之事起纷争，宜和解，否则招凶

求事:毫无头绪，勿过于草率为宜

改行:不宜勉强

开业:开业者可行`,
    `问时运:目前得时运，凡事都相宜。吉。

问商业:正如大旱的时候渴望甘霖，惊雷一声，人人都翘首而仰望。货物一到，无不畅销，样样获利，大吉。

问家宅:宅中不时有响动，但没有妨碍。屋运很旺，人口繁盛，吉。

问征战:有风雷席卷的气势。务必用正正的旗帜，堂堂的阵容；倘若想以诡诈取胜，恐怕反而有祸。

问疾病:是胃中有积物没有消化，应该随时运动，积物自然消化，“勿药有喜”。

问行人:现在已经动身，即日可以归来。

问婚嫁:两家素有往来，门楣相对。大吉。

问胎孕:生男孩，到时候平安生产，吉。

问失物:或在鼓旁，或在磨下，或在井日旁边，寻找就可以得到。

问天时:下一点雨就晴

初爻

问时运:目前吉，只应该出来有所作为，不应该闭门守在家里。

问商业:有利于行商，不利于坐贾。

问家宅:应该迁居，吉。

问征战:应该进攻，吉。

问疾病:应该到外面就医，吉。

问行人:或许有事去了别处。吉。

问胎孕:生男孩，下月可以生产。吉。

问婚姻:招女婿入赘，吉。

问失物:应该去外面寻找

二爻

问时运:目前得到了正运，自有意外的财物可得，非常有利。

问商业:不用谋划，却得到大利，吉。

问家宅:住宅想是继承的遗产，或者是为别人经管的庄舍。

问征战:前面的敌人倒戈，有不战而胜之象。

问疾病:“勿药有喜。

问婚姻:是招婿入赘的亲缘。

问行人:在外面得利，一时不回来。

问胎孕:生女孩

三爻

问时运:目前气运尴尬，防止有意外的事，要谨慎。

问商业:防止别人占利，而自己损耗钱财。

问家宅:住宅恐怕被外人侵占。

问征战:出行的军队得胜，守卫的军队防止有损失和失败。

问疾病:这病恐怕是外来人传染的，值得忧虑。

问行人:回来是回来了，只恐怕家人有灾祸。

问婚嫁:适宜与远方的人结亲，吉。

问失物:已经被行人拾去

四爻

问时运:目前气运平顺，守本分就会有收获，妄动则有灾祸。

问商业:固守旧业，自然亨通。

问家宅:住宅本是祖上的基业，应该永远保有，不要失去。

问征战:已经占入外卦的地方，应该坚守城池，千万不要躁妄前进。

问疾病:现在应该安静调养，下月不用药就会痊愈。

问行人:一时没有归来，在外面无咎。

问胎孕:生男孩。

问失物:一定会重新得到

五爻

问时运:目前气运当正，对意外的事不必介意，吉凶全在自己罢了。

问商业:一时物价无故起落，于商业无害，过后自然平稳，千万不要扰动。

问家宅:防止因为风扫雪压而导致倾塌，不但没有大害，反而有喜兆。

问征战:防止有时疫流行，应该清洁营地，不要乱用药。没有灾祸。

问行人:恐怕中途涉及意外的事，但会马上归来。

问讼事:有意外牵涉，不用辩解，自然化解。

问胎孕:生男孩。

问失物:不用寻找，自会得到

上爻

问时运:好运已经终了，应该安守不动，行动终究凶险。

问商业:所经历的贸易颇为得利。现在值年终，或在时令交换之际，应该暂时安静守份，千万不要再前进，防止有损耗。

问家宅:这虽然是旧宅，居住却吉祥；小心不要迁移，迁移有灾。

问征战:地步已经到了极致，不可再前进了，前进有害。

问疾病:一定是老年人，应该颐养自适。

问行人:当日可以归来，归来后切不要再出行。

问胎孕:生男孩。

问失物:恐怕穷追而得不到`
]
const GUA_EXTRA_26 = [
    `大畜:利贞，不家食吉，利涉大川

彖曰:大畜，刚健笃实辉光，日新其德，刚上而尚贤.能止健，大正也.不家食吉，养贤也.利涉大川，应乎天也.

象曰:天在山中，大畜；君子以多识前言往行，以畜其德

初九:有厉利已.象曰"有厉利已，不犯灾也"

九二:舆说辐.象曰"舆说辐，中无尤也"

九三:良马逐，利艰贞.日闲舆卫，利有攸往.象曰"利有攸往，上合志也"

六四:童豕之牿，元吉.象曰"六四元吉，有喜也"

六五:豶豕之牙，吉.象曰"六五之吉，有庆也"

上九:何天之衢，亨.象曰"何天之衢，道大行也"`,
    `这个卦是异卦（下乾上艮）相叠.乾为天，刚健；艮为山，笃实.畜者积聚，大畜意为大积蓄.为此不畏严重的艰难险阻，努力修身养性以丰富德业.

大象:天之大而在山之中，以小阻大，以阴畜阳，为止为养

运势:处事不可好高骛远，宜脚踏实地，可成大业，忌目空一切.

事业:务必端正行为，滋养德行.行为应大胆，果断，但需适可而止，注意休整，决不可冒险闯进.宜注意吸收前人的经验教训，有所畏而不行，否则必有危害.再取得成就之后，应适可而止，不可贪图眼前小利而走向反面

经商:本着循序渐进的原则，把握正当的商业道德，会有重大收获.此时，切忌贪心不足，而应见机而退，保守事业，深思熟虑，再图发展，一味自信冒进，决不可取.

求名:注意积累学问，提高德行，勿三天打鱼两天晒网，持之以恒，且以学问，知识报效国家，抱负终将实现

婚恋:顺利.建立在共同勤俭持家的基础上，相互坦诚而待，美满幸福.

决策:蓄财的人，但决不可抱投机取巧心理，得靠个人诚实工作，多动心机，真诚与他人合作，共创事业，困难时仍应持正道，尤其不可粗心大意，牢记成就大阻力也大的道理`,
    `大畜，表示会有很多的积蓄，不动产的来到，吉相之卦.可以考虑较大的投资案，只是现金周转可能会较不利.蓄也有守财小气之象.

解释:大有积蓄

特性:反应快.追求新知，不断创新，研究新事物，待人谦虚，修养好.贵人多助，容易少年发达，年轻就会有所成就

运势:大凡诸事不可好高鹜远，脚踏实地，务实行事，始能成就大业.以蓄德为主可吉，若因得势而气盛凌人，目空一切者，终招失败之象

家运:须知蓄者以备急需也.明此道理，持之力行，则可亨通.

疾病:病虽重，但可治，防胸肺，腹或手部之病，易积劳成疾

胎孕:占得此卦主生贵子

子女:儿女必声扬家风，可得幸福之象

周转:可成

买卖:再谈可成交，且有获大利之象也

等人:不会来

寻人:途中虚险，若一人等待必有凶.若是出走者，不必寻，会自回.

失物:有机会寻回.似是在圆形有盖盛存之物中

外出:不宜守于家中，出行必得，且畅通无阻.不过应处处小心谨慎

考试:上榜

诉讼:因房地产引起，有破财之象，但纠纷可解

求事:不利，宜再待时.

改行:不宜

开业:开业者要有不怕挫折之决心全力以赴，有利可得`,
    `问征战:应该养精蓄锐，乘时而动，这样自然战无不克，攻无不利，一定获得大胜。

问时运:目前心意放纵奢侈，不可行动。必须等到二年后，那时好运到来，才能像骏马腾空一样无往不利。

问经商:暂时应该株守。近则三月，远则三年，业务自然能逐渐拓展。利润的源泉不涸竭，只要日积月累，就大有喜庆。

问家宅:住宅适宜接近山，或在岭上，或在谷中。一定是没有官爵和封地的人家，近来声名显达，家业日益兴隆，是大吉的征兆。

问功名:少年意气轩昂，未免稍有阻碍和压抑。到三十岁后一举成名，青云直上，为国家经纶天下，成绩显著，的确是有大用的人才。

问胎孕:生男孩，并且主贵。

问讼事:开始时被委屈压抑，后来得以申冤

问疾病:占得初爻到五爻都吉，占得上爻则恐怕寿命有阻碍。

问婚姻:大吉

初爻

问征战:应该固守而不应该进攻，这样才无害。必须等到四爻援兵得力，才能大踏步前进而夺得胜利。

问经商:目前资本还少，应该以谨慎自守，以免导致灾害。以后得到帮手相助，自然能获利。

问家宅:是新建的住宅，为前面的山势所压制。屋宅不能过高，但无害。

问功名:才学虽然高，但是初次求名，不宜过早地表现自己，而应该自我抑止。可贵的是大器晚成。

问胎孕:可以断为生男，为长子。

问讼事:不宜凭刚健上进，健进会有灾祸。

问婚姻:初爻阳刚，为四爻所畜止，是丈夫将受制于妻子；但丈夫能顺从她的畜止，却也没有灾祸。

问出门:现在应该暂时停止，以等待时运。

问疾病:现在虽然有病，但可以保证无忧。

问失物:以后自然可以找到

二爻

问征战:倘若锐意地一直前进，必须防止车辙乱旗帜倒的灾祸，以致一败而不可收拾。只有以退为进才没有过失

问经商:所有货物都应该及早脱售，虽然没有大利，但也没有损失。

问家宅:一定是破败的旧家。只要能以谨慎自守，家业自有复兴的时候，所以没有怨尤。

问功名:应该等待时机，不要急于上进，

问婚姻:小畜卦三爻“舆说，夫妻反目”，不吉；本卦二爻得中，与五爻相应，而五爻居尊贵的爻位，必定是一位贵婿，大吉。

问疾病:一定是腹部的疾病，一时难以痊愈，但无害。

问胎孕:生男孩，防止有足部的疾病。

问讼事:败诉后和解

三爻

问征战:有马到功成之象。但必须临事而惧，这样才能无往不利

问经商:三爻与应爻志愿相合，卖者与买者必定同心；说“良马逐”，必定去留都很快捷；说“利艰贞”，虽然遇到危险，但是无害。大吉。

问功名:有青云得路之象。

问家宅:必定是勤俭起家。目前行履当位，家业日益上升，还能安泰而不忘危机，所以做什么都有利。

问婚姻:三爻以上九为应爻，上九处在畜的极位，有全盛的气象。占婚姻而得到这一爻，男女志愿相合，是大吉的征兆。

问疾病:应该谨慎调养，可以保证无忧。

问胎孕:生男孩

四爻

问征战:有强邻压制小国之象，幸而四爻与上爻志愿相合，而得以保全。有喜庆。

问经商:爻辞说“童牛”，指阳刚的初爻，想来由于贸易是新出现的，以经营时货为利。牿，即牢。想来以畜积和固藏为有利，所以说“元吉”

问功名:六四爻辰在丑，上值斗宿。石申说"斗主将相爵禄位次。另外，丑属土，其属相为牛"。孔子说“犂牛之子，骍且角，虽欲勿用，山川其舍诸？”童牛即祭天的牛，这人必定被任用，是很明白的，所以《象传》说吉而有喜。

问家宅:乾为门，艮为庭，为庐，为居，为舍，都有家宅之象。“童牛”指初九，牿指六四。初九为阳爻的始位，所以一定是初建的住宅。为四爻所牿，门前的途径必定有阻碍，无法行进；但最后一定亨通，所以说“有喜”

问疾病:说“童牛”，想必是老牛舐犊，灾难在幼子身上。

问胎孕:生男孩。

问婚嫁:四爻爻辰在丑，上值牵牛。四爻应初九，初九爻辰在子，上值女宿。说“童牛”，一定是少年缔结婚姻，大吉。

问讼事:“童牛之牿”，《说文解字》说牿是牛马牢，恐怕有牢狱之灾。到上九说“天衢，亨”，应当有解脱的喜庆

五爻

问征战:豕属坎，也属亥，所以坎险湿泽处最应该着意禁止，以防止敌军的豕突。能谋划好再行动，自然获吉。

问经商:互有互市的意思，指财物交互成市，正合近时通商的情形。“豮豕”是小豕，譬如初次贸易，资本还少，能接受畜止才吉。

问功名:必定是年少求名，不免急躁于上进，应该懂得自己停下，所以说“豮豕之牙，吉”。

问家宅:豕属亥水，宅前必定有两处水交互流动，所以吉。

问疾病:六五爻辰在卯，属东方木，另外豕属亥水，必定是木旺水亏的病症。应该自己节制和调养，才能有喜庆。

问胎孕:生女孩。

问婚嫁:六五爻辰在卯，属兔。五爻应二爻，九二爻辰在寅，为虎。寅卯相合。又说“豮豕”，豕属亥，亥与寅卯木水相生，都得到制伏，大吉

六爻

问征战:上九爻辰在戌，上值奎、娄、胃三宿。奎宿象征白虎，主兵；娄宿主兴兵聚众；胃宿主征伐，都是军事。爻辞说“何天之衢”，意思是旌旗飘扬在路上，通过一次作战而建立功勋，所以《象传》说“道大行也”。

问经商:上爻下应九三，九三说“利艰贞”，可知当时贸易还有很多艰苦。到上爻为畜的极致，畜到极致就会通达，所以“何天之衢，亨”，即三爻所谓“利有攸往”。《象传》说“道大行"，必定大获利益。

问功名:爻辞说“何天之衢”，可以说是青云得路的时候，大吉。

问家宅:爻辞说“何天之衢”，衢是大道，可知住宅必定在大道旁边。“何天”，指得到天的保佑。亨属吉，住宅必定吉祥。

问胎孕:生男孩

问婚嫁:想是天作的配合，吉`
]
const GUA_EXTRA_27 = [
    `颐:贞吉.观颐，自求口实.

彖曰:颐贞吉，养正则吉也.观颐，观其所养也；自求口实，观其自养也.天地养万物，圣人养贤，以及万民；颐之时义大矣哉！

象曰:山下有雷，颐；君子以慎言语，节饮食

初九:舍尔灵龟，观我朵颐，凶.象曰"观我朵颐，亦不足贵也"

六二:颠颐，拂经，于丘颐，征凶.象曰"六二征凶，行失类也"

六三:拂颐，贞凶，十年勿用，无攸利.象曰"十年勿用，道大悖也"

六四:颠颐吉，虎视眈眈，其欲逐逐，无咎.象曰"颠颐之吉，上施光也"

六五:拂经，居贞吉，不可涉大川.象曰"居贞之吉，顺以从上也"

上九:由颐，厉吉，利涉大川.象曰"由颐厉吉，大有庆也"`,
    `这个卦是异卦（下震上艮）相叠，震为雷，艮为山.山在上而雷在下，外实内虚.春暖万物养育，依时养贤育民.阳实阴虚，实者养

人虚者为人养.自食其力.

大象:形如口腔之象，取其饮食之道，须慎言，注重日常生活，

运势:处事欠缺周详考虑，不宜心怀阴谋，要守正道而善方吉.

事业:凡事得靠个人追求，自己奋斗，而不能依赖他人更不得用不光彩的手段谋求财物，只要遵循正道，自食其力，慎言敏行，一定会有好的机遇，这时，经过一番艰苦奋斗，能够成功.

经商:不得急于求成，初仅以勉强维持生活为限，谨慎小心，循席渐进，诚以待人，古诚与他人合作，因时制宜，不断追求新的开拓方向，必要时可适当冒险.

求名:以丰富自身知识为目的，知足安贫，刻苦努力，成功的希望极大、

婚恋:不可急于求成，关键在于加强自己的修养，一旦选中应全力追求，尤其不可三心二意.

决策:注意道德修养，乐于尽力而为地去帮助他人，救人急难，不贪求不应得到的财物因此，能受到他人的尊重，也能不断得到外来的援助，个人事业十分顺利，成功的可能性很大尤其不可粗心大意，牢记成就大阻力也大的道理.`,
    `颐，表示养也，主小吉带一点凶.养跟饮食有关，也表示养育，教育的意思，对情势需要充分了解，不要贸然的就下任何的决定颐又与口有关故需慎防小人口舌之灾

解释:静卧，不向前冲

特性:有欠缺考虑，鲁莽妄动之害.若有怀阴谋，与人互相猜疑或争端者更不利.要守正道而善行之，凡事切忌任性非为

运势:先苦后甜，失败后成功型，物质金钱运佳，乐善好施，贵人多助.不断提升修养自己，容易得到社会好的名声

家运:陷于痛苦深渊，有身败名裂之象，宜改进言行，冷静反省，力求幸福才是

疾病:占病为凶，久病者险，为肠胃，咽喉，手足之疾

胎孕:宜求香火保佑.

子女:过份溺爱反有害.尤其须注意儿女健康，以免日后因身体虚弱而不能获福

周转:是否成功，要看自己是否有诚心.

买卖:守旧为宜，不宜新事所为，否则不利

等人:难来，中途有碍

寻人:不久相逢.东北或东之向

失物:尽快去找，似被物件上下夹着

外出:应慎重.不宜过多外出.如无充分准备，仓促出行，将可能会遇到凶险

考试:尚可

诉讼:我告他人终不能成，宜速和解

求事:不成.

改行:不宜，勿勉强.

开业:开业者不利，须再待时`,
    `问征战:上卦止而下卦动，防止手下有妄动而导致混乱的或者漏泄机密，或者酗酒肇事，最需要谨慎。

问功名:山下有雷，雷发声，山也鸣，有声名腾达之象。

问经商:颐卦内震动而外静止，主内地物价上升，外地物价低落。又恐怕贩货到了外地，一时不能销售。货物大约不出食品之类。

问家宅:艮山静止而震雷动，山在上卦，雷在下卦，恐怕地盘震动，应该防止火灾

问疾病:上卦止而下卦动，山属土，雷属火，主上焦寒冷闭塞，下焦发热泄泻的病症。必须等到五爻，《象传》说“顺以从上”，才能上下通畅而得吉。一爻为一日，必须到五日才能痊愈。

问行人:内卦动而外卦止，一定已经动身而为外面的事情所阻止。上九说“利涉大川”，可知必定从水路而来。近则六七日可以到，远则六七个月才能回来。

问胎孕:生男孩。

问失物:山下有雷，可知失物压在重物下，一时看不见，以后可以得到。

问讼事:主为言语饮食之类小事而争讼。下卦震动而上卦静止，一定有长官出来阻止，不会争讼到底。

问婚姻:颐即养。妇人主饮食，有养的意思。丈夫主外，妻子主内，内动而外止，有妇人顺从丈夫之象。吉

初爻

问征战:古时候行军前必须占卜，以确定吉凶。爻辞说“舍尔灵龟，观我朵颐”，象征不敬畏神明而只知道贪取财物，所以说凶。

问经商:初爻象征初始，变阴则全卦为剥。剥是剥落，《象传》说“不利有攸往”，经商恐怕难以获利。爻辞所说的尔我指宾主，“朵颐”即口动进食。舍“灵龟”而观“朵颐”，即使有利也恐怕被别人夺去，所以凶。

问功名:“灵龟”指内心，“朵颐”是外貌，舍去内心而求外貌，舍去自己而观别人，必定徒有虚名而没有真才实学，功名难以成就。

问家宅:宅中六神不安，恐怕有外鬼来求食作祟，凶。

问疾病:病是饮食不节制所致，应该向神祈祷，可以痊愈。

问婚嫁:尔我即男女两姓。“舍尔”“观我”，显然可见两姓间不和谐，原因在于争论采礼。婚姻必定不成，成了也一定凶。

问讼事:一定是由口舌引起。说“舍我”，说“观尔”，是双方各执一辞，一时无法判决。凶

二爻

问征战:行军的要点首先是纪律严明，步调一致。爻辞说“颠颐，拂经”，一定是违反了纪律，步调纷乱，凶险没有比这更大的了。

问经商:二爻变阳则全卦为损。损有耗损的意思，对经商不利。爻辞说颠，说拂，是明说买卖出入不合常理，所以说“征凶"。

问功名:“颠颐，拂经”，是不循常道而侥幸求功名，即使得到，最终也凶险

问婚嫁:六二阴柔而居下卦，不奉养上位而养下位，属于颠倒拂乱而不得正道，妇道如何就不可问了。所以《象传》说“行失类也”，其凶险由此就可以知道了

三爻

问征战:军队以正为吉，拂逆正道则不吉。颐即养，养兵而拂逆正道，兵就不可用了。《象传》说“道大悖也”，指好犯上作乱，败亡是必然的，所以凶。

问经商:商业的目的只是获利，说“无攸利”，无论商业大小、贩货远近，都无利可得。以至“十年勿用”，意思是很久也无法成事，所以凶，

问功名:求功名的要点是出山用世，以济世利民，以道养天下。倘若拂逆颐养的正道，至于“十年勿用”，那就将终身不能被任用了，所以说“无攸利”。

问家宅:住宅必定很久无人居住了，而且恐怕有鬼祟出来求食。家宅不安，居住不利。

问婚姻:主闺门不正，她的婚事也一定要等到十年后才能成。

问胎孕:生男孩

四爻

问征战:将士中的勇猛者称虎臣，也称虎贲，都是就有勇力而言。但必须先养精蓄锐，而不能仗恃威猛而轻率地前进，所以说“颠颐，吉。”

问经商:颠，恐怕一时物价有下跌之象。“虎视耽耽，其欲逐逐”，比譬商人谋利的情状。能看取贱价而购入货物，所以吉而无咎

问功名:自古功名的征兆多取龙虎，所以吉。“视耽耽”，“欲逐逐”，都是谋望腾达的意思

问家宅:住宅右山白虎必定高，有怒目欲噬的形态，幸而四爻以阴爻居阴位而得正，可以无咎。

问胎孕:生男孩

五爻

问征战:行军之道，有成法也有权变。爻辞的意思是能权变，似乎不必拘泥于常道，所以“拂经”无咎。说“居贞吉”，是宜于固守，不宜进攻。“不可涉大川”，恐怕在河流处有伏兵；借助于舟楫前往，要防止有风波的厄难。都应当谨慎。

问经商:有利于坐贾，不利于行商，贩货出国更值得忧虑。

问功名:出来应试，难以指望成名。

问家宅:上体为艮，居住在山中吉祥；如果临江近水，住宅不利。

问婚嫁:恐怕有不得媒人正聘的事，但只要能从一而终，也吉。

问胎孕:生男孩。

问疾病:病在五爻，久则四五月，快则五六天，因为调养失宜而得。能安居静养则吉，如果冒风雨走远路，恐怕难以治疗

上爻

问征战:谚语说“养兵千日，用在一朝”，能够效力于疆场，是从平日的教养而来，所以说“由颐”。兵是危险的事，不知经历多少危险才能告捷，所以说“厉吉”。“利涉大川”，必须军士同心同德，临危不惧，比如周武王率军在孟津与八百诸侯会盟，诸葛渡过泸水就是例子。

问经商:商业的目的只在谋利，得利才足以养身养家。但商人不能安居而得利，必须涉历艰险，甚至远涉重洋才能获利，故说“厉吉”。

问功名:功名之道，要由小而大，由卑而尊，必须忧勤惕厉，才能功成名就。《象传》说“大有庆也”，即所谓“得之有喜"。

问疾病:虽然危险，但能得救，所以说“厉吉”。

问胎孕:生男孩，所以《象传》说“大有庆也”`
]
const GUA_EXTRA_28 = [
    `大过:栋桡利有攸往亨

彖曰:大过，大者过也.栋桡，本末弱也.刚过而中，巽而说行，利有攸往，乃亨.大过之时义大矣哉！

象曰:泽灭木，大过；君子以独立不惧，遁世无闷

初六:藉用白茅，无咎.象曰"藉用白茅，柔在下也"

九二:枯杨生稊，老夫得其女妻，无不利.象曰"老夫女妻，过以相与也"

九三:栋桡，凶.象曰"栋桡之凶，不可以有辅也"

九四:栋隆，吉；有它吝.象曰"栋隆之吉，不桡乎下也"

九五:枯杨生华，老妇得士夫，无咎无誉.象曰"枯杨生华，何可久也.老妇士夫，亦可丑也"

上六:过涉灭顶，凶，无咎.象曰"过涉之凶，不可咎也"`,
    `这个卦是异卦（下巽上兑）相叠.兑为泽，为悦，巽为木，为顺，泽水淹舟，遂成大错.阴阳爻相反，阳大阴小，行动非常，有过度形象内刚外柔

大象:中间四阳爻，为结实之梁，但初末为阴爻，力弱不支，则势将摧折

运势:有力不从心，负担过重之象，多烦恼，防官非及水险

事业:事业出现隐患，甚至危机四伏，务必十分小心谨慎，唯有坚守中道，以谦虚和悦的手段，胆大心细，求助他人相助.必要时可采取非常手段不拘常规，予以冒险

经商:操之过急，发展过快，宜收缩调整.竞争处于不利地步，切勿过度自信，更不得刚愎自用，宜随时观测风向，待机行动.在有确切把握之下，不妨冒险，争取时机的好转

求名:最忌不务实际，追求不切实际的虚名，以致盛名不符.唯以谦逊态度，谨慎行动，潜心努力，不怕世人眼舌，一往直前，追求最初的目标.

婚恋:自知之明最为重要，不可急于求成，应慎重考虑，并以正当手段，促成事情的成功.但也不排除必要的精明手段

决策:处在非常时期，若不能妥善处置，则极为不利，针对实际情况，既不可轻举妄动，也不可优柔寡断，而应刚柔相济，虚心征求他人意见，慎重行动，大胆追求，却又不怕流言，争取时局好转。`,
    `大过，表示犯了一个很大的过错，主大凶.诸事不顺，切忌此时作任何的决策.需努力找出问题之所在，尽快解决才能扭转劣势.

解释:极大过失

特性:心直口快，性急，易得罪他人，是非小人多，但交际层面广朋友多，但也易受朋友之拖累

运势:诸事衰退，多烦恼，防官非及水险.有力而不从心，负担过重之象.逢挫折而将坠落之时运，故得此卦者，凡事切忌轻举妄动否则有过

家运:困难重重，摇摇欲坠之衰运.夫妻感情不睦，且均有向外发展之趋势，若想挽回此破象，双方宜改正自己的缺点，否则破裂也.

疾病:严重，须耐心治疗，为肺，神经系统，女占得妇科经带之疾

胎孕:女儿或男儿均与六亲缘薄，育养困难

子女:子女与双亲间感情薄弱，又缺乏谅解，有症结耳.

周转:无啥希望

买卖:不可做超过自己本身财力之生意交易，否则定有折损，亦不成.

等人:不会来

寻人:不易找到，可向东南方或西方，难寻.但若动用人手共寻找，可见.

失物:无法发现，不能物归原主

外出:行动务必慎重，但不可过于拘泥，必要时不妨采取特殊行动.

考试:苦恼也不佳

诉讼:有文书之烦，即使求和也未能如愿

求事:困难很多

改行:不宜图不相应之事

开业:开业尚属虚，且待时候`,
    `问征战:灭即灭绝。大的欲望毁灭国家，小的欲望灭自身 卦象凶险。行军占得这一卦，恐怕有暴水淹没的灾祸。

问经商:《象传》说“泽灭木”，低价忽然有高涨的势头。

问功名:“独立不惧，遁世无闷”，指应当退身隐居，一时还 不可以求功名。

问家宅:兑泽在上卦，巽木在下卦，卦象反复，位置不正， 要防止有凶险乃至毁灭的灾祸。

问疾病:是肝火内郁的病症，肾气向上冲击，不容易医治。

问婚嫁:“泽灭木”，恐怕配偶之间老少失去了平衡。

问胎孕:生女孩。

问失物:必定坠入了水沟处

初爻

问征战:初次出兵，最忌过于刚暴，应该以宽柔的态度对待 部下。

问经商:贩运的货物一定是药品，或者是茶叶、木材、棉花 ；它的颜色一定白，它的质地一定柔，都可以获利。

问功名:拔茅连茹，有连类一同升进之象。

问家宅:住宅必定接近潮湿低下处，屋外蔓草荒芜，属于初 次建筑。

问疾病:病体柔弱，下焦有湿气，必须用温燥的药治疗。

问失物:到草地上寻觅。

问胎孕:生女孩

二爻

问征战:有转败为胜之象。

问经商:兑为阴，也为金；巽为风，也为木，一定属于金木 生意。“枯杨生梯”，种植林木或贩运树木，都没有不利。

问功名:就爻象来看，必须等到晚年才能成名。

问家宅:住宅属于阳宅居于阴地，过去一定有很多不利；近 来得到阳九发动，必定枯树开花，这是有利的征兆。

问婚姻:主有年老的鳏夫重新娶妻，得以生育，非常有利。

问疾病:虽然危险，但得以痊愈。

问失物:一定能得到

三爻

问征战:栋是房屋的主檩，像一支军队的主帅。挠是摧折， 栋挠是主帅受伤之象。弊病在于主帅过于刚猛，不听别人的 意见，所以凶。

问经商:商业必须有人辅助才能成事，如果自行其是，不但 经营规模不大，而且恐怕导致意外的损失。“栋桡”，有人财 两失的忧虑，所以凶。

问功名:能担当大任的人称为栋梁之材。说桡，就栋不成栋 了，即使一时得到了成功，最终也要归于失败。凶。

问家宅:住宅不吉，栋与榱都被折断，不可居住，凶。

问婚嫁:九三以阳爻居阳位，孤立无援，婚姻不成，成了也 不吉。

问胎孕:生男孩，恐怕无法抚养

四爻

问征战:行军屯营，适宜占据高阜要地，使下面有所凭借， 这样才能营寨巩固，可进可退，自然不为敌所桡败，所以 吉。

问经商:想必是木材生意。木料高大，足以作为巨室的材 料。如果经营其他项目，恐怕不佳。

问功名:又说“栋隆”，必定是大才，可以担当大任，足以副“ 栋隆”的爻辞。其他小事不是他所擅长的，或许不屑于去 做。

问家宅:住宅栋榱辉煌，门户宽敞，吉。

问疾病:想是腹中有痞块隆起，但无害

五爻

问征战:行军占得五爻，军中主将和偏裨的位置必定颠倒。 任用不当。虽然一时能打胜仗，但不能持久

问经商:防止经商者贪恋外遇，以致丑名远扬。

问家宅:防止闺房不正，墙侧有男人。

问功名:必主晚年获如愿。

问婚嫁:必定年纪失衡，匹配不正。

问胎孕:生女孩，养不大

上爻

问征战:恐怕有主将阵亡的悲惨事。

问功名:有头悬梁、锥刺股的苦心，理应声名远播。

问经商:运货出国，最应该谨慎。

问疾病:恐怕水气上冲，头面浮肿，凶。

问家宅:恐怕有大水泛滥，墙倾屋倒的灾难。

问胎孕:生女孩`
]
const GUA_EXTRA_29 = [
    `坎:习坎，有孚，维心亨，行有尚.

彖曰:习坎，重险也.水流而不盈，行险而不失其信.维心亨，乃以刚中也.行有尚，往有功也.天险不可升也，地险山川丘陵也，王公设险以守其国，坎之时用大矣哉！

象曰:水洊至，习坎；君子以常德行，习教事.

初六:习坎，入于坎客，凶.象曰"习坎入坎，失道凶也"

九二:坎有险，求小得.象曰"求小得，未出中也"

六三:来之坎坎，险且枕，入于坎客，勿用.象曰"来之坎坎，终无功也"

六四:樽酒簋贰，用缶，纳约自牖，终无咎.象曰"樽酒簋贰，刚柔际也"

九五:坎不盈，只既平，无咎.象曰"坎不盈，中未大也"

上六:系用徽繹，置于丛棘，三岁不得，凶.象曰"上六失道，凶三岁也"`,
    `这个卦是同卦（下坎上坎）相叠.坎为水，为险，两坎相重，险上加险，险阻重重.一阳陷二阴.所幸阴虚阳实，诚信可豁然贯通.虽险难重重却方能显人性光彩

大象:两水重叠，坎水为险，进固险，退亦险，进退两难

运势:危机重重，宜沉著应付，保持心境开朗，凡事莫与人争

事业:陷入重重艰难险阻之中，险况丛生.既不得冒险，也不可束手待毙，应以积极态度，努力创造条件，改变处境，化险为夷务必实心实意，充满信心，不图侥幸，不辞艰险，宜静观待变，运用智慧突破险境转危为安

经商:十分不利，甚至陷入面临破产的境地，但内心应沉着踏实，保持头脑冷静，身陷险境而心不陷，勿轻举妄动，先求自保以观变把握时机以脱险

求名:不为他人理解，怀才不遇.不可自暴自弃.不改初衷，泰然自若，循序渐进，终可为人理解和发现

婚恋:多遭不利，应冷静分析原因，积极改变自身条件.双方同舟共济，共渡难关

决策:不幸.然而是转运前的考验.只要能不因困境而失常，且不图侥幸，保持信心，勿自陷险境.镇定自若，不轻举妄动，洞察时机，必可转危为安，成出险之功`,
    `水，表示陷溺被水淹灭之意，主凶象，四大难卦第二卦.困难已到来了，此时正在挣扎中，随时会被淹灭而破散.若能破釜沉舟，奋力一击，或许尚有转机，需积极找求贵人，才会有生机.

解释:漂浮被情所困.

特性:不安定感，好冒险，投机，变换工作环境，爱情多困扰不顺.

运势:危机重重，宜容忍自重，保持心境开朗，沉着应付，则可有脱险之机.吃得苦中苦，方为人上人，凡事莫与人争长短，否则有不幸灾害.

家运:时运不济，陷于困境之中，不和，且有分裂之忧，凡事宜慎重行事.

疾病:病重宜速治，否则难救，注意肾脏，膀胱生殖器病.

胎孕:临产有虚惊，难产之象.

子女:子女多劳苦，宜忍辱负重，会有出人头地的一天.子女宜防水厄之灾.

周转:难成.

买卖:亏损

等人:不来

寻人:此人因家庭不和或不得志而出走，速寻北方水边.

失物:找不回来.有失窃可能，或沉在水底.因坎水有困难之意.

外出:大胆外出，另辟新路，必有所成，且得到他人相助.

考试:不理想.

诉讼:有盗贼之讼，或田土之争，有理说不清，凶象.

求事:不利

改行:不宜，应暂时守住本行.

开业:开业者不利，有陷入困难之象.`,
    `问征战:有敌兵频繁侵袭之象，应该时刻防备。
    
问功名:有逐步升腾之象。

问营商:财如流水，源源而来，商运亨通，可以持久而盛大。

问家宅:住宅外北面必定有坑陷，泉流不息。坎卦于十二辰在子，子上值虚危二宿，危主盖屋，恐怕邻居有修造房屋，以致影响此宅风水的。

问疾病:防是水泻的病症，很久没有痊愈，应该取“樽酒簋二”的意思加以祷告。

问婚嫁:必定是亲上加亲，有重复联姻之象。

问胎孕:生男孩

初爻

问征战:虽有设计或埋伏，却因而陷入了敌人的老计谋，这是凶险的做法。

问功名:有侥幸求名而反遭侮辱之象，无益而有害。

问经商，因为贩货失利而转运到别处，到货后市面更小，无法销售。

问疾病:求医治病，医治不得法，病症更加危险。

问婚姻:恐怕陷入骗局，一定不是明媒正娶。

问胎孕:防生产有危难

二爻

问征战:可以暗中挖通隧道，用来袭击敌营，虽然无法取得大捷，但一定有小的胜利。

问经商:小利可以谋求。

问功名:小试一下，必定有利。

问家宅:宅外恐怕有河岸崩塌，应该加以修治。

问疾病:一定是疮疡等症，请医生治疗，应当小有疗效，难以期望完全康复。

问胎孕:生男孩

三爻

问征战:卦象象征营垒的四面都临坎险，进退两难。应该枕着戈矛暂时休息，以等待援军

问经商:观察爻象，是海运生意；船在航行中受到阻碍，应该入港，暂时静心等候。

问功名:从爻象看，正值万般困厄，是“劳其筋骨，饿其体肤”的时候。目前不成功，以后可以实现愿望。

问家宅:住宅水法错乱，有杀气，多凶险。屋北有一个坎窞，应该赶快填满。

问婚嫁:坎为男，象征男家求婚。爻辞说“勿用”，一定不成。

问胎孕:生男孩

四爻

问征战:行军以粮饷为重，即所谓“足兵首在足食”。“纳约自牖”，窗牖不是纳入食物的地方，犹如说应该暗中运饷，以防敌兵劫夺。

问经商:坎为酒，想来属于造酒业。

问功名:想是春风得意的时候，宴乐嘉宾，可喜可贺。

问疾病:应该祈祷。

问婚姻:吉

五爻

问征战:为将之道，最忌仗恃功劳而骄傲，以致众人心中不平，是自取失败之道，即使孙武和吴起再生也无法成功。

问经商:不贪一时的和意外的利益，一定要酌量物价的平衡而作长久打算，属于善于作生意的人。

问功名:名誉和地位不高。

问时运:“满招损，谦受益”，可以终身吟诵。

问家宅:宅外有一小片地，水流清浅；又有一个平坡，风景很好。无害。

问婚姻:两家门户相当，吉

上爻

问征战:有劳军队去远方征伐，很久也不归来的忧虑。问营商:想是采办蚕丝生意，三年后才可以获利。

问功名:恐怕有意外灾难，不但功名不成，还要防止牢狱之灾。凶。

问婚姻:红丝系足，婚姻是前生注定的；但良缘还没到，要等待三年才能成就。

问胎孕:得儿子将迟晚

问家宅:住宅不知为什么荒废了，墙围到处生长藤蔓，应该加以修葺。以前住的人不利，以后住的人吉祥`
]
const GUA_EXTRA_30 = [
    `离:利贞，亨.畜牝牛吉

彖曰:离，丽也；日月丽乎天，百谷草木丽乎土，重明以丽乎正，乃化成天下.柔丽乎中正，故亨；是以畜牝牛吉也.

象曰:明两作离，大人以继明照于四方

初九:履错然，敬之无咎.象曰"履错之敬，以辟咎也"

六二:黄离，元吉.象曰"黄离元吉，得中道也"

九三:日昃之离，不鼓缶而歌，则大耋之嗟，凶.象曰"日昃之离，何可久也"

九四:突如其来如，焚如，死如，弃如.象曰"突如其来如，无所容也"

六五:出涕沱若，戚嗟若，吉.象曰"六五之吉，离王公也"

上九:王用出征，有嘉折首，获其匪丑，无咎.象曰"王用出征，以正邦也"`,
    `这个卦是同卦（下离上离）相叠.离者丽也，附着之意，一阴附丽，上下二阳，该卦象征火，内空外明.离为火，为明，太阳反复升落运行不息柔顺为心

大象:两离火相重，上下通明之象，火有气，但无形，主不实不定之意

运势:外观极盛，烈日当空之象，凡事不宜急进及意气用事

事业:已快进入顶点，盛极而衰，务必总结经验教训，趋善避邪，以顺自养，居危知危，激励志气，切勿妄动.尤应求助中正的人援助以期重振事业

经商:戒急于求成，宜兢兢业业，忧深虑远，考察市场行情，公平竞争，不可投机取巧.争取与他人密切合作

求名:方向未确定之前，不可到处乱撞，应持之以恒，执意追求，虚心向有才德的长者请教

婚恋:自己寻找对象恐怕有困难，最好请可靠的朋友，长辈帮忙，不得急躁.双方应相互尊敬，最忌生邪念

决策:乐天知命，顺应自然，年轻时急于上进，未能实现理想，但坚持中正，谦和，可无灾祸，时常警觉，更可化险为夷.在危难时要寻求依托，但要慎重选择对象.晚年应知天命，尤不可不顾时势而轻举妄图动`,
    `火，表示智慧，明亮，温暖.六冲卦，纯卦，主大吉大凶，大好大坏之象，也表虚象不实之意

解释:变动突发火光

特性:喜欢与人竞争，冲动，自尊心强，不服输，容易遭人排斥反对.依赖自己努力，他人助力较少

运势:虽然目前外观极盛一切顺利，可能为假象，虚象，而且双火之燃，其内部，内情已有所损，又双火之烈，如烈日中天，故凡事宜守之，勿太急进，待人以谦和，理性，否则必有所损失.宜顺从长辈，勿因急躁而妄动或意气用事，则可欣欣向荣也

家运:富有幸福之运，必须保持仁和谦恭，骄傲自大者易招致失败宜谦逊处世

疾病:急病可解，久病则凶，宜耐心调养，为心脏眼科血疾

胎孕:胎有不安产母不宜出外游

子女:子女幸福，但有娇生惯养之嫌，勿疏于教导为上.

周转:可得到上辈的帮助渡过难关

买卖:交易必得利，忌用不法手段

等人:一定会来

寻人:此人因受到诱惑或煽动而出走.南方可寻，且小有是非

失物:动作快可寻回

外出:可行动，事先应准备充分，不可仓促上路

考试:成绩不错

诉讼:只宜人侵己，不宜己侵人，主动者不利

求事:尊重长辈安排.待时机可获良好事业

改行:可极力推展

开业:开业者吉象`,
    `问征战:战胜适宜用火攻，防守也适宜防备火攻。“两作”、恐怕前后都被焚烧

问经商:想经营的业务一定接近火，或者办运硫黄，或者设计电火，或制造火柴等行业，都有利。

问功名:离为目，有成为榜眼的征兆。

问家宅:这房屋一定是新建的，前后开通，窗户通明，屋外四面空旷宽广，是巨室贵人的住宅。吉。

问婚姻:不是原配，一定是继妻。丈夫家一定属于贵室，不是寻常百姓的配偶。

问胎孕:生女孩

问疾病:病情很重，恐怕一两天内就要防止神魂离散

初爻

问征战:初爻为开始，是三军开始行动，旗帜和车辙交错的时候。敬，就是所谓“临事而惧”。征战是危险的事情，慎重地去做，或许可以免除过咎。有人说，斜行叫错，应该从横路进兵。

问商业:必定是新成立的商业。初九爻辰在子，子居北方，属水，而离卦居南方，属火，想是南北生意。一时难以获得大利，但重要的是可以无害。

问功名:《诗经》说“他山之石，可以攻玉。”指得到辅助而成就

问家宅:履卦说“履道坦坦，幽人贞吉。”住宅必定在大道旁。吉。

问胎孕:生女孩

二爻

问征战:离卦二爻变阳则全卦为大有，大有《象传》说“大车以载，积中不败也。"“大车”指兵车，黄是中央的颜色，“积中”指营中军粮充实，“不败”指兵士勇敢强健。得以获胜，所以吉。

问经商:离属于南方卦，经营的利益在南方。黄为土色，而土中生木，所以又利在经营土木之类

问功名:离位在午，午上值文昌星，有文明的气象，功名必定显达。

问家宅:离为火，土色黄，土为火之子，这是比喻这一家有能振起家声的儿子。吉

问婚姻:六二以阴爻居阴位，得中得正，主夫妇顺随，属于好的配偶，吉。

问疾病:必定是内火郁结在中焦的病症，适宜用凉消解。无害。

问胎孕:生女孩

三爻

问征战:“日昃”是将到晚上。军队中长歌浩叹，失去纪律，是不吉之兆，尤其要防止敌兵夜袭。

问经商:《周礼》地官掌管集市，所谓“大市日昃而市”，意思是大的集市交易繁多，到日偏西开始集中交易。爻辞说“日昃之离”，是日偏西后而离散。市区扰乱嘈杂，或歌唱或嗟叹，哀乐无度，必定有损于正业，应该戒止。

问功名:恐怕年龄大的而没有成就，白白地自我悲伤。

问婚姻:“鼓缶而歌”，难以指望白头偕老，凶。

问胎孕:生女孩，难以养育

四爻

问征战:有营垒被焚毁，枪炮声暴烈的灾祸。灾祸来势汹汹，应该谨慎防守。

问经商:有人财两失的灾祸，应该隐藏或退避，这样或许可以免灾。

问功名:有唾手可得的形势；但名誉和地位越高，得到的灾祸就越重，不如隐退。

问家宅:旧说以突为不孝的儿子，这家必生逆子。焚、死、弃，都是就逆子的罪行而说

问婚姻:四爻变阴则上卦为艮，艮为鬼冥门；另外离卦互兑，兑为刑人。这婚姻很不吉利。

问胎孕:生女孩，一定养不大

五爻

问征战:根据爻辞的“沱若”和“嗟若”，有临事而惧的意思。战争是危险的事，能惧怕才能谋划，能谋划才能制胜，所以吉。

问经商:经营的一定是王家商务或公家事业，不属于百姓的私事，所以说“离王公”。事业也必定通过辛苦艰难而成就。

问功名:地位达到宰辅，极为尊贵显耀，但自己的忧虑和劳苦倍于普通人，像诸葛武侯那样鞠躬尽瘁才吉

问婚姻:这婚事极可贵，但有“先号咷而后笑”之象。

问胎孕:生女孩，要防止难产，不过最终吉祥

上爻

问征战:爻辞已经明白显示了。王者之师不乱杀人，才能体现出正道

问经商:贩售货物，应该选取上等货，不取低劣的，这样才能获利。

问功名:必定光荣地成为首选，吉。

问疾病:折指夭折，不利。

问胎孕:生女孩`
]
const GUA_EXTRA_31 = [
    `咸:亨，利贞取女吉

彖曰:咸，感也.柔上而刚下，二气感应以相与，止而说，男下女，是以亨利贞，取女吉也.天地感而万物化生，圣人感人心而天下和平；观其所感，而天地万物之情可见矣！

象曰:山上有泽，咸；君子以虚受人

初六:咸其拇.象曰"咸其拇，志在外也"

六二:咸其腓，凶，居吉.象曰"虽凶，居吉，顺不害也"

九三:咸其股，执其随，往吝.象曰"咸其股，亦不处也.志在随人，所执下也"

九四:贞吉悔亡，憧憧往来，朋从尔思.象曰"贞吉悔亡，未感害也憧憧往来未光大也"

九五:咸其胸，无悔.象曰"咸其胸，志末也"

上六:咸其辅，颊，舌.象曰"咸其辅，颊，舌，滕口说也"`,
    `大象:少男在少女之下，彼此感应，象征新婚，两感.

这个卦是异卦（下艮上兑）相叠艮为山；泽为水，兑柔在上，艮刚在下，水向下渗，柔上而刚下，交相感应感则成，

运势:如意吉祥，但勿为不正当感情而意乱情迷，

事业:和为贵，和则万事兴，务以诚感人，以诚待人广泛交往朋友，谦虚礼让树立大志向，坚持主见，不可盲目随大流不利时

经商:有利可图.但应以纯正之心以诚待人，加强合作市场若不景气，决不可妄动，不可强求，而应静待发展，虚心听取不同意见.

自身.

应安居待机，不可妄动强求.

求名:志向应宏大，脚踏实地，虚心请教他人，使人悦而应，帮助童角自己，切莫自我封闭，更不得冷漠孤僻，以广阔的胸怀发展

婚恋:成功的可能性极大双方很有感情，但动机务要纯正，婚

姻方可幸福，永久.

决策:吉祥如意人际关系好，善于交际，以真诚的态度，无私的心去处世，不会有不利的地方，与他人合作应坚持原则，办事不诚恳，但不可与玩弄口舌的小人交往防止受骗.

可优柔真断不顺利时，应停止行动，总结经验，以图发展，待人`,
    `咸，表示感动也.主吉象.感，有如青春男女，清纯无暇的感情，心心相印有感而发的情感，得此卦，与感情有非常大的关系，也可引伸为对一种理念的认同和欣赏.咸，并无利欲的情色纠葛，是属于比较感性的一种感觉.对男女之间的感情，是最大的吉象.

解释:合和

特性:罗曼蒂克型，异性缘佳，感情丰富，六亲缘浓，口才佳，贵人多助

运势:吉祥如意.但勿为不正当的感情而意乱迷惑，或过于冲动.然得此卦时，会有男贪女爱之筝，非名正者必遭损，宜慎之.

家运:目前非常融洽，而后亦然.如夫妇间另有不正当之交往者，宜明哲保家，避免有越轨情事为宜

疾病:防泌尿系统病，肠胃病及性病等，须疗养得法，否则不利胎孕有兴家和泰之运

子女:感情极融洽，幸福

周转:可成

买卖:交易可成有利

等人:会带来好消息

寻人:因色情之事出走，不久会出现.其人有在住处动身不得之忧恐有些是非

失物:尽速找寻，可以取回，延误时机，则找不回来

外出:虽希望外出，但暂时不宜远行.待时机成熟时再出行

考试:成绩佳.

诉讼:提防桃色纠纷，诸事宜和解，有贵人相助

求事:皆能如偿所愿

改行:吉利可进行

开业:大吉大利`,
    `问征战:军队前进时，防止有陷坑；在山谷间，防止有埋伏；固守城池，防止敌兵暗通地道。都应当谨慎

问经商:山泽是生财的地方，即财源。“以虚受人”，所以购入物产，贩运转售，一定大得利润。

问功名:“山上”是高阜之象。“山上有泽”，泽积水于低洼处，含有居高思危的意思。只应该虚心待人，这样功名才可以长久保持

问家宅:住宅必定傍山临水，知道所应该安止的地方，吉。

问疾病:是虚弱的症候，应该服滋补的药剂。

问婚姻:卦象为“山泽通气”，主两姓和好，大吉。

问讼事:双方必定是少年意气相争，讼事以和解而中止为好。

问胎孕:生男孩。

问失物:必定落入空洞有水的地方，无法再得到

初爻

问征战:是兵刃刚刚交锋的时候，应爻主第四天，那时可以得胜。

问经商:一定是初次交易，货物已经办妥，只是还没有销售。

问功名:必定一举成名，有捷足先登的征兆。

问家宅:有迁居到外地的意向。

问疾病:是足上初起的毒疮之类，应该用外敷药调治。

问婚姻:初六与九四相应，以艮男向兑女求婚，是“取女”的开始。吉。

问胎孕:生男孩，是第一胎

二爻

问征战:适宜固守不动，这样可以免于危害。

问经商:不利于行商，有利于坐贾。

问功名:只可以依赖别人而成事，所达到的地位和成就不能高远。

问疾病:腓部有病，症状一定是四肢痿弱麻痹，只能坐卧不能步行。

问婚姻:婚事已成，恐怕有变故，能以柔顺自守，即使处境凶险，终结时也吉。

问胎孕:生男孩

三爻

问征战:适宜退守，不适宜进攻。

问经商:凡商业合作中分别出的资本，叫做股份，必定推举一个人来主持商业。而主持商业的人不能自主，只好随着别人上下，这样商业一定难以获利。

问功名:追随声望，依附名人，其人品未免低下，必定难以成功。

问家宅:住宅接近艮山，本来可以安住，但占问者不愿意住在这里，想随别人迁往别处。恐怕前往鄙吝

问婚姻:过失在于过分听从主事者的言语，恐怕所嫁不是好配偶。

问胎孕:生男孩

四爻

问征战:军队完全以主帅为心。在军队纷然集聚的时候，以一位统帅来镇定，就会令行禁止，寂然不动；否则扰乱错杂，灾害就产生了。

问经商:商务虽然是谋利，也以贞正为吉，倘若见利忘义，就会众人一齐起来争夺，不夺得就不停止。这样的危害是说不尽的。

问功名:九四以阳爻居阴位，接近九五至尊，有得正而功名显达之象。但如果所求不正当，灾祸就会随后到来，这是最应该谨慎的。

问家宅:这住宅必定临于往来畅通的大路。这里的人邪正杂处，交往最需要审慎抉择。

问疾病:一定是心神恍惚的病症，应该静养。

问婚姻:防止女方家闺范不严谨。

问胎孕:生女孩

五爻

问征战:适宜暗中跟在敌人的后面，进攻他们的背后，有胜无败。

问经商:《象传》说“志末”，末是微小，可知他的商业不大，利润也微薄。

问功名:背指败北，可知所求未必能成

问疾病:台背是长寿之象，可知疾病马上痊愈，没有悔恨，而且长寿。

问胎孕:生女孩

上爻

问征战:防止有间谍窥探。

问经商:恐怕有口舌的祸患

问功名:可以献计献策，陈述言辞，应当得到任用

问家宅:主人口不和睦，发生口舌的争辩。

问疾病:谵言呓语，主病人心魂不安，应该祈祷。

问婚姻:中间人的言语，不可完全相信。

问胎孕:生女孩`
]
const GUA_EXTRA_32 = [
    `恒:亨，无咎利贞，利有攸往

彖曰:恒，久也.刚上而柔下，雷风相与，巽而动，刚柔皆应，恒.恒亨无咎，利贞"久於其道也，天地之道，恒久而不已也.利有攸往终则有始也".日月得天，而能久照，四时变化，而能久成，圣人久於其道，而天下化成；观其所恒，而天地万物之情可见矣！

象曰:雷风，恒；君子以立不易方

初六:浚恒，贞凶，无攸利.象曰"浚恒之凶，始求深也"

九二:悔亡.象曰"九二悔亡，能久中也"

九三:不恒其德，或承之羞，贞吝.象曰"不恒其德，无所容也"

九四:田无禽.象曰"久非其位，安得禽也"

六五:恒其德，贞，妇人吉，夫子凶.象曰"妇人贞吉，从一而终也夫子制义，从妇凶也"

上六:振恒，凶.象曰"振恒在上，大无功也"`,
    `这个卦是异卦（下巽上震）相叠.震为男，为雷；巽为女，为风.震刚在上，巽柔在下.刚上柔下，造化有常，相互助长.阴阳相应，常情故称为恒

大象:震者为动，宜向外发展，巽为入，为内向，一内一外，各居本位，故能永恒不变，喻夫妇之道

运势:万事亨通，能恒久努力，安守本份则吉，妄动则招灾.

事业:诸事无不成于恒，持之以恒，必有成效.恒乃成功之本.为此，务必动机纯正，守静而勿躁动，不可急于求成，也不可固守死道，应从个人实际出发.最忌人云亦云，最宜随机应变.如此诸事顺而成

经商:大胆行动，有所往必有所利.注意市场行情和周围的情况.随时变化经营策略，但不得改变常理常道，坚持慎重选择的方向，勿追随潮流.忌不自量而冒险强求

求名:有始有终，善始善终，立于正道，坚持不懈，学习方面尤应提高涵养必可成.

婚恋:好事多磨，有曲折，唯不可见异思迁，和睦相处，勿固执己见

决策:循序渐进，不要在一开始时期望过高，但不能因此放弃追求，应脚踏实地，从实际也发，不要好高骛远，更不可不自量，勿冒险激进，勿反复无常.坚信宇宙常新，不断修正自己的见解，补充新内容.`,
    `恒，表示维持不变的迹象.是个状况卦，吉凶未定.显示一种会持续很长久的一种状况.好的或坏的情形，都将会再持续下去事业投资，感情婚姻都不宜在此时做任何的计划或变动

解释:要有恒心

特性:主动，积极，坚忍，百折不挠，律己严，反应快，追求成功，理财佳组织能力好

运势:诸事亨通而没有犯错方能恒久.其象利于正常固守，并须有毅力持行.雷风者，知守常则吉，妄动者则不能亨通

家运:全家上下均各循正轨而行，幸福家庭也

疾病:为慢性及须长期治疗之疾.注意肝之疾

胎孕:胎有烦恼但无碍

子女:与双亲感情融治，幸福之至

周转:不成问题

买卖:有贵人，得力终成.利益双收

等人:迟到.

寻人:外出之人平安无事，会自己回来

失物:不能寻回

外出:果敢行动有利

考试:会得高分

诉讼:小人招祸，但宜速战速决，不利拖延，宜和解

求事:向东南有利

改行:忌做无妄之事，需注意风险

开业:吉利可行`,
    `问征战:雷出于大地，风生于山谷，要防止有敌兵埋伏，用火炮攻击。应该坚守营垒，不可后退，以后可以转败为胜。

问经商:震属正东，巽属东南，说“立不易方”，指贸易不可换地方。

问功名:震巽都属木，木植立不变，冲霄直上，有直达之象。但适宜积久而成，不宜急于上进。

问家宅:住宅坐西北，朝东南，是祖上留下的旧宅，是恒产，方向切不可改变。

问婚姻:男家是长男，女家是长女，长男长女相配，婚姻非常有利，可以预卜百年偕老。

问疾病:一定是肝火上冲，痰火气喘的病症，必须服以前的药方，不必改换。

问胎孕:生男孩，一定是第一胎

初爻

问征战:应该步步为营，切忌孤军深入，深入必定凶险。

问经商:应该得利就出售，不可垄断居奇，贪图高价。

问功名:应该安分守职，千万不要想方设法地乞求荣宠。企图侥幸成名，恐怕反而招致困辱。

问婚姻:婚姻之道，应该门户相当，切不要羡慕富人，攀援贵人，贪图缔结高亲，反而会导致后悔。往往有这样的事。

问家宅:住宅是新建的，可惜过于追求华丽，导致难以持久。

问讼事:恐怕一涉诉讼，就很久不能了结。

问胎孕:初胎生女，只怕难以养育

二爻

问征战:营地位置失当，恐怕有后悔，只好居在其中而不动。这样持久地固守，才能免祸。

问经商:货物得不到销路，以致有损失。应该持久地等待价格，可以返回本钱。

问功名:失去机会反会招致灾害，等待时机再前往，即使不能成名也不会有怨尤。

问家宅:住宅位置不当，居住者不利。十年后宅运可以转变，那时才能无咎。

问婚姻:平平。

问胎孕:生女孩

三爻

问征战:军事以勇往果决为贵，这样才能制胜。巽为不果，必定多畏缩，这样进退无恒，势必丧失军队，辱没国家，怎么能无咎？

问经商:爻辞说“不恒其德”，必定是经商而没有固定的行业，这样怎么能获利？

问功名:没有专一的品德，事业必定不能成就，名誉凭什么得到？

问家宅:三爻居巽的终位，巽终变震，震为大途，住宅必定接近大路。住宅不利长久居住。

问婚姻:婚事没有结果，恐怕会留下羞辱。

问胎孕:生女孩

四爻

问征战:立营寨的位置不当，必定导致军队已老，却没有功绩。

问经商:凡货物的销售，各有不同的地点。如果缘木求鱼，即使恒久从事也一定没有收获。

问功名:如同不入考场而期望高中，不入朝廷而求显要的官职，所居位置不当，即使恒久也没有收获。

问家宅:住宅方位不利，不可久居，应该赶快迁移。

问婚姻:两姓配偶不合。

问胎孕:生男孩，恐怕难以养育

五爻

问征战:古人说军队中有妇女，士气就不高，项羽的失败，未必不是由于虞姬连累了他。行军应该小心这一点。

问经商:商业应该随时变通，如果固执一端而拘泥不变，像妇人和孩子那样，就一定没有大利。

问功名:大丈夫志在四方，前程远大。倘若贪恋闺房，伤害身体，败坏名誉，凶险没有比这更大的。

问家宅:古人说“牝鸡司晨，惟家之索”，应当深以为戒。

问婚姻:女方家占得这一爻吉，男方家占得这一爻凶。

问胎孕:生男孩

上爻

问征战:上爻为主帅。行军之道全在镇定，倘若贪功妄动，一定不能成功。

问经商:上爻为一卦的归宿，是商业收束的时候。应当收束而不收束，收发失去时宜，最终就无法结局。

问功名:上爻处于卦的终位，功名已经穷尽，如果还痴心妄求，不但没有成就，恐怕反而招致灾祸。

问家宅:住宅已经旧了，不必改造，改造一定凶险。

问婚姻:一定是晚年续娶。不必续娶，续娶一定区险。

问讼事:应该赶快停止诉讼。

问失物:得不到`
]
const GUA_EXTRA_33 = [
    `遁:亨，小利贞.彖曰"遁亨，遁而亨也.刚当位而应，与时行也.小利贞，浸而长也.遁之时义大矣哉！"

象曰:天下有山遁；君子以远小人，不恶而严

初六:遁尾，厉，勿用有攸往.象曰"遁尾之厉，不往何灾也"

六二:执之用黄牛之革，莫之胜说.象曰"执用黄牛，固志也"

九三:系遁，有疾厉，畜臣妾吉.象曰"系遁之厉，有疾惫也.畜臣妾吉不可大事也"

九四:好遁，君子吉，小人否.象曰"君子好遁，小人否也"

九五:嘉遁，贞吉.象曰"嘉遁贞吉，以正志也"

上九:肥遁，无不利.象曰"肥遁，无不利；无所疑也"`,
    `这个卦是异卦（下艮上乾）相叠.乾为天，艮为山.天下有山，山高天退.阴长阳消，小人得势，君子退隐，明哲保身，伺机救天下.

大象:山在天之下，阴渐长，而阳渐消，宜退避三舍

运势:小人道长，君子道消，凡事宜退不宜进，穷则独善其身，养诲修身.

事业:时运不佳，应考虑退隐，勿与不正派的人同流合污.但不是消极逃避，而是为保存实力，总结经验，把握时机，待机而出.切忌贸然行事，造成不必要的损失.同时勿为眼前小利禄所诱惑.

经商:市场进入衰落的状况，行情不佳.决不可执意追求，盲目投入，而应沉着冷静，坚持商业道德，远离小人，奸商，保存自己的实力，等待市场行情好转，再图发展

求名:名哲保身，甘居退隐.全力总结提高，为复出做准备

婚恋:勿急于解决，更不可妄动强求.时机成熟时，须以纯正的态度去正确对待

决策:处于衰败时期，小人得志.盲目行动必遭不利.虽不必以恶报恶，但更不可同流合污，因小失大，因权宜轻重，韬光养晦，保存实力，断然离去，不可犹豫不决.潜心发展个人实力，隐忍待机.只要能坚定正道，坚持中正，必可在时机成熟时复出，成就大业`,
    `遁，表示退守，退步之意，主凶象.一切事项均需停止下来，因其中可能有小人或障碍，阴谋在破坏中.退另有表示退步之意，功课事业，均不再如同往常般的成绩了

解释:隐居退守

特性:外华内虚，内心不易满足空虚，自我要求高，不善人际关系但有贵人运.宜追求心灵宗教寄托

运势:小人道长，君子须远离小人，诸事宜守.艮者，止也，言行物事要谨慎，才能得安而运泰.若遇小人之害，见陷于是非之地勿管闲事，识时务为俊杰

家运:须多积德行善，可得安祥.若常争端则衰运，且有别离之象，离婚之象.若曾数经波折之君子，历尽沧桑，则有先恶后吉之运.

疾病:病重，注意血气不调，头，背，筋骨不良之疾

胎孕:母子不安慎之

子女:儿女体质虚弱，有亲子不和之象

周转:不成有碍

买卖:宜守，不能大事进取，否则失败

等人:遁藏也不能来

寻人:下落不明，为家庭之事而离乡背井，寻亦难觅

失物:失落远处不能寻回

外出:不宜积极行动，而应等待时机，创造条件，争取早日而行

考试:不理想

诉讼:强行争取亦不利，宜罢手逃避反吉

求事:须待时机

改行:不得时

开业:开业不利`,
    `问征战:防止前进有山，山间有敌兵埋伏，以致遭受失败。

问经商:恐怕一时物价涨落不同，相差很远

问功名:应该隐退，不应该进见。君子吉，小人否塞不通。

问家宅:住宅接近山，前面空旷辽远，要防止有阴祟。

问疾病:病是由于有鬼祟，应该敬而远之，以避居为吉。

问婚姻:二五两爻一阴一阳，本来相应，但邪正不同，以谢绝为吉。

问胎孕:生女孩

初爻

问征战:爻辞好像就伏兵而说。埋伏应该深藏不露，使敌人找不到痕迹。倘若藏头露尾，必定导致危厉，还不如不埋伏。

问经商:销售货物应当赶快，不应当落后，并且应该首尾一并卖完，这样才能避免灾祸。

问功名:有鲤鱼跃龙门而被烧去尾巴之象，吉。

问家宅:应该迅速迁移，落后有灾祸。

问婚姻:遁指避开并远离，象征婚姻不合。

问胎孕:生女孩

二爻

问征战:在各军逃散的时候，能独自坚决固守，这种精神可嘉。

问经商:一时货物价格固然没有涨，因为执着于来时的本钱，没能脱售。

问功名:席珍待聘、美玉待沽是功名的征兆，“莫之胜说”功名就难以指望了。

问家宅:住宅阴气逐渐壮盛，对居住的人不利。大家都想迁移，但一时难以出售

问婚姻:婚约已经成了，后来却想退悔，令主事者非常为难

问胎孕:生女孩

三爻

问征战:军阵的进退都有纪律。敲鼓前进，鸣金后退，最需要便捷、一有迟误，必定导致大的失败，应该慎重。

问经商:货物在脱售的时候，不应该踌躇不决，或系恋私情，防止为此耽误大事。

问功名:值奸人秉政的时候，应该急流勇退，这样才无疾无害。

问家宅:住宅不利，主多病厄，应该迅速迁移。倘若迟延不去，恐怕有大祸。

问婚姻:娶正妻不利，娶妾却吉。

问胎孕:生女孩

四爻

问征战:四爻处在乾体的开始，乾为健，只知前进而不知后退。或许军队中有一个人谋划隐退，避开危险。隐退也吉。

问经商:商家以买入为进，卖出为退。四爻说“好遁”，可知以卖货为有利。

问功名:爻辞“好遁”，这人必定无意于功名。但名也有不同，或者盗虚名于一时，或者垂大业于千秋，是君子还是小人，从这里就区分开了。占问者应当自我审视。

问疾病:四爻在乾体，爻辞说“好遁”，阳遁入阴，他的病危险了。但转危为安，也是遁象，想来大人可以治疗，小人就难办了

问婚姻:防止以后有离婚的忧患

问讼事:俗话所谓“三十六着，走为上着”，说的就是“好遁

问胎孕:生男孩

五爻

问征战:正当敌势强盛的时候，能通过暗中返回，使军队得以保全，也是可嘉的，

问经商:到货后，因为与时价不合而转到其他地方，得以获利，可以说应变而不失正当，所以吉

问功名:九五为尊位，占得九五，必定功名显达，地位近于台辅。伊尹说，臣不要因为宠利而觉得自己成功，指能做到功成身退，所以吉。

问家宅:住宅必定是南阳诸葛的茅庐、栗里陶令的住宅。高风亮节值得崇尚。

问婚姻:二五两爻本来阴阳相应，有意谈论婚嫁，五爻因为心志不同而不肯应允。另就其他人的聘约，吉

问疾病:是阴邪纠缠的病症，暗中而避开，可以获吉。

问胎孕:生男孩

上爻

问征战:战事应进而不应遁，遁必定不利。爻辞说“肥遁，无不利”，当得起这一爻辞的，大概只有太王避狄迁岐的故事吧？

问经商:商人谋利，往往众人竞争。现在能独自实行人取我弃、以退为进的策略，他的后退反而会得到厚利，所以爻辞说“肥遁”

问功名:这人一定不以膏粱肥口，而能以道义肥身，所以说“肥遁，无不利”。

问家宅:住宅地势很高，家道也富裕，但只利于求财，不利于求名。

问疾病:胖人气虚，遁是脱的意思，恐怕导致虚脱。

问婚姻:恐怕女子因为贪恋富家子弟而私奔。

问胎孕:生男孩`
]
const GUA_EXTRA_34 = [
    `大壮:利贞.

彖曰:大壮，大者壮也.刚以动，故壮.大壮利贞；大者正也.正大而天地之情可见矣！

象曰:雷在天上大壮；君子以非礼勿履

初九:壮于趾，征凶，有孚.象曰"壮于趾，其孚穷也"

九二:貞吉.象日"九二页吉以中也"

九三:小人用壮，君子用罔，贞厉.羝羊触落，赢其角.象曰"小人用壮君子罔也"

九四:贞吉悔亡，藩决不赢，壮于大舆之輹.象曰"藩决不赢，尚往也"

六五:丧羊于易，无悔.象曰"丧羊于易，位不当也"

上六:羝羊触藩，不能退，不能遂，无攸利，艰则吉.象曰"不能退，不能遂，不祥也.艰则吉，咎不长也"`,
    `这个卦是异卦（下乾上震）相叠.震为雷；乾为天.乾刚震动.天鸣雷，云雷滚，声势宏大，阳气盛壮，万物生长.刚壮有力故曰壮.大而且壮，故名大壮.四阳壮盛，积极而有所作为，上正下正，标正影直.

大象:雷声响亮，光明天际，为正大光明之象，又为强烈地动之象，为六冲卦之一.

运势:运势虽强，但已届极盛之时，宜心平气和，否则反招失败，须知物极必反

事业:处世凭智不凭力，有勇更有谋，切忌蛮干，该守不守，自取其凶.不可逞强，否则自取凶险.对小人应有防犯，尤其不得忽视小人的奸诈.对事业应勇往直前，但切忌冒进.

经商:处在高涨阶段，形势很好.但决不可逞强，更不可妄动，应主动增强与他人的合作.提高警惕，认识物极必反的道理，做事业衰退的准备.

求名:务必注意妥善地运用自己的力量，不可自恃刚健强壮而冒进.尤其不可自负.适当发挥自己的才干，加上外力的援助，必有所作为

婚恋:决不可因自己条件好而高傲.切勿错过好姻缘

决策:强健适中，不可过分消耗自己的力量.在事业顺利的时刻，尤其不可妄动.更应注意，很可能已经处于进退维谷的状态，务必自保待机，及早有所准备.`,
    `大壮，表示天上打雷，声势浩大，行动迅速，积极之象.此卦一般以吉处藏凶来论.因为对人，对事最忌冲动.此卦有过于不理性冲动之象，容易犯错.尤其有血光之祸，被人殴打，伤害之意.得此卦凡事再三思为吉

解释:声势浩荡

特性:爱冒险，领导欲强，喜怒易形于色，不喜欢太平淡安定的工作生活.金钱支出大方，朋友人缘不错

运势:刚强过盛者，若不思正与顺，则有躁动之害耳.虽运势强大，时至当盛之期，但忌血气方刚.处事欠思虑而遭破运，宜力持和平，顺气，勿得罪人，否则会因此而招来失败，切勿贪妄

家运:已壮大且富有，但亦有似成而空之感

疾病:生平少病者遇此卦则不利，注意急性呼吸道感染和脑疾等.

胎孕:子母有难非喜

子女:儿女有自视太高，目中无人之情

周转:勿再三借贷，如此反而不利

买卖:可成功与获大利，但往后要小心，有反遭不利之情况

等人:迟来.

寻人:为斗气而出走，若寻找途中不见，则难查下落，东方或西北方.

失物:不能取回

外出:慎重外出，不可莽撞，否则不吉利

考试:有好成绩，但勿太骄傲

诉讼:忌与人斗气，宜和解收场否则两败俱伤

求事:可顺利，勿太刚强行事

改行:可不过勿太勉强

开业:吉利`,
    `问征战:军力强盛，有迅雷不及掩耳之势；但兵骄必败，这是应当深深戒止的。

问经商:雷在天上，是货价正高之象，得价就要出售，不可过于贪财。

问功名:雷声远震，一定能成名。

问家宅:防止有火灾，应该祈祷。

问疾病:震为雷，也为足，防有足部的疾病，而不能行走。

问婚姻:震为乾的长子，巽为坤的长女，属于天作的配合，吉。

问失物:雷一过就无形，恐怕这东西无法再得到。

问胎孕:生男孩

初爻

问征战:“壮于趾，征凶”，为孤军深入的人提出了警戒。有勇无谋，所以凶。

问经商:货物的贩运，有不胫而走、不翼而飞的妙处；但不考虑销路而贸然前往，怎么能获利？所以凶

问功名:初爻本来在下位，说趾，是动在下位，功名必定低微。

问家宅:趾，止的意思。住宅应该安止，不应该迁移，迁移有凶险。

问婚姻:防止女子有足部的疾病。“征凶，有孚”，指虽然有聘约，但是“其孚穷”。

问失物:失物已经被踏坏了。

问胎孕:生男孩

二爻

问征战:因为谋划得力，所以能得胜，吉。

问经商:因为货价适宜而得时中的价格，可以获利

问功名:恰好中式，吉。

问婚姻:雀屏中选，吉。

问家宅:住宅坐西朝东，位置适中，大吉

问疾病:病在中焦，应该用潜阳滋阴的药剂，自然得以痊愈。吉。

问讼事:得到中间人的调剂，马上平息。

问胎孕:生男孩

问行人:已在途中，马上可以归来

三爻

问征战:善于作战的人审度时机，观察敌情，不敢妄动；自恃勇力的人逞强战斗，以孤军长驱直入，以致陷于危险而无法脱离，所以凶。

问经商:自恃资财的富有而任意垄断，一旦货物毁坏，无处销售，必定遭受大的损失。善于经商的人应当没有这个忧虑。

问功名:鲁莽者必定失败，谦退的人必定成名。

问家宅:住宅位置既高，建房就应该低。房屋过高，恐怕有震陷的灾祸

问疾病:病是由于血气过刚，用药适宜调血下气

问讼事:以忍气吞声，中止诉讼为宜。倘若强讼不休，最终凶险。

问婚姻:两姓或许一贫一富，倘若富者仗恃富有而凌驾于贫者之上，会导致夫妻反目，凶。

问胎孕:生男孩

四爻

问征战:前途城垣已经破败，车马往来驰逐，进攻可以全无阻碍。

问功名:九四互乾卦，爻辰在戌，戌上值奎壁二宿，壁宿主文昌，用来崇尚文德，功名必定显达。王良五星在壁宿的北面，主车马，有大舆之象；雷电六星也相近，主兴雷，即震雷之象。

问经商:可以许为满载而归，吉。

问家宅:住宅在车马往来的地方，宅前藩篱破落，应该赶快修整。

问疾病:人以发肤为藩卫，以心神为车马。发肤破裂，心神摇荡，病体不会久了。

问婚姻:“舆说辐，夫妻反目”，不是好配偶，不吉。

问胎孕:九四为震体的开始，震一索而得到男孩，为长子

五爻

问征战:二爻说“羝羊触藩”，有攻击之象。“丧羊”就无触，这样战事就可以消弭了

问经商:易，郑玄认为指交易，有经商的含义。丧，丢失的意思。恐怕有小的损失，但没有大的悔恨

问功名:以得到为吉，以丧失为凶，亡羊补牢，不能算晚。晚年还可以指望

问家宅:住宅在郊外空旷处，于畜牧不利。

问疾病:丧是凶象，不吉

问婚姻:牵羊担酒是婚礼上必备的节目；因为没有羊，婚礼不成。

问胎孕:生女孩

上爻

问征战:上六处于爻的极位，如同追穷寇，仗恃得胜而深入，反倒为失败的军队所困，以至进退无路，就是凶道了。

问经商:一心囤积居奇而不销售，到时机过去、价格低落的时候，就保本也不可能了，那时窘困就严重了。

问功名:上爻有地位高而危险之象，倘若系恋不退，灾祸一旦到来就不及后退了，那时后悔也晚了

问家宅:上爻居震的极位，震为声响，宅中必定有响动；震又为木，木动克土，恐怕有土精出现。土精为羊。住宅不利，应当以艰难自守。变卦为晋，彖辞说“锡马蕃庶”，到晋卦就可转咎为吉了。

问婚姻:没来得及详细打听就敲定，现在改悔已经晚了。应当知道艰苦困守，久后必有好结果。

问胎孕:生女孩 `
]
const GUA_EXTRA_35 = [
    `晋:康侯用锡马蕃庶，昼日三接

彖曰:晋，进也.明出地上，顺而丽乎大明，柔进而上行.是以康侯用锡马蕃庶昼日三接也

象曰:明出地上，晋；君子以自昭明德

初六:晋如，摧如，贞吉.罔孚，裕无咎.象曰"晋如，摧如；独行正也裕无咎；未受命也"

六二:晋如，愁如，贞吉.受兹介福，于其王母.象曰"受之介福，以中正也"

六三:众允，悔亡.象曰"众允之，志上行也"

九四:晋如硕鼠，贞厉.象曰"硕鼠贞厉，位不当也"

六五:悔亡，失得勿恤，往吉无不利.象曰"失得勿恤，往有庆也"

上九:晋其角，维用伐邑，厉吉无咎，贞吝.象曰"维用伐邑，道未光也"`,
    `这个卦是异卦（下坤上离）相叠.离为日，为光明；坤为地.太阳高悬，普照大地，大地卑顺，万物生长，光明磊落，柔进上行，喻事业蒸蒸日上.

大象:日出地面，普照大地有光明上进之象

运势:事业，名望，财运皆吉，所谓有加官晋爵之兆

事业:顺利.应遵守正道，迎难而上，克敌制胜，因势利导.树立良好的人际关系，深得人心.全力以赴，不得有丝毫犹豫不决，更忌优柔寡断，而应败不馁，勇往直前.注意和衷共济，共同前进

经商:行情好.市场竞争顺利.但也会遇到一些困难，必迎难而上，因势利导，克敌制胜.争取众人支持.前进中的挫折不可免，只要动机纯正，必可转危为安

求名:经刻苦努力与奋斗，已具备开拓事业的基础，却因无人引荐，暂时不得志，决不可因此自暴自弃，须耐心等待时机.同时，更加积极地创造条件

婚恋:吉星高照.会有理想的结果，但决不可自恃条件优越而抱无所谓的态度或过于挑剔

决策:处于不断上升的形势，不会有过大的阻力.但务必争取众人信任，获取人心，再接再厉，只要动机纯正，克服侥幸心理，必有喜从天降`,
    `晋，表示进取也，主吉象.火为太阳，所以是日出于大地，光明乍现，阳光准备要照耀大地，一片欣欣向荣之象.事业投资，升迁婚姻，感情均是有雨过天晴，奋发向上的吉象

解释:很明白，很明亮

特性:荣誉心重，固执，爱面子，外华内虚，喜领导他人

运势:事业繁荣，声誉渐高，于人，事，物均获宏利之际，与人共事者吉.但要知进德虚怀，即是诸凡对人，事宜谨守德操，不可傲溢心怀，否则有破象也.但财运旺

家运:虽如日中天，切不可过于骄纵，蛮横，若为人不行正道，虽然光明就在眼前，且兴隆幸福，又难免夫妇失和，家运不振耳

疾病:久病者凶，近病无妨，注意胃肠，心脏之疾

胎孕:平

子女:多才智，聪明而贤孝

周转:可获得强大资金

买卖:进取得利，并获得巨财

等人:女者会来，男者不一定会来

寻人:见于西南方或南方

失物:动作快，可以寻回来.似是在地上的箱子之类藏着.

外出:克服犹豫心理，大胆前进，可无往而不顺

考试:科甲登榜

诉讼:最终能圆满解决

求事:受人提拔，可有成就

改行:可行

开业:吉利`,
    `问时运:正值好运刚来，犹如朝阳初现，逐渐升高，光明普照。吉。

问征战:值大军刚刚出发，顺路前进。应该在白天作战，不应该在夜里进攻。

问经商:最有利的是煤炭地火等生意，取它们光明之象。吉。

问功名:有功名指日高升之象，吉。

问讼事:应该返身自我诉讼。

问家宅:住宅朝东南，高大宽敞明亮，有吉星太阳的照临，大吉。

问胎孕:生女孩。

问失物:在明堂中寻找，得到

初爻

问时运:目前好运刚来，虽然没有灾昝，但也没到兴盛的时候，应该从容等待。吉。

问征战:初次行军，兵众的心没有安定，应该宽容等待。吉。

问经商:货物刚到，行情不理想，应该等待时日。早则四天，迟则四个月，到四爻所谓“众允”时，货物可以畅销，必定大获利益。

问功名:功名固然属于本来有的，只是不能预知迟早罢了，应该宽心等待。

问家宅:住宅本来吉祥，一时不能入住，是由于双方情志没有沟通好。缓一步必定成就。

问婚姻:因为探听的结果不确切，迟缓一步可以成就。

问失物:日后可以得到。

问疾病:应该宽缓调养，可以痊愈。

问胎孕:生女孩

二爻

问时运:目前不是气运不好，只是所求多有阻碍，心中未免忧郁。只要能持守正道而不变，最终必定亨通而得到大利。

问征战:前一次的进攻既遭到摧折，现在再前进，未免特别忧愁和畏惧。但临事的时候能畏惧，以后必定获吉。六二与六五相应，六五爻辰在卯，在天上值氐、房、心、尾四宿。氐宿前面的两颗大星主后妃，所以取象为王母。向它祈祷就会得福。

问经商:因为以前贩运的货物已经折本，现在未免怀有愁闷，所以说“晋如愁如”。必须以中正自守，到五爻说“失得勿恤，往吉，无不利”。这是劝人不必忧愁，会自然获得福庆。

问功名:现在虽然忧愁，但是到五爻说“往有庆”，二年后可以获吉。

问婚姻:吉，但目前不成，必须等到第三年才成。应当有祖母为此作主。

问家宅:应当迁居，与祖母同住同食，吉。

问失物:久后可以得到。

问胎孕:生女孩

三爻

问时运:目前灾悔已经过去，大众心悦诚服，所以吉。

问经商:开始时被人摧折，无法获利；现在众人和睦，可以无咎，卖买都有利。

问征战:众志成城，作战必定胜利，进攻必定克敌，上行不会后悔。

问功名:要得到众人的推举才行。

问家宅:主眷属和睦，吉。

问婚姻:两姓和谐，吉。

问讼事:有第三人出面处理，双方都会应允和服从，没有悔恨。

问胎孕:生女孩

四爻

问时运:气运有蹊跷，应该以光明正大的态度来处置。倘若首鼠两端，喜欢狡诈，结果必定凶险

问征战:晋卦彖辞说“昼日三接”，有人认为“接”即“捷”，即一个白天就得到三次胜利。倘若多疑而又贪鄙，像鼫鼠那样昼伏夜出，那就危险了。

问功名:爻辞说“鼠”，鼠五种技能都很拙劣，一定无法得志。

问经商:鼠性贪婪，贪婪的人没有不失败的。要防止因为同伙的贪财而失败。

问家宅:鼠是穴居的动物，善于盗窃。住宅鼠多必定主耗失，不利。

问疾病:《诗经》说“鼠思泣血”，或许有呕血的病症；又说“瘤忧以痒”，或许有疥疮，这也很危险。

问讼事:首鼠两端，又要退却又要前行，一时无法决定。

问行人:白昼潜伏而夜里行路，一定有特别的原因。一时不能归来。

问失物:已经进入鼠穴，无法再得到。

问婚姻:鼠主鼠窃，主婚姻不正当。

问胎孕:生女孩

五爻

问时运:目前正当盛运，灾祸远去，福祉到来，有获得而无损失，大吉。

问征战:转败为胜就在这一战，奋勇前去，立刻就会成功。

问经商:以前有小的损失，现在可以有大的收益，吉。

问功名:不必汲汲于求名，可以在无意中得到。吉。

问家宅:日出于东方，离卦位于南方，住宅必定朝向东南。从前略有灾悔，现在屋运已经转变，吉，没有不利。

问婚姻:以九五为男方家，以六二为女方家，两爻都吉，非常有利。

问讼事:说“悔亡”，指灾害已经过去。停止诉讼，吉。

问失物:去寻找，一定会得到。

问胎孕:生女孩

上爻

问时运:目前好运即将告终，要防止有事故，但无大害。

问征战:只可以就近征讨国内，不可远去攻伐海外。危险，但最终吉祥。

问经商:防止与同行有纷争。事情虽然危险，货物却有利，只是在人情上未免鄙吝，幸而没有灾祸。

问功名:晋即进，角在头上，有首选之象。功名成就以后，防止有从军作战。吉

问家宅:居住者与乡党有纷争，未免不安，但没有大问题。

问婚姻:上爻与三爻相应，象征男女两家。开始有纷扰，最终得以和谐，所以“悔亡”与三爻相同。

问讼事:《雀角》一诗，用来讽刺诉讼，中止诉讼就吉。

问胎孕:生女孩`
]
const GUA_EXTRA_36 = [
    `明夷:利艰贞.

彖曰:明入地中，明夷.内文明而外柔顺，以蒙大难，文王以之.利艰贞，晦其明也，内难而能正其志，箕子以之

象曰:明入地中，明夷；君子以莅众，用晦而明

初九:明夷于飞，垂其翼.君子于行，三日不食，有攸往，主人有言象曰"君子于行，义不食也"

六二:明夷，夷于左股，用拯马壮，吉.象曰"六二之吉，顺以则也"

九三:明夷于南狩，得其大首，不可疾贞.象曰"南狩之志，乃大得也"

六四:入于左腹，获明夷之心，出于门庭.象曰"入于左腹，获心意也"

六五:箕子之明夷，利贞.象曰"箕子之贞，明不可息也"

上六:不明晦，初登于天，后入于地.象曰"初登于天，照四国也.后入于地失则也"`,
    `这个卦是异卦（下离上坤）相叠.离为明，坤为顺；离为日；坤为地.日没入地，光明受损，前途不明，环境困难，宜遵时养晦，坚守正道，外愚内慧韬光养晦.

大象:太阳掩没在坤地之下，大地黑暗，有失明之象

运势:百事阻滞，小人加害，遇事多迷惑，宜守，静待时机而动.

事业:处于不利的环境，宜心境坦然地处置险恶的条件，增强心理素质，承受各种压力.表面柔顺小心，内心洞察事理，当离去则离去，避免灾祸，脱离危险.防患于未然，坚持逆境中奋斗

经商:认真观察市场动态，待机行动，但须坚持商业道德，即使处于不利情况下，也要冒险向前，特别是要向南方发展，会大有收获.

求名:内心保持大志，行动刻苦忍耐，奋斗于逆境，自守其志，收敛聪明而不外露，于混乱中更应坚持正义，藏拙守愚

婚恋:必须全面分析对方情况，不能因小失大.注意大节

决策:处在不佳的状况下，环境困难，前途不明.但若能坦处厄运，能伸能屈，前景会变光明.尤其应加强修养，隐忍行志，外愚内慧，可以遇难呈祥.如能谨慎行事，处处小心，更能有所作为.`,
    `明夷，表示火入坑中，阳气被阴气所伤害，被小人所重伤，主大凶象.诸事不宜，运背之时

解释:浑沌不明

特性:朋友多，心慈，重友谊，喜追求高层次的境界，理智和感情常矛盾.有时会牺牲一切，去完成自己的理想

运势:逆势下降，时运未济，万事劳苦，逢小人加害，光明受到掩蔽而失光明，所以多艰难之运也.有万事阻滞，遇事迷惑，受灾.故宜守贞固之道，忍耐自重，等待时机

家运:衰弱，多劳，家人受累，恐有诈欺，官符.须知邪恶之人定有因果，凡事心地坦荡可渡难关也

疾病:凶象.为潜伏已久之疾，注意心脏，腹部之疾或神经病

胎孕:产母有惊

子女:受子女牵连，陷于痛苦深渊之中

周转:不成

买卖:难成，用谋方就

等人:不来

寻人:西南或南方，虽在附近但难寻

失物:不能立即寻回.正当要遗忘这件事时，会意外地有所发现

外出:最好不要马上行动，再等待一个时期，做好充分准备

考试:无望

诉讼:败象，宜和解了事，愈争愈苦

求事:日下无希望，须再待时，需防被骗，失财，失身

改行:不利

开业:不宜亦不成事`,
    `问时运:值大难的气运，应该深自晦藏。

问征战:《象传》说“莅众”，正值用兵的时候。应该效法明修栈道，暗度陈仓的计策，必定得胜

问以商:卦象艰难，大众恐怕难以取利，但暗中还有分肥的机会。

问功名:离火被土所克，功名无法显达，显达反而有灾害。

问家宅:家道不顺，或许父子分居，还可以保全。

问婚姻:一定不是明媒正娶。

问疾病:是肝火内郁的病症，应该用熄火的办法治疗。

问讼事:应该忍受委屈而停止诉讼，这样可以免祸。

问胎孕:生女孩

初爻

问时运:开始气运不好，但因为善于自我保全，得以无害。

问征战:军营中粮食已经吃尽，应该暂时退却。

问经商:明夷，恐怕资本有折损。运货远行，有中途受难之象，又恐怕主人啧有烦言。

问功名:于飞垂翼，明白显示了不能腾达之象。

问婚姻:初爻与四爻相应，反倒相害，婚姻不成

问家宅:住宅必定是租赁的，而不是自己的，所以有主人“三日不食”，有灶台破损而无法做饭之象。不利，应该迁移。

问胎孕:生女孩

二爻

问时运:目前运势不太好，有伤残之象，幸而得到禄马相救，所以吉祥。

问征战:左营的军队不利，幸而马队得力，所以转败为胜，

问经商:不适合时宜的策划叫左计，可知经营谋略不合时宜，所以有损失；幸而有姓马的人出面调剂，这才导致吉祥。

问功名:官职下降叫左迁，似乎不利，只有值午年或交午运才吉

问疾病:离卦二爻中虚，像陷进去的样子，这人必定陷入深坑，伤了左足；幸而马健壮，得以一跃而出，受了伤也吉祥。

问家宅:必定是左边的柱脚受了损伤，应该赶快修整。

问婚姻:离卦为阴象，女子恐怕有足部的疾病，不利于行走。适宜匹配午命人，吉。

问胎孕:生女孩

三爻

问时运:大运有破败，适宜退守；交冬令的时候从南方出行，必定得到大的利益

问征战:卦名叫明夷，明说进兵必定有伤亡和失败，应该用暗兵从南方进入。离卦上爻说“王用出征，有嘉折首”，正合于这一占断。

问功名:南方属文明，猎取禽兽与猎取功名都期望有所得。“大首”指魁首，一定会荣膺首选吧？所以说“志大得也

问婚姻:婚礼上的送雁与射雀，也取“从禽”之象。“得其大首”，指得到好的配偶，吉

问疾病:应当出门到南方躲避，吉

问失物:可以到宅南寻找，一定得到。

问胎孕:生女孩。

问家宅:住宅离位南向。“大首”，指一乡当中的大富人家

四爻

问时运:爻象出离光明而进入黑暗，可知时运不利。不应该居家，而应该出门。

问征战:可以潜入敌人的左营探听密谋，然后告诉大营，可以得胜，

问功名:功名以高升为吉。“入于左腹”，坤为腹，为入地，不吉。

问经商:《释名》认为，腹是复和富的意思。入于腹即入于富，获心即称心。“于出门庭”，是出门经商之象。

问疾病:病在心腹，恐怕是内部受损的病症，应该出门求医。

问家宅:住宅明堂左首的道路有阻碍，出入不便。

问婚姻:女子腹中已经有孕，不利。

问胎孕:生女孩

五爻

问时运:目前正在困厄中，只要不失正道，久后必定亨通。

问征战:主帅不明达，以致有谋士逃亡的现象。

问经商:一定要历经艰苦，才能获利。

问功名:时事日益艰难，不应该进取，只应该退守。

问家宅:主亲族不和。

问疾病:防止有发狂的病症。

问婚姻:应该中止婚事。

问讼事:一时无法得理，久后自然明白。

问胎孕:生女孩

上爻

问时运:开始的运虽然好，后来的运却不佳。凡事应当作退一步想，这样才能无咎。

问功名:应该晦藏心志，隐遁形迹，不宜自我炫耀才华。

问经商:货价初次太贵，末后太贱，显然有天渊的差别，应该得到二者的平均值。

问征战:防止在攻山夺险时坠入深渊。

问婚姻:有先富后贫的嫌疑。

问家宅:住宅面对高山，后临深渊，地势过于低陷。

问疾病:开始患气冲，后来又下泄，难治。

问胎孕:生女孩`
]
const GUA_EXTRA_37 = [
    `家人:利女贞

彖曰:家人，女正位乎内，男正位乎外，男女正，天地之大义也.家人有严君焉，父母之谓也.父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正；正家而天下定矣

象曰:风自火出，家人；君子以言有物，而行有恒

初九:闲有家，悔亡.象曰"闲有家，志未变也"

六二:无攸遂，在中馈，贞吉.象曰"六二之吉，顺以巽也"

九三:家人嗃，悔厉吉；妇子嘻嘻，终吝.象曰"家人嗃嗃，未失也；妇子嘻嘻失家节也"

六四:富家，大吉.象曰"富家大吉，顺在位也"

九五:王假有家，勿恤吉.象曰"王假有家，交相爱也"

上九:有孚威如，终吉.象曰"威如之吉，反身之谓也"`,
    `这个卦是异卦（下离上巽）相叠.离为火；巽为风.火使热气上升，成为风.一切事物皆应以内在为本，然后伸延到外.发生于内，形成于外.喻先治家而后治天下，家道正，天下安乐.

大象:风吹火之象，助火之威，喻家人同心协力，发展事业.

运势:平安大吉，与人合作则易成，更有喜庆之象，如添丁婚嫁等.

事业:成功与否取决于家庭的情况.严格治家，防止“后院”起火出现意外事故，这是事业成功的先决条件.夫妇和睦，共同合作，必可脱贫致富.事业应由内而外，循序渐进，持之以恒，而后必有所成

经商:以治家方式用于商业活动.对待公司员工应严宽结合，以严为主.宜集中领导，主事一人，共同合作，日积月累.

求名:以勤苦努力和安贫乐道为主，更应有家庭的支持.家道兴盛的同时，个人的事业也就容易成功

婚恋:和睦的家庭，是一切的基础，而妻子又是家道的根本.择妻应慎重和乐兴家.

决策:因好的家庭和妻子的支持而顺利成功，务必保持这种优势，否则，由盛转衰在顷刻之间.尤其应预防家庭变故.持家重在谦和待人，勤俭积蓄以致富.亲人相互和睦，友好.`,
    `家人，表示同为一家人，主小吉之象.事事以家人为重之意，如事业投资均需一家人合作共事为佳.感情，为成家之吉象

解释:家人离散吉中带凶.

特性:为人热忱，待人谦恭有礼貌，善交际，外表积极内心保守喜家庭生活，爱小孩小动物

运势:平安无事，且有喜事之象，与家人共事者大利.

家运:万事畅达如意，和乐之象

疾病:注意心脏或胆病，必须小心调理

胎孕:不碍

子女:儿女孝顺

周转:难调，但可成，宜找自家亲人为佳.谨守诚信可无阻

买卖:有超值的利益可得，交易可成

等人:自来，且有吉事相告

寻人:因赌气出走，不久便见

失物:出现.隐藏在家中.可能是被家人收起来了

外出:在家千日好，外出一时难，准备充分后再行动

考试:上榜有名

诉讼:虽产生大疑虑，若行事合理则无碍

求事:有良好机会，勿失

改行:勿急

开业:开业者可照计划而行，吉利也`,
    `问时运:风得到火会更加狂野，火得到风会更加炽烈，正是时运全盛的时候。但涉入于邪恶就邪恶，涉入于善良就善良，言行之间，最应该加以勉励

问经商:《尔雅》说，“风与火为庉”，是聚的意思，有屯聚货物之象。爻辞说“有物”“有恒”，物是货物，恒是恒久，指货物不可急于销售，过后可以获得高价

问功名:风行于远方，火性炎上，有高升远到之象。言行是出于自身、加于百姓的东西，功名一定成就。

问家宅:防止有火灾

问婚姻:家人一卦取象于夫妇，离火巽风都象征女子，这或许是长女为姊，中女为娣之象，或许是两姓相对缔结的亲缘。吉。

问疾病:是风火上升，痰多气喘的病症，一时无法治疗。

问胎孕:生女孩

初爻

问时运:目前好运刚来，正应当知道自我检束，这样才能没有灾祸和悔恨。

问征战:在行军的开始，应该步伐整齐，号令严明，这样才能有胜无败。

问经商:是初次贩运，应该恪守商规。

问功名:是初次求名，要遵守法纪，不可任凭个人意志而往上爬。

问家宅:住宅墙围坚固，门庭整肃而和睦，治家的人有条理，有规则，约束详细而明白。到四年后可以致富。

问疾病:病属于初起，应该自己谨慎保养，这样必定没有灾害。开始如果不治疗，病症必将发生变化，那时就难治了。

问婚姻:初订姻缘，知道对方家风清白，闺门一向谨严，可以成功。

问讼事:刚诉讼就中止，这样才吉。

问胎孕:是第一胎，生女孩

二爻

问时运:目前正值盛大的气运，但爻象阴爻阴位，只适宜因人成事，不能独断独行。

问征战:这是偏将，一定不是主帅；或者是在后营，主管粮食和军饷的。职责最要紧，谨慎防备，不要有过失。

问经商:想是贩运粮食的生意。吉。

问功名:难以如愿。

问家宅:住宅朝南，宅主一定是妇人，对家里的事不能自作主张。只有灶台最吉祥。

问疾病:幸而胃口强健，可以无害。

问胎孕:生女孩

三爻

问时运:运限平平，终究以自我勉励为贵。严谨刻苦，不怕辛劳，一定获得吉祥；倘若一味取乐，必将一事无成。

问征战:号令严明，全军敬服，纵使不免杀戮过分，所向却自然能够成功。

问经商:想是外面作商店，里面作住家。内外整肃而和睦，家政严明，店规谨饬，才能获得吉祥；否则，过于和悦而流于荒淫，必将有鄙吝的事要防止。

问功名:爻象专主适宜家居，功名的谋求还要暂缓一时。

问家宅:这宅中家规严肃，吉

问婚姻:九三的应爻在上九，上九说“有孚”，可知两姓相从，吉。

问疾病:九三属离，为火，应该进用凉剂，即使危险也可以痊愈。

问失物:赶快严格查问，可以得到；倘若宽容迟缓，就永远失去了

问胎孕:生女孩

四爻

问时运:目前正值盛运，已富的能保有家室，未富的马上发财，是大吉之象。

问征战:国富兵强，粮饷充足，可进可退，吉，没有不利。

问经商:“利市三倍”，立刻就能致富，其吉祥可以预知

问功名:官职与钱财常相反，往往必须破财才能成名。

问家宅:一定是巨室阀阅人家，大吉

问讼事:钱财可以通神，事情没有不能了结的。

问疾病:一定是身体肥胖，膏粱过度所致，用药就会痊愈。

问胎孕:生女孩

五爻

问时运:好运来了，福气到了，人心自然感通，何必忧虑不吉？

问征战:王者的军队，所向无敌，吉。

问经商:想来这一商业一定是奉公家的命令而办，或者是贡献品物，属于王家的事业。吉。

问功名:恰如姜太公在渭水垂钓，有梦中感通之象，吉

问家宅:住宅想来是公卿的巨大宅邸。吉

问疾病:人身以心为君，五爻居巽木，一定是肝木太强而生风，心火生热。应该用熄火定风的药，使心气开通，可以不必忧虑，吉。

问婚姻:有选入宫帏之象。

问胎孕:生女孩

上爻

问时运:得到别人的信服和敬畏，事情没有不成功的，前往没有不利，可以行于近处，也可走向远方，凡事都吉。十年好运，过了这时就会终结。

问征战:行军之道，有信义别人就不欺负，有威严别人就不轻慢。赏罚无私，号令必行，是王者之师，所以吉。

问经商:有信义，可以托付许多金钱；有威严，所有的事情都可以办好。这是真正的商道。

问功名:上爻处在极位，必定是身居上位，信义早已感孚，威望一向昭著的大人。

问家宅:住宅地势一定高，为一乡所瞩望。吉。

问婚姻:两姓应允而相从，吉。

问胎孕:生女孩`
]
const GUA_EXTRA_38 = [
    `睽小事吉

彖曰:睽，火动而上，泽动而下；二女同居，其志不同行；说而丽乎明，柔进而上行，得中而应乎刚；是以小事吉.天地睽，而其事同也；男女睽，而其志通也；万物睽，而其事类也；睽之时用大矣哉！

象曰:上火下泽，睽；君子以同而异

初九:悔亡，丧马勿逐，自复；见恶人无咎.象曰"见恶人，以辟咎也"

九二:遇主于巷，无咎.象曰"遇主于巷，未失道也"

六三:见舆曳，其牛掣，其人天且劓，无初有终.象曰"见舆曳，位不当也无初有终遇刚也"

九四:睽孤，遇元夫，交孚，厉无咎.象曰"交孚无咎，志行也"

六五:悔亡，厥宗噬肤，往何咎.象曰"厥宗噬肤，往有庆也"

上九:睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧，匪寇婚媾，往遇雨则吉.象曰"遇雨之吉，群疑亡也"`,
    `这个卦是异卦（下兑上离）相叠离为火"兑为泽上火下泽，相违不相济.克则生，往复无空.万物有所不同，必有所异，相互矛盾.睽即矛盾"

大象:离火向上，兑泽则向下，一上一下，两相乖违，又二女同居，不得正之象.

运势:气运欠佳，诸事难成，有水火不容之象，宜处变不惊.

事业事业开创闲难，外境艰辛，如能志同道合，相互信任，目的可以达到但起初成功的多是小事小事积累可成大事事成于协力合作,败于众志相异应加强团结,委曲以求相通.最忌内 部相互猜疑，

经商:应以心平气和的态度投入市场竞争，求大同而存小异对竞争对手不应敌视，可和而不流，群而不党.尤其不能惹起纠，纷,极力避免灾祸.

求名:以真诚的心努力上进对于恶人必要时亦不可完全不交往应采取宽大包容的态度，适度往来对志同道合者也不必完全一致，可异中求同，

婚恋:双方必真诚相待.否则，第三者极易介入，夫妻相疑则家破.

决策:处于矛盾，对应状态必须注意以宽宏大度，平和，柔顺的态度对待人生这样才能心平气和，柔而上进.认清合必有离，离必有合；同中有异，异中有同的道理.否则刚极暴躁，明极生疑.暴疑皆可致命.`,
    `睽，表示乖危，叛逆，背离之象，主凶象.意见不合，彼此争斗，任性，不协调.事事均不顺，且有被出卖的危险，注意犯小人

解释:防小人

特性:经常事与愿违，个性敏锐，理想化，感情与理智容易矛盾冲突，易生孤独感，宜往专技艺术发展.

运势:水火不相容，则气运不通，势行低落，诸事难成.凡事有违叛之时，若能处变不惊，不逞强出头，尚可转危为安.有家内不和，亲友疏散之情.宜力持温和，忍耐去克服困难，始可渡危.

家运:困苦离亲之象，不和睦之情.家运衰颓，虽可得小利，但也济不敷出.

疾病:轻症宜速就医，重症则危，更防断症错误，注意心脏，寒热失调之症.

胎孕:无碍.

子女:子女不和，有骨肉无情之不幸，且其子女六亲缘薄无靠周转难以如愿

买卖:多阻碍，难成，若成者亦必损

等人:不会来

寻人:因口角负气出走，其志不同故不易寻

失物:不能找回有失窃的可能

外出:顺利.途中可以得到善人相助

考试:落榜.

诉讼:宜速求和解，迟则理屈辞穷

求事:无希望

改行:不宜

开业:不利`,
    `问时运:目前气运颠倒，只适宜以正道自处。

问征战:军情不相协调，上下级趋向各异，应该防止因睽违而离散。

问功名:上下不通，功名难以指望

问经商:货价涨落悬殊，若能人弃我取，还有小利可以希望。

问疾病:病在上下焦，胸部气息隔绝，上有火下有湿，医治很棘手

问家宅:住宅天盘地盘都动，全家上下不利，应当赶快迁移躲避。

问婚姻:有两个女子都愿意受聘之象，大的性情躁急，小的性情宽柔，应该选择一个婚娶。

问讼事:马上可以停止。

问胎孕:生女孩

初爻

问时运:好运刚来，灾祸和悔恨已经退去。虽然有所丧失，但是不必计较；即使有恶人来结交也不必拒绝，自然无灾无祸。

问征战:初次作战，虽然有小的失败，后来必定大胜，强敌也无法为害于我。没有灾祸

问经商:新的贸易，损失必定复得，无须忧虑；来者不拒，不必计较。目前还没有得到大利，以后必定大为亨通。

问功名:现在虽然无灾无悔，但是无法成名。必须等到明年，即二爻的巷遇的时候，才能显达。

问家宅:全宅平顺，没有悔恨和灾祸。

问失物:不必寻觅就会复得

问婚姻:现在不成，等六个月或六年必定成，吉。应验在上九“匪寇婚媾”的爻辞。

问讼事:所争讼的事情必定得理，没有灾祸。

问胎孕:生女孩

二爻

问时运:值遇乖睽的卦，时运本来不佳，最近才有了绝好的际遇，前往必定有喜庆。

问征战:以二五两爻为敌我，二爻为我军，五爻为敌军，在曲折的里巷相遇，白刃相接。这一战不分胜负。

问经商:“巷”字从“共”，必是合伙共谋的事业。应当遇到一位财主共同经营。

问功名:正是风云际会的时候

问家宅:住宅在曲折的巷内，近来有贵人到来，会晤很快乐，大吉

问疾病:得以遇到良医，没有灾祸。

问婚姻:《诗经》所吟咏的“邂逅相遇，适我愿兮”，属于男女私情，不是正当婚配。

问胎孕:生女孩

三爻

问时运:时运不得当，恐怕有刑伤的灾厄，三年以后才会有好运。

问经商:与人不和睦，不但无法获利，而且要防止有刑狱的灾厄。等以后可以成就

问功名:左右掣肘，一动就得咎，怎么能成名？晚运则很好。

问征战:车丢马逃，兵败将死，无法前进。必须等待，得力于接应的军队，才会最终得胜。

问婚姻:开始因为男方家的疑忌，未免受辱，但最终得以消除疑虑而完婚。

问家宅:住宅位置不当，前后左右都有牵制，宅中的人不时发生头面伤残的灾祸。因为朝山向午，离火来克，应该改向朝西，兑位才吉

问疾病:一定是脸上有疮，久后自然痊愈。

问讼事:不免有受刑的厄难，但最后讼事会自然消解。

问失物:以后可以寻得

问胎孕:生女孩，防止面部有伤痕

四爻

问时运:性情孤傲耿介，不合时宜，幸而得到了志同道合的人，足以免除灾祸。

问征战:孤军深入，几乎导致危险和失败；幸而得救，可以无咎。

问经商:孤身为客而远行，货物却不合销路，进退两难；遇到故乡的旧友才可以脱售。平安，没有灾祸。

问功名:命运孤独贫寒，难以指望显达，无咎罢了。

问家宅:住宅在孤村僻壤，只有樵夫野老来往。

问疾病:病是眼病，遇到良医可以无咎。

问胎孕:生女孩

五爻

问时运:坏运已经退去，得以与同宗的人共事，可以无咎。

问征战:可以踊跃前去，没有灾祸。

问经商:防止有合伙人侵夺蚕食的忧思，但径直前去，终究有利。

问功名:得到同宗的相助，才能获得吉庆。

问家宅:住宅是宗族的旧屋，居住有喜庆。

问疾病:是肌肤的疾病，容易治疗。

问婚姻:二爻与五爻为正应，是亲戚旧家，成婚则有喜庆。

问胎孕:生女孩

上爻

问时运:正值交运脱运的时候，一定要息心宁虑，不动妄想。妄想只有一端，幻象却有百端，要防止生疑心病。

问征战:营寨位置太高，军队力量太孤单，要防止有敌兵来袭击。

问经商:目前的货物，价格变化百出，涨落不定。时值盛夏，来客稀少，必须等到秋雨降落，才能获利。

问功名:现在牛鬼蛇神变动不一，等十年后出离蹇卦，进入解卦，可以在乡试中考中举人。

问婚姻:以前因为疑忌而不和睦，后来得以和好。吉。

问家宅:住宅有变动，防止有鬼祟，遇到婚嫁喜事，可以化解。

问疾病:杯弓蛇影，因疑心而成病，能破除疑虑，自会霍然痊愈。

问胎孕:生女孩`
]
const GUA_EXTRA_39 = [
    `蹇:利西南，不利东北；利见大人，贞吉

彖曰:蹇，难也，险在前也.见险而能止，知矣哉！塞利西南，往得中也"不利东北，其道穷也.利见大人，往有功也.当位贞吉，以正邦也蹇之时用大矣哉！"

象曰:山上有水，蹇；君子以反身修德

初六:往蹇，来誉.象曰"往蹇来誉，宜待也"

六二:王臣蹇蹇，匪躬之故.象曰"王臣蹇蹇，终无尤也"

九三:往蹇来反.象曰"往蹇来反，内喜之也"

六四:往蹇来连.象曰"往蹇来连，当位实也"

九五:大蹇朋来.象曰"大蹇朋来，以中节也"

上六:往蹇来硕，吉；利见大人.象曰"往蹇来硕，志在内也.利见大人，以从贵也"`,
    `这个卦是异卦（下艮上坎）相叠.坎为水，艮为山.山高水深，困难重重，人生险阻，见险而止，明哲保身，可谓智慧.蹇，跋行艰难.

大象:前路险陷，后有高山，进退维谷，如跛者举步为艰

运势:多灾多难，进退两难，此时宜守正道，不可轻举妄动，动反招祸.

事业:诸事开头难，坚持下去，会有好的结果.人生不易，首先得求诸自己，修德养性.志高自信，奋勇进取.逢到困难，得求友人相助，行动不可冒险，必以柔克刚，待机候时，量力而行

经商:逐步起业，冒险行事，自寻苦恼.宜加强商业道德，真诚同他人合作，陷入困境时，不得见死不救，而应奋不顾身.联合行动，可活跃于市场竞争之中.

求名:循序渐进，加强自身修道.居静观动，待变，俟机而动，能进则进.内心坦然，不可为追逐名利而冒险.与贤能结合，追随高人，必能转危为安.

婚恋:不很顺利，不得急，宜慎重选择.但应有自知之明

决策:艰难不利.但可视为考验.奋进向前，充满信心，切勿自寻苦恼，交结贤人，相互帮助，坚守中正之道，可遇难呈祥，结得善果.`,
    `蹇，表示寒足之意，主凶象，四大难卦第三卦.冰天雪地中赤足而行，表示现在处境多么的艰辛困苦，却又不能放守不管，只能硬撑到底.此时虽是无奈，但也总有苦尽甘来的时刻.人事均很为难之时，事业感情均有骑虎难下的困境

解释:跛足执行困难

特性:幻想多，重情调，喜新厌旧，有设计研发才能，追求理想化的生活，不切实际，故内心易有挫折感

运势:衰运，多灾难，进退两难之处境，要自重而不可妄动，此时应守正道待时也.凡事杂乱，更防小人之害，绝不可涉险境，否则灾害必至

家运:六亲无情，有贫困，不幸之象，运差者，其险难脱，善者宜致力克服挽救.宜注意家人有重病，血光之厄运

疾病:病重，不可疏忽医治，注意肾，胃，手部四肢损伤

胎孕:胎不安孕有灾

子女:子女手足情薄，六亲少靠，劳碌之命也周转难调，多不成也

买卖失利交易不成

等人:不会来

寻人:速报警帮寻，得贵人则可回

失物:搜索有困难阻滞而停止，不能寻回

外出:出门可能有难，利于西南行.如外出遇难，可得救助，转危为安

考试:落榜

诉讼:终必有险，更防血光.不宜起讼，动则招咎

求事:眼前毫无希望.

改行:不宜.借贷强行并非良策

开业:开业者不宜，有是非损耗之象`,
    `问时运:时运艰难，应该振作努力，这样才能脱离险难。

问征战:进入深山穷水的复杂地点，进退两难。应该率领大军努力向西南进攻，才能获得胜利。

问功名:坎为险，艮为止，功名有阻碍。返身加以努力，五年后到上爻，《象传》说“利见大人，以从贵也”，可以指望成名。

问经商:水在山上，就会蓄积而不流，有钱财与货物不流通之象，令经商者为难。

问家宅:住宅傍山，防止有山上下来的水冲坏墙屋，应该改变朝向，这样才有利。

问婚姻:山水本来互为配偶，而山低水高则失去了配偶的作用，所以有蹇难。要么不成，成了也必定反悔。

问疾病:蹇为足部的疾病，涉水登山，一定不能前往。

问失物:应该反过来从身上寻找。

问讼事:应该自我反省，停止诉讼。吉。

问行人:中途发水而被阻遏，有大的险难，以后可以空手归来。

问胎孕:生男孩

初爻

问时运:好运还没到来，应该在谨慎持守中等待。

问征战:前面有险难，不可前往，应该暂时退守。

问经商:销售处正有危难，不可贩货前去，需要暂时等待价格上升。

问功名:从军效力，无非冒险犯难，获得奖赏，所以说“来誉”。

问家宅:地点有险阻，迁居不利。

问疾病:病属于初发，不必急于求医，应该退而自己将养。

问婚姻:不必急于成就，还应该等待。吉。

问失物:缓一时可以得到。

问胎孕:生男孩

二爻

问时运:目前气运尴尬，险难重重，主自身劳碌。

问征战:防止军队进入危险的地方，自身被重重包围，有庞士元魂断落凤坡之象。

问经商:为内地运货，中途遇到大水，有人财两失的忧患。

问功名:为急于公义而求名，名虽然能够成就，身命却无法保全，只是邀得死后的荣誉罢了。

问家宅:住宅在艮山中，属于东北朝向。显然险难重重，不利。

问婚姻:二爻应五爻，主缔结尊贵的亲家；要防止以后丈夫有危难，身命难以保全。

问讼事:凶。

问行人:凶。

问失物:终究无法再得到。

问胎孕:生男孩

三爻

问时运:正值多难的时运，前进不利，不如退守。

问征战:军队出动后，有回转之象。

问经商:贩运货物，有去而又来，转销到内地之象。

问功名:改出使在外为内部使用。

问家宅:住宅后面靠山，前面临水。开始要迁移到别处，后来返回，以得以团聚为喜庆。

问婚姻:先前要嫁给别人，后来嫁给这人，可喜。

问行人:即日到来，可喜。

问失物:失而复得。

问胎孕:生男孩

四爻

问时运:运途多险难，因为能联合众人而成功。

问征战:四爻阴柔，可知军队力量单薄。能与众人同心同德，联成一气，可以脱险。

问功名:“来连”，有接连高升之象。

问经商:“来连”，指商客连续到来。说“当位实也”，实是充实，指所得利益盈满。

问家宅:住宅必定与邻屋相比连，位置相当，家道殷实。

问婚姻:必定是老亲之间结亲，重结姻缘。吉。

问疾病:这病必定绵延已久，一时无法痊愈。

问讼事:久后可以了结。

问行人:流连在外面，一时不能归来。

问胎孕:生男孩，想是双胞胎

五爻

问时运:厄运即将退去，可以逐渐转危为安。

问征战:先前已经被包围，现在幸而救兵一齐到来，得以凭一次作战而解围。

问功名:爻位接近君王，足以匡济蹇难，非常光荣。吉。

问经商:众多货物辐辏而来，一时难以销售。

问家宅:地点接近禁卫，正当车马纷纷，互相追逐的地方，防止受到冲击，以至疲惫和危难。不适宜百姓居住，可以改作会馆。

问疾病:这是危险的大病，应该聚集众多医生会诊治疗，这样才有痊愈的希望。

问胎孕:生男孩

上爻

问时运:现在大难已经过去，好运即将到来，可以出山求官了。

问征战:大军已经集结，可以作战，以突出重围。

问经商:众多商人都到来，货价大涨，就此销售可以收回本钱，也可以获得利润。

问功名:文名大振，可以“利见大人”。

问家宅:住宅位置很高，灾煞已经退去，有吉星照临，而且得到了贵人的扶助。

问婚姻:主贵。

问讼事:必须经高级法院判决，这样才能结案。

问胎孕:生男孩`
]
const GUA_EXTRA_40 = [
    `解:利西南，无所往，其来复吉.有攸往，夙吉

彖曰:解，险以动，动而免乎险，解.解利西南，往得众也.其来复吉，乃得中也.有攸往夙吉，往有功也.天地解，而雷雨作，雷雨作，而百果草木皆甲坼，解之时义大矣哉！

象曰:雷雨作解；君子以赦过宥罪

初六:无咎.象曰"刚柔之际，义无咎也"

九二:田获三狐，得黄矢，贞吉.象曰"九二贞吉，得中道也"

六三:负且乘，致寇至，贞吝.象曰"负且乘，亦可丑也，自我致戎，又谁咎也"

九四:解而拇，朋至斯孚.象曰"解而拇，未当位也"

六五:君子维有解，吉；有孚于小人.象曰"君子有解，小人退也"

上六:公用射隼，于高墉之上，获之，无不利.象曰"公用射隼，以解悖也"`,
    `这个卦是异卦（下坎上震）相叠震为雷，为动"坎为水，为险险在内，动在外，严冬天地闭塞，静极而动，万象更新，冬去春来，一切消除，是为解"

大象:春雷大作，大地解冻、喻冬去春来生机再现

运势:宜把握良机，快速处理，身边困境，更宜出外求谋，因贵人在远方，以西南为吉方.

事业:元气初复，宜休养生息，安静平易为佳，宜宽宜和，当准备就绪则应立即行动，争取主动不可拖廷，所往必有功利，但切勿贪得无厌克勤克俭,刚柔相济,以柔为主远辟小人,团结君 子，相互依托，共成事业.

经商:行动贵神速，积极而为，方可摆脱险境，行商宣循正道，切

勿招摇过市此乃思蠢行动,必自招灾祸.

求名:初出茅庐应继续充实自己，待机行动尤应远小人近君子和有才德的人，以期迅速提高自己

婚恋:应适时进行夫妻和衷共济，可家庭和睦，免除灾难.

决策:稳妥为宜，亦不应冒险，因一切尚在元气初复阶段.为争取大发展，务必宽以待人，以柔致治，广交贤者，遣散小人，以中庸，正直的方式，张驰结合的手段，开拓方兴未艾的事业.`,
    `解，表示解决之象，先苦后甜之象，冬雪春化之意.冰冻三尺非一日之寒，事出有因，但已是到该解决的尽头了！只是化解之日还很长，要抓住重点方向，好好努力坚持下去，还是有可能再成功的.

解释:解冻

特性:耐性差，爱变化，喜热闹场合，多学不精，思想兴趣不稳定，易受外界影响.一生多为他人排解事务，自己却少有他人之助

运势:顺势而行，速把握良机，坚持努力，快速处理可成.贵人在远方，有助，宜出外营谋大运在西南

家运:初有困难，但难关已过.开花结实之兆

疾病:久病可治愈，注意肝，肾，足疾

胎孕:孕安

子女:初时因子女牵累而劳苦，但其子女越长运越好，故苦后得甘，已可得到幸福

周转:速进行可成延迟不利

买卖:即速交易，可名利双收

等人:一定来

寻人:北方寻之可见

失物:遗失之物似有被支解破坏的可能，故寻回的机会不大

外出:一旦准备充分，立即行动，捷足先登必有所获

考试:题榜在望

诉讼:一般纠纷皆可解决，宜当机立断，不可拖延

求事:有贵人相助

改行:速改有利

开业:开业者有很大的展望`,
    `问时运:解脱的灾难，大有奋发振作之象

问征战:威武一振，有大贼被消灭，小贼来投降之象。

问功名:有声音的震惊达到百里，恩泽普施给亿万百姓的征兆。

问经商:得时得令，“雷雨之动满盈”，非常有利。

问婚姻:震为雷，坎为雨，阴阳相交相济，万物生机畅茂，吉。

问家宅:天盘动，地盘有难，应该通过祈祷消除灾难。

问行人:一时可以归来，防止小有灾难。无害。

问讼事:幸而被宽宥无罪。

问胎孕:生男孩

初爻

问时运:困难初步解除，安于时运，恪守本分，自然无害。

问征战:刚刚脱出重围，应该养精蓄锐，不可妄动，这样才能保证无害。

问经商:不遭受损失就算幸运了。

问功名:目前只可以谨守原有的规模罢了。

问家宅:平安无害。

问讼事:应当和解。

问婚姻:平平。

问胎孕:生男孩

二爻

问时运:除去邪恶而归于正道，自然安稳而吉祥。

问征战:田指猎取禽兽，就像战争猎获敌人一样。获狐，象征捕获了敌人的魁首；得失，象征获得敌人的兵器，所以贞吉"。

问经商:田猎的目的是猎获禽兽，经商的目的是获取利益。三表示多数，黄指黄金。必定获得厚利、吉。

问功名:说获说得，功名大有希望，吉。

问家宅:住宅要防止狐狸作崇，必须猎获它们，这样才吉。

问婚姻:必定是先有小妾，后娶正妻。黄是正色，象征正配。吉。

问疾病:防止是狐媚作祟所导致的邪病，应该用弧矢驱逐。吉。

问胎孕:生男孩

三爻

问时运:时运不是不好，只因为一向行为不端，为别人所鄙视和笑话

问征战:战端从我而开，以致盗贼蜂起，一时难以平定。

问经商:防止有盗贼劫掠的灾患

问功名:沐浴猴子，戴上帽子，这样难道能长久吗？

问家宅:自己门户不谨严，或者用人不当，而招致了窃贼或强盗。

问婚姻:两姓都不是正经人家，属于为富不仁的人，“可丑”

问讼事:双方都没有理。

问行人:满载而归，但是来路不正。

问失物:已经被窃盗掠去，得不到了。

问胎孕:生男孩

四爻

问时运:已经到了做官年龄，但是行运不得当，全靠别人帮忙成事。

问征战:防止炮弹伤害足部，幸而救兵得力，可以解围。

问经商:所得很微少，但是众人心心交孚，一两年后可以得到厚利。

问功名:拇为足趾，卑下极了。到五爻说“君子维有解”，必须等待下一科，才有希望登榜。

问家宅:住宅地势低下而不当，只可以作为行栈或店屋。

问婚姻:得到有力的媒人说合，才能成事

问讼事:有朋友出来交相劝解，可以平息诉讼。

问胎孕:生男孩

五爻

问时运:值于亨通的正运，众多邪佞全部退去。

问征战:不杀戮一个人，不用一根箭，外国人就来朝拜了。

问功名:有利于君子，不利于小人。

问经商:不必苦心经营谋划，自然会获利

问家宅:住宅有福星照临，邪魔远远地避开。

问婚姻:吉。

问行人:马上归来。

问疾病:外来的邪气已经消散，本身的正气已经复来，吉。

问讼事:理直的胜诉了，理亏的服从了，就可以停讼了。

问胎孕:生男孩

上爻

问时运:运途吉祥顺利，出外或许会遇到小的贼寇，应该迅速加以防备。

问征战:防止有敌兵劫掠城外，应该在高阜上埋伏弓矢手射击他们，必定有斩获。

问经商:运货外出，必须严格防范盗贼的劫掠，这样不但没有损失，而且可以获得盗贼的粮食，所以说“无不利”。

问功名:爻辞称公，必定已经贵显。应当在外面立功。

问家宅:墉墙要高，可以防备外面的窃贼。

问婚姻:《诗经》说“戈凫与雁”，有射击之象，吉。

问讼事:悖逆自然解除，有利。

问胎孕:生男孩`
]
const GUA_EXTRA_41 = [
    `损:有孚，元吉，无咎，可贞，利有攸往？曷之用，二篇可用享

彖曰:损，损下益上，其道上行.损而有孚，元吉，无咎，可贞，利有攸往.曷之用？二簋可用享；二簋应有时.损刚益柔有时，损益盈虚，与时偕行.

象曰:山下有泽，损；君子以惩忿窒欲

初九:已事遄往，无咎，酌损之.象曰"已事遄往，尚合志也"

九二:利贞，征凶，弗损益之.象曰"九二利贞，中以为志也"

六三:三人行，则损一人；一人行，则得其友.象曰"一人行，三则疑也"

六四:损其疾，使遄有喜，无咎.象曰"损其疾，亦可喜也"

六五:或益之，十朋之龟弗克违，元吉.象曰"六五元吉，自上佑也"

上九:弗损益之，无咎，贞吉，利有攸往，得臣无家.象曰"弗损益之大得志也"`,
    `这个卦是异卦（下兑上艮）相叠.艮为山；兑为泽.上山下泽，大泽浸蚀山根.损益相间，损中有益，益中有损.二者之间，不可不慎重对待.损下益上，治理国家，过度会损伤国基.应损则损，但必量力，适度少损而益最佳

大象:山高水深，各得其所，因损得益之象.

运势:现况诸事不顺，有破财之象，虽先损失，但后反而得益，因祸得福

事业:开拓事业必有投入.投入多少应事先精心算计，力求损益得当.诸事皆应有节度，切忌欺诈，贪婪.天下事克已最难，务严格要求自己，刻苦奋斗，手段灵活，争取事业成功

经商:全面调查市场行情，计算投入和收益的比例.不必过于计较利润的多少，获利即可.真诚与他人合作，彼此信任，手段灵活，切勿自我封闭

求名:为了成长进步，务必有所投入，且应付诸实践.以损增益，成就理想

婚恋:全面权衡对方的长处与短处.大处着眼

决策:为人聪颖，善于权衡利弊.顺应自然发展规律，积极主动与他人合作，助人为乐，适度投入，资助他人，而自己要宁俭勿奢.如此，诸事都可以十分顺利`,
    `损，表示小有损失也，主凶中带吉之象.赛翁失马，焉之非福是此卦最好的解释.投资，事业，借贷，感情皆是失意不顺之时，然对事要有信心，学得经验将可得到更好的结果.若将要投资则不可

解释:有所损害，损失

特性:心地善良，富同情心，悲天悯人，体贴他人，善于照顾，安慰别人.牺牲小我，完成大我精神，生活节俭，大方助人

运势:诸事不如意，若倾于利欲不当之心则有灾，散财之损.必须能够悟其所损，方能挽回局势.与人共事商量则可收损失之象

家运:正处于受损之时，审慎挽救颓势也

疾病:现况病情虽重，积极治疗可愈.身体较衰弱，注意肠胃，咽喉，贫血等疾

胎孕:产母有凶象

子女:儿女多诚实孝顺，幸福之格

周转:可达目的

买卖:虽有损，但终得利.

等人:可能会迟到

寻人:在东北或西方友人家中，可寻.否则会自回

失物:不能寻回

外出:有益可行.注意节省费用，防止损多于益

考试:多努力，榜上可题名

诉讼:有斗争之象，损失破财，和解反而获益

求事:可慢慢受重用.

改行:可行，勿急躁，宜周密行事

开业:吉利，宜有耐力.`,
    ``
]
const GUA_EXTRA_42 = [
    `益:利有攸往利涉大川

彖曰:益，损上益下，民说无疆，自上下下，其道大光.利有攸往，中正有庆.利涉大川，木道乃行.益动而巽，日进无疆.天施地生，其益无方凡益之道，与时偕行

象曰:风雷，益；君子以见善则迁，有过则改

初九:利用为大作，元吉，无咎.象曰"元吉无咎，下不厚事也"

六二:或益之，十朋之龟弗克违，永贞吉.王用享于帝，吉.象曰"或益之，自外来也"

六三:益之用凶事，无咎.有孚中行，告公用圭.象曰"益用凶事，固有之也"

六四:中行，告公从.利用为依迁国.象曰"告公从，以益志也"

九五:有孚惠心，勿问元吉.有孚惠我德.象曰"有孚惠心，勿问之矣惠我德大得志也"

上九:莫益之，或击之，立心勿恒，凶.象曰"莫益之，偏辞也.或击之，自外来也"`,
    `这个卦是异卦（下震上巽）相叠巽为风"震为雷，风雷激荡，其势愈强,雷愈响,风雷相助互长,交相助益此卦与损卦相反,它是 损上以益下，后者是损下以益上二卦阐述的是损益的原则"

大象:强风配快需，声威增长之象，长男配长女，夫妇合体，增益

运势:现正当吉运，可得贵人之助而成功，宜施惠于人施比受更有福.

儿孙之象.

事业:大胆投入，勇于支持他人事业，必相得益彰勇敢前进，敢作敢为只要心地善良，纯洁，谦虚，事业必定与日俱增，前程无可限量，助人宜即时，要在应急开拓事业，内部团结一致，人心

所向，树立恒心不怕冒险犯难

经商:勿追求小利，让利于顾客，反而必获丰厚利润，切忌贪心利回报，并且获得支持，事业必成.

不足，在遇到危险时应向他人求教，争取诚实的援助，

求名:真心实意地施志于他人，自己必然可以得到诚心诚意的

婚恋:相亲相爱，良缘天定.

决策:心胸开阔，乐于助人人际关系好，得到众人的支持自己贵在树立恒心，克服三心二餐，尤其要向比自己优秀的人学习，借助对方的力量，充实和发展自己树立必要的冒险精神平日要施善于人因此，即使遇到危险也会得到他人救助.`,
    `益，表示利益，好处，是由上对下的一种好的给予，主吉象，对事业投资都有相当的帮助，可得贵人来相助，扶持

解释:有利益有好处

特性:重大我，轻小我，热心公益，爱热闹场合，团体事务协调工作.对自己的生活要求少，在朋友口碑中不错

运势:乘盛吉之运，可得他人之助而诸事顺畅，家业有成.大致吉利之运也

家运:有喜悦之象，发达之意

疾病:可治愈，提防肝胆，肠胃之疾，或性病等.

胎孕:胎有不安

子女:得家人之喜爱，天真顽皮

周转:可成

买卖:可得大利

等人:迟来因有好事相告

寻人:难逢，防有害.若出走者会自回

失物:有望可寻回

外出:有利可获.大胆外出行动

考试:成绩优良，父母有喜悦之象

诉讼:有牢狱之灾，或事因女人，房地产引起，宜和解

求事:大好时机，勿错过

改行:有利

开业:开业者则大有利图`,
    ``
]
const GUA_EXTRA_43 = [
    `央:扬于王庭，孚号，有厉，告自邑，不利即戎，利有攸往

彖曰:夫，决也，刚决柔也.健而说，决而和，扬于王庭，柔乘五刚也.孚号有厉，其危乃光也.告自邑，不利即戎，所尚乃穷也.利有攸往刚长乃终也

象曰:泽上于天，夫；君子以施禄及下，居德则忌

初九:壮于前趾，往不胜为吝.象曰"不胜而往，咎也"

九二:惕号，莫夜有戎，勿恤.象曰"莫夜有戎，得中道也"

九三:壮于，有凶.君子夫夫，独行遇雨，若濡有愠，无咎.象曰"君子夬夬终无咎也"

九四:臀无肤，其行次且.牵羊悔亡，闻言不信.象曰"其行次且，位不当也.闻言不信，聪不明也"

九五:苋陆夫央，中行无咎.象曰"中行无咎，中未光也"

上六:无号，终有凶.象曰"无号之凶，终不可长也"`,
    `这个卦是异卦（下乾上兑）相叠，乾为天为健"兑为泽为悦，泽气上升，决注成雨，雨施大地，滋润万物五阳去一阴，去之不难，决（去之意)即可,故名为夬(guai),夬即决"

大象:泽水积满而泛滥成灾，滔天之势.又五阳爻之盛势必除去唯一阴爻，故一阴孤立.

运势:目前虽吉，但困难及变动正在蕴酿中，宜提高警觉，忌骄傲，防口舌是非

事业:处在兴盛阶段，但已孕育着普遍的危险务必施恩泽给他人，勿居功自傲，主动团结他人，不干冒险的事时时提高警惕，防止小人的破坏，但不可莽撞，应持和缓的手段去决断小人，避免过犹不及.

经商:市场正在走向衰落的状态，不宜大量活动，随时注意转向，开拓新领域时，加强同他人的合作，但务必充分注意别有用心的奸诈小人趁机捣乱和破坏.

求名:虚心求教，充实自身实力.但应量力而行，不可盲目自大.

更不可同小人合流，徒虚名而败坏事业，

婚恋:防止上介绍人的当，也应注意对方的目的.

决策:性格矛盾，往往表面刚强而内心虚弱，在关键的时刻，败坏事业虚心听取他人劝告，切勿鲁莽，多谋深思，用柔和的态度待人处世.`,
    `央，表示决定或缺失，是个状况卦，吉凶未定.所迟疑的事情，一定要有个决定不能再拖延，至于如何决定，可视变卦而定.否则在有所拖延就成凶象了

解释:卦相奇特，角龙升天行大运

特性:思想敏锐，有理想抱负，果决，务实主义，实事求是，不投机冒险，有孤独感，宜从事专技工作

运势:日前虽然鸿运当头，终会遇到困难与危险，凡事不可轻举妄动，宜随时警惕自己，留心意外灾害.住所可能会有变动，亦有文书，契约之失利，易生错误.慎勿傲气或自以为是，不谦和者定有灾.

家运:夕阳虽好，却近黄昏，往后有陷于惊动，痛苦之境.因此卦有盛极必反之象

疾病:病情重宜速治，防头部，呼吸系统，肿瘤等疾

胎孕:无灾.母胎宜节食物，且勿发怒气，否则有难产之虑子女有先吉后凶之象

周转:不可急踩，须诚意，光明之态度可成，否则有不利之象

买卖:须诚信交易，有失败破财之害

等人:不必等了，不会来

寻人:宜速寻找延误不利

失物:相信失物已经损坏，不能寻回

外出:不宜过于频繁，以逸待劳最佳.外出旅行吉利

考试:不理想

诉讼:不宜与人争执，因势孤力弱，宜寻求法律途径解决

求事:有困难或得不到好职位

改行:改行者要慎重考虑

开业:开业者不利，如已备妥小心难关重重`,
    ``
]
const GUA_EXTRA_44 = [
    `姤:女壮勿用取女

彖曰:姤，遇也，柔遇刚也.勿用取女，不可与长也.天地相遇，品物咸章也.刚遇中正，天下大行也.姤之时义大矣哉！

象曰:天下有风，姤；后以施命诰四方

初六:系于金柅，贞吉，有攸往，见凶，赢豕踟躅.象曰"系于金柅，柔道牵也"

九二:包有鱼，无咎，不利宾.象曰"包有鱼，义不及宾也"

九三:臀无肤，其行次且，厉，无大咎.象曰"其行次且，行未牵也"

九四:包无鱼，起凶.象曰"无鱼之凶，远民也"

九五:以杞包瓜，含章，有陨自天.象曰"九五含章，中正也.有陨自天志不舍命也"

上九:姤其角，吝，无咎.象曰"姤其角，上穷吝也"`,
    `这个卦是异卦（下巽上乾）相叠.乾为天，巽为风.天下有风，吹遍大地，阴阳交合，万物茂盛.姤（gǒu）卦与夫卦相反，互为“综卦”.姤即媾，阴阳相遇.但五阳一阴，不能长久相处

大象:风无孔不入，所吹到之处，暴露其间之物体，无一不与之相遇，为邂逅之意.

运势:阴长阳消，注意桃色纠纷，诸事阻滞，宜慎重行事

事业:合时宜，循时序.但潜在着危机，阴阳不协调.务必依附于强者，多方联系，增强势力，防止小人渔利，争取形势好转.诸事宜及早准备，等待时机，一旦成熟立刻行动

经商:市场正从红火的状态走向衰危，及早脱身为妙，强行发展有危险.无正直的人相助，却有小人在暗中盘算.对此，务必保持清醒的头脑，寻求可靠的合作伙伴，隐忍待时，以图商业活动的再发展.

求名:性格不很合群，内心自视过高，不免处于困境而不得志应投靠真诚正直的人，在其支持下成功

婚恋:严格考察对方的道德品质，避免陷入“三角”纠纷.夫妻以诚相待，可转危为安

决策:吉利.可在有利的环境中顺利发展，但决不可冒险行事，以免适得其反.其次在于随时提防身边小人的陷害.为此，在邪恶未成势之前即应制止，宁可孤立也不可与小人结伴`,
    `姤，表示邂逅，不其而遇，非预想中的事情来发生.主是个状况卦，吉凶未定.逅，会带来意外之喜，也会带来意外之灾，需视动爻变卦吉凶来论断.而姤意，卜感情通常是有其他的感情发生的迹象，与情色非常有关系

解释:二女争一男

特性:杞人忧天，虎头蛇尾，易感伤，有艺术美学之天分，较理想化.

运势:阴长阳衰，男人谨防因色受祸，诸事不如意，不能上进，沉于女色之凶象也.凡事进取宜慎重

家运:家运渐衰，不祥之兆.有女人口舌，亦有感情之因，损财之运.

疾病:病情重，有恶化情况，注意泌尿生殖系统，胸肺科病.

胎孕:孕无碍.然须注意子女均有品性不良之趋向

子女:子女多有志行不坚定，给父母亲增加麻烦，不幸之象，难管教也.

周转:有意外阻挠，难调，另谋他法为宜

买卖:不能如意，受奸诈之害而导致失败也

等人:女方会来，男方不一定会来，因为途中遇到别的女人之故.

寻人:会在意想不到的地方相遇.寻人不易，西北方

失物:尽快寻找，可失而得.失物似被重重物件压在最底部

外出:有困难，虽无大灾祸，但无人相助

考试:不理想

诉讼:提防桃色纠纷，是非谣言拨弄

求事:难成

改行:不利

开业:不宜，强行必受小人之害`,
    ``
]
const GUA_EXTRA_45 = [
    `萃:亨.王假有庙，利见大人，亨，利贞.用大牲吉，利有攸往

彖曰:萃，聚也；顺以说，刚中而应，故聚也.王假有庙，致孝享也利见大人亨，聚以正也.用大牲吉，利有攸往，顺天命也.观其所聚，而天地万物之情可见矣.

象曰:泽上於地，萃；君子以除戎器，戒不虞

初六:有孚不终，乃乱乃萃，若号一握为笑，勿恤，往无咎.象曰"乃乱乃萃，其志乱也"

六二:引吉，无咎，孚乃利用.象曰"引吉无咎，中未变也"

六三:萃如，嗟如，无攸利，往无咎，小吝.象曰"往无咎，上巽也"

九四:大吉，无咎.象曰"大吉无咎，位不当也"

九五:萃有位，无咎.匪孚，元永贞，悔亡.象曰"萃有位，志未光也"

上六:赍咨涕洟，无咎.象曰"赍咨涕洟，未安上也"`,
    `这个卦是异卦相叠（下坤上兑）.坤为地，为顺；兑为泽，为水.泽泛滥淹没大地，人众多相互斗争，危机必四伏，务必顺天任贤，未雨绸缪，柔顺而又和悦，彼此相得益彰，安居乐业.萃，聚集，团结.

大象:泽在地上，水聚于泥土中，滋养草木，生长茂盛

运势:吉运昌盛，又得长辈提携，事业大利，但须防财务纠纷.

事业:兴旺发达，团结和睦.正在蒸蒸日上，但水多泛滥，人多竞争必然激烈.盛则必衰，切勿骄傲，谨慎小心为好.但也不得犹豫不决，宜勇往直前，开拓新的业务.务以高尚的品德服众.

经商:真诚合作，团结互助.鼓励是事业兴旺发达的标志.大胆开拓市场，稳妥前进，有备无患，必可取得不断发展.

求名:光靠个人努力，建树不会很大，定要取得他人的帮助，加上个人的条件方可达到理想的境界.

婚恋:勿急于求成，相亲相爱，美满幸福

决策:善于团结他人共同合作，具有领导才能.但心胸宽阔，眼光务必远大，以诚信，中正为本，不失原则，尤其要严格要求自己，宽容他人，遭到他人反对时，应认真反省自己，得出教训，以这种心境处世为人，终生可平安，事业必通达`,
    `萃，表示精华聚集之意，主吉中带小凶之状况卦.有经过挑选或是在因缘际会下，而重新再一起共事的意义

解释:人才聚集

特性:富同情心，慈悲心，被动，略消极，乏耐性，博学不专.人缘佳，易有情爱困扰

运势:昌隆，得信于人，承上辈照顾，事业吉昌，但宜小心财务上的纠纷

家运:家庭融洽如意.防财务歧见之意外

疾病:凶象，宜速诊治，防胸腹及咽喉之病变

胎孕:胎安.然产母病多，注意保养身体

子女:手足相敬如宾

周转:可得到上辈支持

买卖:可获利

等人:一定会来，且有佳音相告

寻人:会自己回来，不用担心

失物:多半能失而复得

外出:出行虽可能遇到小麻烦，但不要害怕，应以大局为重，积极行动

考试:常保佳绩

诉讼:宜解不宜结

求事:可顺利，有成就

改行:吉利

开业:开业适时，可按计划进行`,
    ``
]
const GUA_EXTRA_46 = [
    `升:元亨，用见大人，勿恤，南征吉

彖曰:柔以时升，巽而顺，刚中而应，是以大亨.用见大人，勿恤；有庆也.南征吉，志行也

象曰:地中生木，升；君子以顺德，积小以高大

初六:允升，大吉.象曰"允升大吉，上合志也"

九二:孚乃利用，无咎.象曰"九二之孚，有喜也"

九三:升虚邑.象曰"升虚邑，无所疑也"

六四:王用亨于岐山，吉无咎.象曰"王用亨于岐山，顺事也"

六五:贞吉，升阶.象曰"贞吉升阶，大得志也"

上六:冥升，利于不息之贞.象曰"冥升在上，消不富也"`,
    `这个卦是异卦相叠（下巽上坤）.坤为地，为顺；巽为木，为逊.大地生长树木，逐的成长，日渐高大成材，喻事业步步高升，前程远大，故名“升”

大象:树木从地上不断向上，有进升之势

运势:名利双收，发展开运之象，宜向南方发展

事业:十分顺利，不断发展，依时而进，逐步上升，前程远大，但应逐步发展，切莫因顺利而冒进.谨慎小心，修养德行，追随有德行的前辈，真诚对待事业

经商:遵守商业道德，从小处着手，逐渐开拓，通过自己的勤劳，真诚竞争，稳重为好，切莫冒失而成大错

求名:努力学习，加强修养，以自己的聪明才智，必能得志，若有人引荐，前途更为广阔.但应注意节制

婚恋:双方以诚相待，逐步培养情感，一定可以成功

决策:如意随愿.聪明，灵活，具有良好的成功基础，严格要求自己，谦虚和顺，虚心向长辈求教，逐步，稳健地发展自己的事业将犹如树木的成长，终于会成栋梁之才.但在成长过程中，务必处处谨慎，坚持真诚和正直，大胆前进`,
    `升，表示一种情势有如乘风而起，会越来越旺.树木从地上不断向上有进升之势

解释:逐渐高升

特性:有计划安排自己的人生，做事考虑周详，待人谦和，追求新的知识.喜欢多彩人生，重生活品味

运势:诸事向上发展，开运之象，南方有吉庆，可名利双收也

家运:渐进而升至繁荣，积小以成大之吉运

疾病:病情重，注意腹部，胆管之疾

胎孕:不宜修造动土，修造必犯产母

子女:子女渐有成功之象，可贺

周转:勿太过急可成

买卖:多有利，应于亥卯日.

等人:迟到

寻人:动身则见，但恐自身有阻，与他人同去可，宜向北方.会自己回来.

失物:不易寻回，失物有被束之高阁的可能

外出:十分顺利，尤其是南行，不会有灾祸

考试:进步，进取有利

诉讼:宜持平和态度处理，可争取主动，胜算在握

求事:有利

改行:吉利

开业:吉利渐渐获利`,
    ``
]
const GUA_EXTRA_47 = [
    `困:亨，贞，大人吉，无咎，有言不信

彖曰:困，刚掩也.险以说，困而不失其所，亨；其唯君子乎？贞大人吉，以刚中也.有言不信，尚口乃穷也.

象曰:泽无水，困；君子以致命遂志

初六:臀困于株木，入于幽谷，三岁不见.象曰"入于幽谷，幽不明也"

九二:困于酒食，朱绂方来，利用亨祀，征凶，无咎.象曰"困于酒食，中有庆也"

六三:困于石，据于蒺藜，入于其宫，不见其妻，凶.象曰"据于蒺藜，乘刚也.入于其宫，不见其妻，不祥也"

九四:来徐徐，困于金车，吝，有终.象曰"来徐徐，志在下也.虽不当位，有与也"

九五:则刖，困于赤绂，乃徐有说，利用祭祀.象曰"劓刖，志未得也.乃徐有说以中直也.利用祭祀受福也"

上六:困于葛藟，于卼，曰动悔.有悔，征吉.象曰"困于葛藟，未当也动悔有悔吉行也"`,
    `这个卦是异卦（下坎上兑）相叠.兑为阴为泽喻悦；坎为阳为水喻险.泽水困，陷入困境，才智难以施展，仍坚守正道，自得其乐，必可成事摆脱困境.

大象:水在泽下，万物不生，喻君子困穷，小人滥盈之象

运势:诸事不如意，所谓龙游浅水遭虾戏

事业:境况十分不佳，遭受到很大的困难.人生面临巨大的考验，如采取不正当的手段，会愈陷愈深.相反，如身陷困逆境地而不失节操，自勉自坚，泰然处之.不失其志.终能成事

经商:面临激烈竞争，很有破产的可能.切勿失望，而应在困境中奋斗.为此，只能靠平日加强修养.认真反省自己的行为，总结教训，重新奋起，但也不宜浮躁，应缓慢而进.同时，更要警惕因致富发财，得意忘形而陷入新的困境

求名:欲速则不达.应以谦虚的态度，缓慢前进，尤应有坚定的志向，唯有志才能促成事业的成功

婚恋:以乐观态度冷静处理，尤应注重人品

决策:聪明智慧，但怀才不遇.若不因困境而失去信心，坚持努力上进，放弃侥幸心理，锲而不舍，虽不一定能守全实现自己的理想但终会有所成.`,
    `困，表示很大的困难被困住了，主大凶象，四大难卦第四卦.四处无援，最困难之时.事事很难再有进展.只好静待时机，是此时最好的选择.

解释:被困住.

特性:不满足感，不喜平淡生活，生活过于理想化，爱变化.自立自强，辛勤工作，善于用脑工作，不适合领导工作

运势:不如意，被小人欺，劳而无功，破损之灾.一事难成，运衰也宜守己待时

家运:家庭之主有屈于下风，被内助压迫者，亦常生反弹，吵架滋生.为黑暗时期，宜忍辱负重，期待黎明到来.若不谨守正道者，有失和，破兆也

疾病:危重之象，注意口腔咽喉，泌尿系统，甚至性病.

胎孕:胎安.将来劳碌命格

子女:劳苦之命，但行为端正者，终可得福也

周转:求人不如求己，凡事需量入为出.若为女色破财，当然求助无门

买卖:不能如愿，有挫折

等人:受到阻碍，不来或迟到

寻人:途中可遇，来者自来也.

失物:不能寻回

外出:困难多，慎重考虑

考试:不理想

诉讼:凡事不宜过于执着，防牢狱之灾

求事:不得时亦不得意再待时机

改行:不宜

开业:开业者须再待时`,
    ``
]
const GUA_EXTRA_48 = [
    `井:改邑不改井，无丧无得，往来井井.汔至，亦未繘井，赢其瓶，凶.

彖曰:巽乎水而上水，井；井养而不穷也.改邑不改井，乃以刚中也.汔至亦未繘井，未有功也.赢其瓶，是以凶也.

象曰:木上有水，井；君子以劳民劝相

初六:井泥不食，旧井无禽.象曰"井泥不食，下也.旧井无禽，时舍也"

九二:井谷射鲋，瓮敝漏.象曰"井谷射鲋，无与也"

九三:井渫不食，为我民恻，可用汲，王明，并受其福.象曰"井渫不食，行恻也.求王明，受福也"

六四:井甃，无咎.象曰"井甃无咎，修井也"

九五:井冽，寒泉食.象曰"寒泉之食，中正也"

上六:井收勿幕，有孚无吉.象曰"元吉在上，大成也"`,
    `这个卦是异卦（下巽上坎）相叠坎为水；巽为木树木得水而蓬勃生长人靠水井生活，水井由人挖掘而成.相互为养，井以水养人，经久不竭，人应取此德而勤劳自勉.

大象:水被植物吸收，滋养树身又象征汲器入井取水，有节约重覆之意

运势:并为静物，不能移动，故凡事不能进取主动，又缺乏冲劲不如外之泰然更有利.

事业:处于平稳状态既不宜贸然前进，也不必后退，而应以积极的态度努力进修，提高自己，充实个人实力，待机而起，将大有成就，最怕的是停顿不前，否则将会因不合时宜而被淘汰

经商:市场情况良好，可继续按照原来的方针同时，继续本若勤劳，奋进的精神，诚心诚意地开拓市场，特别注意与人的合

作，相互协助，在实践活动中丰富和积累经验，

求名:本着正当的目的，为社会做贡献，因此而努力学习应特别注意向贤德的人求教，以便被发现而受到推荐.

婚恋:不必过急，会有般配的伴侣

决策:聪明，机敏，乐于助人同时，也会有机会充分施展个人的才能，只要能学习“水井”的精神，真诚奉献，不断丰富自己的才能，一定会受到社会的重视.`,
    `井，表示小水之源，有格局小却能过活之心态，主小吉象.井水虽不能种植，畜养，却能养人度日，显示心力之有限，不能做太大的计划.也另表示视野没有很宽广，比较短视，保守心态重.

解释:井底之蛙

特性:积极，主动，创新，改革，反应快，口才佳，组织能力强，有领导才能贵人多助，社会名誉佳

运势:缺乏衡力，因井为静而不能移之物.故凡事已无法进取，不如守之泰然

家运:诸事宜心平气和处理，守其井水，供来往人用，为守旧之义诸事宜防有变.

疾病:病情较重且拖延，可能复发

胎孕:宜防有不成之兆.防产母有灾，作福祈保可平安

子女:儿女有顺良之象，宜防血光

周转:无望再待时另调

买卖:尚可，但不可大作为.小交易有利

等人:迟来

寻人:东南或北方可寻

失物:不能寻回

外出:没有十分的必要和充分的把握不可随意出行

考试:尚可

诉讼:有刑罚之象，且受人牵连，及防房地产之诉讼

求事:安于本份，换新的工作也是小工作

改行:不利守之尚可

开业:开业者不宜，此卦有破损之象`,
    ``
]
const GUA_EXTRA_49 = [
    `革:己日乃孚，元亨利贞，悔亡

彖曰:革，水火相息，二女同居，其志不相得，日革.己日乃孚；革而信也.文明以说，大亨以正，革而当，其悔乃亡.天地革而四时成汤武革命，顺乎天而应乎人，革之时义大矣哉！

象曰:泽中有火革；君子以治历明时

初九:巩用黄牛，不可以有为也

六二:己日乃革之，征吉，无咎.象曰"己日革之，行有嘉也"

九三:征凶，贞厉，革言三就，有孚.象曰"革言三就，又何之矣"

九四:悔亡，有孚改命，吉.象曰"改命之吉，信志也"

九五:大人虎变，未占有孚.象曰"大人虎变，其文炳也"

上六:君子豹变，小人革面，征凶，居贞吉.象曰"君子豹变，其文蔚也.小人革面，顺以从君也"`,
    `这个卦是异卦（下离上兑）相叠，离为火，兑为泽，泽内有水，水在上而下浇，火在下而上升.火旺水干；水大火熄二者相生亦相克，必然出现变革，变革是宇宙的基本规律.

大象:兑为金，被离火所烧，变革之象.

运势:凡事均在变动之中，宜去旧立新，以应革新之象.

事业:正处在转折的关键时刻，必须密切注意各种信息，认真思考首先巩固自己的地位，完善个人的行为.时机成熟后，立即行动，积极进行变革.但应注意动机纯正，手段正当，不保守也，不妄进，事业必定发达

经商:市场竞争十分激烈，为了立于不败之地，一定要敢于大胆求新，适时改变自己的经营方向，受到挫败，马上总结经验，重新奋起，拓展商业活动注意竞争方式.

求名:首先要努力提高自己，完善个人的学识和品德，同时，服

从上级指挥搞好工作二者的关系一定要得到妥善处理

婚恋:可能会出现一些节外生枝的麻烦事，应冷静处理，感情专

决策:十分吉利顺利，以自己的聪明才智，顺应形势，根据时代特点依理而动，变革渐合时宜的事物，壮大自己的事业.但应谨慎，时机不成熟不可妄动，尤忌急功近利.行动之前应三思而行.`,
    `革，表示该改革，革新之时候了.主是个状况卦，吉凶未定.事事情况虽不稳定，明朗，但只要有心改变，重新再来则成功机会大.一切不可固执不化，不变通

解释:革旧布新

特性:性急，反传统，爱改变现象，创新事物，旅行，变换工作，口齿伶俐.

运势:不稳定，多变化之际，凡事均有所变动，故需弃腐朽而立新者，宜下决心改革.但仍须谨慎改革之道，善改则吉，恶改则凶.

家运:多事之秋.慎重改变自己的生活方式，方能建立新的气象

疾病:病情多变，宜改换求医方法，注意心脏，眼目和咽喉之疾.

胎孕:胎安

子女:子女与母亲有缘薄之象

周转:要即时改变方针

买卖:改变经营方式为宜

等人:因中途变卦不会来

寻人:速改变方向，向西，南方寻找

失物:因有弃旧迎新之意故相信不能寻回

外出:十分顺利，积极活动，扩大人际关系

考试:越来越好

诉讼:要改变旧有对策，才可圆满解决

求事:不可守旧，改变职事有利之时机也.宜速把握良机

改行:大吉大利

开业:大吉大利`,
    ``
]
const GUA_EXTRA_50 = [
    `鼎:元吉亨

彖曰:鼎，象也.以木巽火，亨饪也.圣人亨以享上帝，而大亨以养圣贤.巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨.象曰"木上有火，鼎；君子以正位凝命"

初六:鼎颠趾，利出否，得妾以其子，无咎.象曰"鼎颠趾，未悖也.利出否以从贵也"

九二:鼎有实，我仇有疾，不我能即，吉.象曰"鼎有实，慎所之也我仇有疾终无尤也"

九三:鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉.象曰"鼎耳革失其义也"

九四:鼎折足，覆公□，其形渥，凶.象曰"覆公束，信如何也"

六五:鼎黄耳金铉，利贞.象曰"鼎黄耳，中以为实也"

上九:鼎玉铉，大吉，无不利.象曰"玉铉在上，刚柔节也"`,
    `这个卦是异卦（下巽上离）相叠燃木煮食，化生为熟除旧布新的意思鼎为重宝大器，三足稳重之象.煮食，喻食物充足，不再，有闲难和闲扰，在此基础上宜变革，发展事业

善之意.

大象:木之上有离火，为燃炊烹饪之象，鼎有去旧立新，改过迁

运势:时运仍佳，事业可成，但诸事不宜迟滞，及防有诉讼之累.

事业:具备开拓事业的各种条件耳聪目明，头脑冷静，应以端正的态度去为人处世，严于律已，慎终如始，刚柔兼备，与有才

经商:经过一番奋斗，已经可以比较顺利地发展自己的商业活动，遇到困难也能够克服，如果坚持商业道德，参与正常竞争活动，无轻举妄动和邪用，刚中自守，商业可大发展，但若不量入

德的人合作，勿妄进失度，无往不利.

为出坐吃山空必购业.

求名:首先应实德积识，严于律已，不陷入与他人的怨仇之中，

柔而上行，循序渐进.得到知人者的善用，更是前途广大.渐

婚恋:个人条件比较理想，顺利，但勿不切合实际，

决策:天资聪颖，反应敏捷，头脑灵活，具备随机应变，随时应变和随势应变的能力，因此，前程远大，即使暂时不受重视，无出，路也无防，最终可实现抱负.`,
    `鼎，表示三足而立，三人而行，平稳之势.另表拜神，礼佛的香炉主吉象.事业投资应与人合伙为佳，诸事可在平稳中发展.唯对感情，婚姻略有凶象，出现三人行的机率很高，有外遇出轨的迹象.只是大家会很理智的来寻求解决

解释:极为旺盛

特性:因人成事，得利于他人之助，多有长辈照顾提拔.交游广阔，喜欢热闹，人多之处更能表现其才能

运势:能解决困难，取得事物之稳定而名利双收，会有不错的成就，最好新找外人来共事，合伙

家运:生平幸福之运，吉也

疾病:病情有变，但无大碍，为胆石，心脏，消化系统病

胎孕:不安，不久便产.男女将来皆豪杰，母宜保

子女:子女均才能出众，将成大功立大业之趋势也

周转:可成

买卖:有大利可得

等人:一定会来

寻人:南方或东南方.不必操心，会自己回来

失物:过一段时间后可寻回，惟已变形

外出:无重大事情不宜外出.为发展事业外出顺利

考试:登科上榜

诉讼:由小事引起，宜和解了事

求事:大利有上辈提拔

改行:有得天独厚的条件，速进行

开业:吉利通达之象`,
    ``
]
const GUA_EXTRA_51 = [
    `震:亨.震来就，笑言哑哑.震惊百里，不丧匕鬯

彖曰:震，亨.震来就，恐致福也.笑言哑哑，后有则也.震惊百里，惊远而惧迩也.出可以守宗庙社稷，以为祭主也

象曰:洊雷，震；君子以恐惧修身

初九:震来虩虩，后笑言哑哑，吉.象曰"震来虩虩，恐致福也.笑言哑哑后有则也"

六二:震来厉，亿丧贝，跻于九陵，勿逐，七日得.象曰"震来厉，乘刚也"

六三:震苏苏，震行无皆.象曰"震苏苏，位不当也"

九四:震遂泥.象曰:震遂泥，未光也"

六五:震往来厉，亿无丧，有事.象曰"震往来厉，危行也.其事在中大无丧也"

上六:震索索，视矍矍，征凶.震不于其躬，于其邻，无咎.婚媾有言.象曰"震索索，未得中也.虽凶无咎，畏邻戒也"`,
    `这个卦是同卦（下震上震）相叠.震为雷，两震相叠，反响巨大，可消除沉闷之气，亨通畅达.平日应居安思危，怀恐惧心理，不敢有所怠慢，遇到突发事变，也能安然自若，谈笑如常.

大象:重雷发向，千里传声，有惊无险之象，亦有变动之意

运势:表面昌盛风光，内里正处多事之秋，动荡不安之境

事业:处于不顺利，甚至面临危险的局面，对此务必提高警惕有备方可无患，一旦出现突发事件，可以泰然处之，并且可以由此引吸取教训，一方面使损失减少，另一方面可以迅速复原，使事业迈上新的高度

经商:在激烈的商场竞争中，随时可能出现问题，陷入困境.冷静，从容地应付到来的现实，坚持不偏不激的中正原则，以刚毅的态度，从容不迫地去战胜困难.经过一番危机后，一定可以获得巨大利益

求名:很可能会遭到挫折.不必灰心，而应自我反省，找出问题的症结所在

婚恋:恋爱和家庭都可能出现变故，应以冷静态度处理，会有理想的结果

决策:处于人生的转折关头.应正确地总结过去，为开拓新的事业奠定基础.在前进的道路上应随时心怀恐惧，勤勤恳恳，坚持正确原则，在困难中前进，命运亨通`,
    `雷，表示奋发，震动有冲动不安稳的现象.六冲纯卦，主大好大坏之卦象.此卦要注意意外血光，有被惊吓之情形发生，运动比赛可为吉论.雷通常表示，声势浩大，却是有声无形虚象之意与人交往最忌此卦，表面热心却只是虚应一番，无诚心，不能用真诚来对待，否则会很失望

解释:受惊，害怕

特性:心直口快，喜怒形于色，缺乏耐性，工作不稳定，爱变化，理财能力差，自立自强

运势:表面似盛泰，但正处于多事之秋，宜慎重，勿自视过高，无益也.有动荡，不安，惊惧之象耳

家运:家中常有变动惊惧，不平等，多争吵，影响家运进展，宜审慎处理家务事也.

疾病:注意肝，神经系统，足疾，病情反覆

胎孕:临产妇得之无碍

子女:子女多有性刚者，但皆争气，奋发，并有少年劳苦老来福之象有成有福

周转:抱持可有可无之心态，因此卦有被反悔之象

买卖:不可有始无终，否则难成

等人:会来而且会提早到

寻人:此人临时起意而出走，但亦会马上回来

失物:可能是受某些事惊吓而遣失，令你惊惶失措，尝试于会发声的东西或电器处寻找

外出:大胆出行，不必理会小的灾祸

考试:可榜登科甲

诉讼:反覆难平，宜收敛脾气，心平气和

求事:不利

改行:改行吉利，为变动之时机也

开业:吉利，可依计划而行`,
    ``
]
const GUA_EXTRA_52 = [
    `艮:艮其背，不获其身，行其庭，不见其人，无咎

彖曰:艮，止也.时止则止，时行则行，动静不失其时，其道光明.艮其止，止其所也.上下敌应，不相与也.是以不获其身，行其庭不见其人，无咎也.

象曰:兼山，艮；君子以思不出其位

初六:艮其趾，无咎，利永贞.象曰"艮其趾，未失正也"

六二:艮其腓，不拯其随，其心不快.象曰"不拯其随，未退听也"

九三:艮其限，列其夤，厉薰心.象曰"艮其限，危薰心也"

六四:艮其身，无咎.象曰"艮其身，止诸躬也"

六五:艮其辅，言有序，悔亡.象曰"艮其辅，以中正也"

上九:敦艮，吉.象曰"敦艮之吉，以厚终也"`,
    `这个卦是同卦（下艮上艮）相叠.艮为山，二山相重，喻静止.它和震卦相反.高潮过后，必然出现低潮，进入事物的相对静止阶段.静止如山，宜止则止，宜行则行.行止即动和静，都不可失机应恰到好处，动静得宜，适可而止

大象:两重高山并峙，故宜止不宜进，阻塞之象.

运势:凡事不宜妄动，前路受阻，只好待机而动.

事业:在经过一段发展后，应进行调整，暂时停止行动，总结经验教训.不可因贪名利而妄进.自我克制，自我约束，谨言慎行不要盲目追求他人.经过休整后，在适当时机到来时，再大显身手.

经商:进入停滞不前的状态，切勿盲目冒进，而宜适时停止，进入安静退守，不要受外界干扰，尤其是应该保持内心和理智上的宁静，更不要轻易与他人合作.等待时机，必有光明前途

求名:应保持纯正的目的，静守正道.勿为功名诱惑，秉守忠厚可得成功.

婚恋:重感情，彼此以诚相待，可白头到老

决策:性格沉静，内向，不喜好活动，也不善于交际，为人忠诚老实，讲信义.注意听取他人的建议，明哲保身.机遇不到，不宜积极活动，该止则止，勿抱不切实际的想法`,
    `山，表示停止，退守之意，六冲纯卦，主大好大坏之象.凡事应当知进退，量力而为.有如登山越岭般，需充分审视自己的体能，和山上的情势，绝不可强行逞能，适时的休息，方能平安度过得此卦时应有大事或障碍，不顺阻挡在前，若能保守，修身养性则安，反则为凶

解释:不动自己改变

特性:耐性佳，保守经营，努力奋斗，老成持重，有偏财运，精于计划分析，处事有条理，公私分明，择善固执

运势:应当洁身自爱，依赖心不要太重，否则不利.凡事不可轻举妄动，诸事宜守，相辅得吉.儒家有言，静亦定，动亦定，此非言死等，宜中正德行，固守贞常之道，凡事有定之理也

家运:不和，家运停滞不发，改正自己以谋求开运之道，内有动荡，困境

疾病:难治，注意肠胃血管硬化及结核病胎孕难产之虞

子女:子女多有不和，不相辅之数

周转:难成

买卖:有些小是非，失利之象，但可成

等人:不会来

寻人:西南方难寻

失物:可以寻回，但要等一段时间.藏在家中，旅馆，寺院，山中某处.

外出:慎重为好，宜另择佳日

考试:落榜

诉讼:因小事而化大，宜速求和，忌土姓人

求事:固守本份为宜

改行:不利

开业:开业不宜，须再待时`,
    ``
]
const GUA_EXTRA_53 = [
    `渐女归吉利贞.

彖曰:渐之进也，女归吉也.进得位，往有功也.进以正，可以正邦也.其位刚，得中也.止而巽，动不穷也

象曰:山上有木，渐；君子以居贤德，善俗

初六:鸿渐于干，小子厉，有言，无咎.象曰"小子之厉，义无咎也"

六二:鸿渐于磐，饮食衍衍，吉.象曰"饮食衍衍，不素饱也"

九三:鸿渐于陆，夫征不复，妇孕不育，凶；利御寇.象曰"夫征不复，离群丑也.妇孕不育，失其道也.利用御寇，顺相保也"

六四:鸿渐于木，或得其桷，无咎.象曰"或得其桷，顺以巽也"

九五:鸿渐于陵，妇三岁不孕，终莫之胜，吉.象曰"终莫之胜，吉；得所愿也"

上九:鸿渐于逵，其羽可用为仪，吉.象曰"其羽可用为仪，吉；不可乱也"`,
    `这个卦是异卦（下艮上巽）相叠.艮为山，巽为木.山上有木，逐渐成长，山也随看增高，这是逐渐进步的过程，所以称渐，渐即进，渐渐前进而不急速，

大象:山上种有树木，逐渐生长，比喻循序渐进，

运势:逐渐走向光明前途，凡事宜打根基，可得吉庆，但须防色情之难及文书错失

事业在经过一个相对静止的时期后，重新开始了事业的新阶段这时最怕的是急躁冒进,务必循序上进,脚踏实地.同是注 意品德修养，以沉着，谦逊的态度对待事业，可无往而不利.

经商:正处在稳步向前发展的阶段，定要把握时机，既不可盲目乐观，也不要停步不前，而应采取逐步前进的策略，量力而行，遵守商业道德，以良好的服务，开拓市场

求名:效法树木植根山上，逐渐生长的精神在品德和学业两个方面，扎扎实实地提高自己.同时，肩负起改善社会风俗的责任.求名应以渐进为宜，切不可争进

婚恋:不可操之过急，幸福，美满，夫妻白头和谐，

决策:时来运转的时刻已经到来，切莫错过良机务必小心谨慎，渐进有益有利.以谦和的态度处世，可以得到强有力的支持，会获得重大成功.`,
    `渐，表示循序渐进，不可心急之意，主吉象.好事慢慢在进行中，一切遵循正理常规即可，事业投资均能有收益.感情婚姻，更是结果收成欢喜结局之时

解释:逐渐好转

特性:感觉细腻，思想敏锐，重品味，讲情调之人，爱追求变化的事物，口才佳.反应快，为人热心，财运丰厚

运势:逐渐顺利，光明开运之象.凡事务必掌握时机，循序渐进，可得吉庆.须防款项交易之差错及色情之灾

家运:渐曙光明，幸福之象，诸事宜以顺乎自然为吉，反则有克也.

疾病:恶化之象，注意胃，肠，背痛等

胎孕:无碍

子女:儿女多坚强笃实，态度温顺，将来有成就

周转:不成亦勿放弃，久调可成

买卖:渐进有利过急不利，欲速则不达

等人:迟到

寻人:在东南或东北二方，过些时日可寻得

失物:多数不能寻回

外出:准备充分，从容外出，一路平安

考试:会取得好成绩

诉讼:宜进不宜退，据理力争可胜

求事:可寻得良好工作

改行:吉利

开业:吉利渐有发展之象`,
    ``
]
const GUA_EXTRA_54 = [
    `归妹:征凶无攸利

彖曰:归妹，天地之大义也.天地不交，而万物不兴，归妹人之终始也.说以动，所归妹也.征凶，位不当也.无攸利，柔乘刚也

象曰:泽上有雷，归妹；君子以永终知敝

初九:归妹以娣，跛能履，征吉.象曰"归妹以娣，以恒也.跛能履吉，相承也"

九二:眇能视，利幽人之贞.象曰"利幽人之贞，未变常也"

六三:归妹以须，反归以娣.象曰"归妹以须，未当也"

九四:归妹愆期，迟归有时.象曰"愆期之志，有待而行也"

六五:帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉.象曰"帝乙归妹，不如其娣之袂良也.其位在中，以贵行也"

上六:女承筐无实，士封羊无血，无攸利.象曰"上六无实，承虚筐也"`,
    `这个卦是异卦（下兑上震）相叠震为动，为长男；兑为悦，为少女以少女从长男，产生爱慕之情，有婚姻之动，有嫁女之象，故称归妹

大象:震长男在上，兑少女在下，女必归从，归即是出嫁，但少女配长男，非正常组合.

运去:外事有违常理正道,先得其益,但随后祸事百端,

事业:正在进入新的阶段，很快将会出现另一番景象，这时首先，必须具备远大眼光，识破利弊和吉凶，有备始能无患.其次是坚

守纯正的品德和正确的原则.

经商:开拓新的市场即将成功在未来的商业活动中必须注意

经营的方向和种类，加强与他人合作，

求名:务必以坚定的决心，努力提高自己为成名立业奠定基础，最可怕是儿女情长影响了自己的前途和事业.

婚恋:顺其自然不可违背原则，尤其不可强求，宁可晚婚也要选择理想的对象.夫妻经过生活考验，可和谐到老

决策:对于人生必须坚持公正纯洁的品德，正确对待婚姻和家庭，以幸福美满的家庭为基础，开拓和发展自己的事业.`,
    `归妹，表示小妹急着先出嫁，为感情冲动，不理智之象.得此卦投资，升迁.合伙，大概与男女之间的感情用事，会有很大的关连.感情，第三者积极介入之象，或是自己一厢情愿冲动的妄想

解释:精神恍惚

特性:具有同情心，喜欢结交朋友，爱热闹，贵人运多，恋爱运早喜追求变化性工作，容易转换工作，多学不专

运势:祸出百端，事物有违常理.初时有悦，不久反凶，祸害随至

家运:外观风光幸福，其实家内正起风波，有失和，祸害等不幸情况.

疾病:病危重，极易恶化，为中风，肝病，气管及性病等

胎孕:无碍秋占不利

子女:儿女有沉于***之中者.

周转:希望渺小

买卖:表面上不错，其实亏了老本

等人:不会来

寻人:在东方或西方

失物:失物虽有被归还的可能，但自身仍有损失

外出:十分顺利，即便发生意外也会有人相助

考试:有重新再读一年之况

诉讼:事牵连于女性，宜力求和解，但我方必有损失.

求事:放弃算了，再另做打算

改行:不宜

开业:开业者宜暂停，静候时机`,
    ``
]
const GUA_EXTRA_55 = [
    `丰:亨，王假之，勿忧，宜日中

彖曰:丰，大也.明以动，故丰.王假之，尚大也.勿忧宜日中，宜照天下也.日中则昃，月盈则食，天地盈虚，与时消息，而况人於人乎？况於鬼神乎？

象曰:雷电皆至，丰；君子以折狱致刑

初九:遇其配主，虽旬无咎，往有尚.象曰"虽旬无咎，过旬灾也"

六二:丰其蔀，日中见斗，往得疑疾，有孚发若，吉.象曰"有孚发若信以发志也"

九三:丰其沛，日中见昧，折其右肱，无咎.象曰"丰其沛，不可大事也.折其右肱，终不可用也"

九四:丰其蔀，日中见斗，遇其夷主，吉.象曰"丰其，位不当也日中见斗，幽不明也.遇其夷主，吉；行也"

六五:来章，有庆誉，吉.象曰"六五之吉，有庆也"

上六:丰其屋，蔀其家，窥其户，阒其无人，三岁不见，凶.象曰"丰其屋，天际翔也.窥其户，阒其无人，自藏也"`,
    `这个卦是异卦（下离上震）相叠，电闪雷鸣，成就巨大，喻达到顶峰，如日中天.告戒；务必注意事物向相反方面发展，盛衰无常，不可不警惕

大象:雷电交加，声势壮大，又离日动于天际，普照大地，皆为盛大之象

运势:运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非损财甚至火险

事业:处于十分顺利的鼎盛时期，各方面都很顺利，成就很大但务必注意开始出现的衰败症状，防微杜渐，严防骄傲自满.同时，不必盲目追求不切实际的事情，全力保持当前状况的延长

经商:由于准确地把握了市场动态，商情对自己十分有利，可以大胆发展，但一定要密切注意行情，分析信息，稍有不慎，破产可能在一夜间.一旦破产应立即总结教训寻求真诚的合作者，早日走出困境

求名:经过努力和奋斗，已获得成就，应注意保持和稳步发展，切勿追求虚名

婚恋:可以成功，也会美满幸福，但若一方自持条件变化而动摇则会导致不利

决策:由于个人天资聪颖，条件好，因此各方面十分顺利.但务必深刻认识人生无常的真理，一切应保持适度，切记物极必反更不应自我封闭，陷入困境，切莫灰心.`,
    `丰，表示丰收之象.凡事积极奋发可成，有兴致高昂，一时天雷勾动地火，闪电迅速达成之意，此卦最利于短期投资理财，感情方面，情投意合则可速成

解释:丰富丰收

特性:随和谦虚，懒散但内心急躁，被动，拖延，须人催促，多偏财运或意外之好处，多异性之帮助

运势:运势极强，为收获之时，但不宜贪得无厌，须知足常乐，要防是非，损财甚至火险

家运:繁华幸福，但为人处事宜守分寸为要

疾病:病况重，注意肝足疾及血压，心脏等疾

胎孕:无碍

子女:对子女宜多加教养，免招不幸

周转:耐心应对，则可在短时间内达成.利在寅午未申日

买卖:正直经营可获利.贪则有失

等人:会来.亦会因故而很快离去

寻人:此人会自觉不安而自己回来

失物:尽快找寻，可失而复得

外出:十分顺利.但应提高警惕，防止乐极生悲

考试:及格有望

诉讼:自己虽势如破竹，胜券在握，但也应提高警惕

求事:有利

改行:改行不可三心二意

开业:开业者吉利`,
    ``
]
const GUA_EXTRA_56 = [
    `旅:小亨，旅贞吉

彖曰:旅，小亨，柔得中乎外，而顺乎刚，止而丽乎明，是以小亨，旅贞吉也.旅之时义大矣哉！

象曰:山上有火，旅；君子以明慎用刑，而不留狱

初六:旅琐琐，斯其所取灾.象曰"旅琐琐，志穷灾也"

六二:旅即次，怀其资，得童仆贞.象曰"得童仆贞，终无尤也"

九三:旅焚其次，丧其童仆，贞厉.象曰"旅焚其次，亦以伤矣.以旅与下，其义丧也"

九四:旅于处，得其资斧，我心不快.象曰"旅于处，未得位也.得其资斧，心未快也"

六五:射雉一矢亡，终以誉命.象曰"终以誉命，上逮也"

上九:鸟焚其巢，旅人先笑后号啕.丧牛于易，凶.象曰"以旅在上，其义焚也.丧牛于易，终莫之闻也"`,
    `这个卦是异卦（下艮上离）相叠此卦与丰卦相反，互为"综卦山中燃火，烧而不止火势不停地向前蔓延，如同途中行人，急于赶路·因而称旅卦

大象:火烧山野，火头遍布，所到之处，无一幸免，火头尤如行旅之人,无所定处.

运势:诸事变动不定，此时只好坚守信心，多参考他人意见.否则必有凶.

事业:正处于创业，发展的阶段，各种困难很多只要能坚持中正的方针，依正道办事，注意调查，处处小心谨慎，并根据情况的变化，采取应变措施，事业可顺利前进.

经商:市场行情犹如旅途一样，意想不到的情况会随时发生，因此，首先应采取慎重的原则，不要冒险.但也不应缩手缩脚，尤其不要猜疑.开发市场之前，应进行充分的调查研究.

求名:根据时代的要求，丰富自己的知识和能力，不断提高自己，并且争取得到他人的相助.

婚恋:双方的不确定因素较多，如确有感情，可顺其发展，再行确定婚姻羊满

决策:人生处于多变状态，一定要眼光远大，树立大志向，不断地充实自己，以诚心实意和谦虚的态度去待人处事，勿计较一时得失，广泛交际朋友.人生旅途十分顺利.`,
    `旅，表示旅行，不定，不安稳之意.旅行者常居无定所，表示事事皆在浮动之中，虽不现凶象，但也是很令人烦心的.投资理财，感情，婚姻，大慨都是游戏的心态吧

解释:在火山口旅游，非常危险

特性:一生多外出旅行运，喜欢多变化事物，重效率，享受，亦多桃花运，异性缘浓.兴趣广泛，爱尝试冒险

运势:诸事变动不定，此时只好坚守信心，多参考他人意见，否则必有凶

家运:内面不和，是非多，意见不一.家运衰也

疾病:病情变化不定，宜速就医

胎孕:多是夜间产

子女:骨肉无情不幸之兆

周转:小数目可大数目不成

买卖:多碍难成或交易不成

等人:临时变意不会来

寻人:此人为情所困，意志消沉而远离也，难寻

失物:尽快去找，应可寻回，失物似在屋舍之外，留意镜子之类物体可提供线索.

外出:很顺利，且经常出行.因此，要时时注意安全

考试:很差

诉讼:宜速战速决，时间一拖则不利

求事:白费心神

改行:不利

开业:开业者不得时机`,
    ``
]
const GUA_EXTRA_57 = [
    `巽:小亨，利攸往，利见大人

彖曰:重巽以申命，刚巽乎中正而志行.柔皆顺乎刚，是以小亨利有攸往利见大人

象曰:随风，巽；君子以申命行事

初六:进退，利武人之贞.象曰"进退，志疑也.利武人之贞，志治也"

九二:巽在床下.用史巫纷若，吉无咎.象曰"纷若之吉，得中也"

九三:频巽，吝.象曰"频巽之吝，志穷也"

六四:悔亡，田获三品.象曰"田获三品，有功也"

九五:贞吉悔亡，无不利.无初有终，先庚三日，后庚三日，吉.象曰"九五之吉，位正中也"

上九:巽在床下，丧其资斧，贞凶.象曰"巽在□下，上穷也.丧其资斧，正乎凶也"`,
    `这个卦是同卦（下巽上巽）相叠，巽为风，两风相重，长风不绝，无孔不入，巽义为顺.谦逊的态度和行为可无往不利

大象:此卦为两重巽风重叠，巽为入，风之所到无孔不入，尤如政令颁布深入民心.

运势:波折重重，运势起落浮沉不定，要随机应变，心平气和，择善固执

事业:正在发展中，应本着勇往直前的精神，战胜一切困难和险阻，奋发向上.万事起头难，开始会受挫折，但在有才德和有力量的人物帮助下，会有理想的结果

经商:市场竞争激烈，风险大.商业活动务必小心谨慎，遵守商业道德，以谦逊的态度对待同行和顾客，及至竞争对手，必定可以取得利益

求名:以谦逊的态度对待一切，但又不可自卑，软弱，做作，更不可虚伪，这样就可以进步很快

婚恋:不可抱轻率的态度，而应慎重，相互尊重.

决策:头脑聪明，灵活，性格开朗，以谦虚的态度处世，会受到各个方面的欢迎，也会得到上级的重视.谦虚不可过度，应以刚健中正为前提，决不可表现为懦弱和虚伪.否则，不利于自身的成长`,
    `风，表示不定之象，时柔顺，时狂暴.六冲纯卦，主大好大坏之象不易控制的局面，包括人，事，感情.投资，都是令人很难去掌控的，会有波折和变化

解释:粗暴

特性:求知欲强，喜欢追求新事物，新潮流，多外出旅行运，朋友多，财运佳，异性缘重，相识满天下

运势:此卦象征多波折，游离不定之运也.此时要处理不惊，坚定意志，万事果断而随机应变，不必一味跟从顺行.待人接物宜心平气和，则可得意外之收获.切记狂风之下必有所损

家运:家内已生风波，遵照长辈意见与指示方可渡过难关，否则动荡不安

疾病:久病则凶，且病情变化多端

胎孕:有碍宜慎

子女:养儿育女，可谓无微不至，但有孝顺恩情之子女，福也

周转:小吉大则难调

买卖:好时机，绝对有利

等人:主动约人，有结果

寻人:此人隐于附近朋友家中，好言相劝可回.大致是吵架出走，若是债务纠纷寻人者，注意发生冲突损伤.东南方位

失物:遗失在远处，不能寻回

外出:一帆风顺，十分顺利，但仍得注意安全，防止发生意外事故.

考试:宜多用功

诉讼:不易和解，但一方肯让步则易解决

求事:不能达到理想，可随机应变

改行:需看情况，但必有所变动

开业:开业可行，但勿太急，慢慢进取有利`,
    ``
]
const GUA_EXTRA_58 = [
    `兑:亨，利贞

彖曰:兑，说也.刚中而柔外，说以利贞，是以顺乎天，而应乎人.说以先民，民忘其劳；说以犯难，民忘其死；说之大，民劝矣哉！

象曰:丽泽，兑；君子以朋友讲习

初九:和兑，吉.象曰"和兑之吉，行未疑也"

九二:孚兑，吉，悔亡.象曰"孚兑之吉，信志也"

六三:来兑，凶.象曰"来兑之凶，位不当也"

九四:商兑，未宁，介疾有喜.象曰"九四之喜，有庆也"

九五:孚于剥，有厉.象曰"孚于剥，位正当也"

上六:引兑.象曰"上六引兑，未光也"`,
    `这个卦是同卦（下泽上泽）相叠.泽为水.两泽相连，两水交流，上下相和，团结一致，朋友相助，欢欣喜悦.兑为悦也.同秉刚健之德外抱柔和之姿，坚行正道，导民向上

大象:两泽相依，更得泽中映月，美景良辰，令人怡悦

运势:悲喜交集，有誉有讥，守正道，诸事尚可称意

事业:由于善长人际关系，能团结他人，获得援助.因此，各项事业都十分顺利.只要本人坚持中正之道，动机纯正，是非分明，以诚心与人和悦前途光明

经商:很有利.可以取得多种渠道的支持.但在顺利时切莫忘记谨慎小心的原则，尤其警惕上小人的当

求名:只要自己目的纯正，并有真才实学，一定可以受到多方面的热情帮助和资助达到目的

婚恋:彼此满意，成功的可能性很大.但千万不要过于坚持己见.

决策:为人聪颖，性格开朗，头脑灵活，心地善良，热心为公众服务，富有组织才能.因此，可以比较顺利地走上领导岗位.但一定要坚持中正原则，秉公办事，不得诌媚讨好上级，更不可欺压民众.永远保持谦虚品德，尤其不可过分自信，否则很容易为坏人包围.`,
    `泽，表示少女纯真喜悦之象，却在纯真之中带有娇蛮，任性的态度.六冲卦象，大好大坏.忧喜参半

解释:喜悦高兴

特性:细心，体贴，善解人意，口才佳，幽默感，宜从事公关，服务业.

运势:有喜亦有忧，有誉亦有讥，虽得吉庆如意，然应守持正道，否则犯灾

家运:有和悦之气象，但要操守自律，行事不可越轨，有分寸可得吉运.若不操守自律，必犯色情之害而受殃耳

疾病:久病则凶，注意生活检点，戒酒色

胎孕:孕安.能带给家人喜悦，又与六亲和睦，有缘.但也不要过份溺爱才是

子女:骨肉情深，和好幸福之象

周转:可顺利不须急也

买卖:有反覆之象，然尽力必成，可得大利之交易

等人:会来，且有喜讯相告

寻人:很快可知其下落.向西方寻可得

失物:遗失物似为金属或金钱，有望失而复得，但是迟一点.且多数已损毁或损失

外出:一路平安，即使遇到困难也会有人帮助，解脱困境

考试:成绩佳

诉讼:似为两个女性及金钱之事惹起，宜有和事老出面调解

求事:得利，但亦不可太大意

改行:吉利

开业:吉利`,
    ``
]
const GUA_EXTRA_59 = [
    `涣:亨.王假有庙，利涉大川，利贞

彖曰:涣，亨.刚来而不穷，柔得位乎外而上同.王假有庙，王乃在中也.利涉大川乘木有功也

象曰:风行水上，涣；先王以享于帝立庙

初六:用拯马壮，吉.象曰"初六之吉，顺也"

九二:涣奔其机，悔亡.象曰"涣奔其机，得愿也"

六三:涣其躬，无悔.象曰"涣其躬，志在外也"

六四:涣其群，元吉.涣有丘，匪夷所思.象曰"涣其群，元吉；光大也"

九五:涣汗其大号，涣王居，无咎.象曰"王居无咎，正位也"

上九:涣其血，去逖出，无咎.象曰"涣其血，远害也"`,
    `这个卦是异卦（下坎上巽）相叠.风在水上行，推波助澜，四方流溢.涣，水流流散之意.象征组织和人心涣散，必用积极的手段和方法克服，战胜弊端，挽救涣散，转危为安

大象:风吹在水面上，流动四散，又有春风吹散严寒，令冰雪消解.

运势:虽有忧患，但终可解困，百事亨通，忌任性散慢

事业:处于比较困难的地步，主要是因为人心不齐.要采取强有力的办法，求得安定团结.其中，最为重要的是坚持正道，秉持大公无私的精神，收入心以聚涣散

经商:市场状况混乱，方向不明.适当的冒险是完全必要的.但必须公正无私，克制私欲.争取有实力者的合作和支援也是完全有必要的

求名:必须静下心来努力学习和提高知识水平，增加才干.涣散的形势必须进行治理，这需要多方面的人才.前途是光明的，关键取决于个人的努力.

婚恋:只要双方都抱着纯正的目的，一定美满成功

决策:为了开拓事业，必须使用积极的手段，克服和战胜内部不团结的弊病.首先自己要除私心，牺牲小我，完成大我.切莫介入是非争端之中.这样，可以重新获得安定的局面.在良好的环境里，各项事业前途光明`,
    `涣，表示涣散之象，主凶象.心神不宁，精神不佳，人事向心力均已离散，有颓废不振的运势.事业，感情，婚姻根基开始有所松动.自身情绪不稳定，若能稳定情绪，定下心神，应会再恢复以往的神采风光.

解释:涣散

特性:喜追求变化，缺乏耐性，工作不稳定，理财能力差，爱旅行外出，变换住所.对朋友热心，桃花运也多.

运势:初有小损，但终可解困而心悦，凡事小心则百事亨通，任性放纵必败.

家运:起初有损，有波折且困，但可渐入佳境.

疾病:幼年体弱多病，长大后渐康，注意血液，内分泌.

胎孕:临产妇无碍.

子女:双亲百般劳苦为子女，而子女深知父母养育教导之恩，多得良好配偶，并有才艺之象.

周转:目标准确则有利，否则波折多亦难成.

买卖:虽难成，客户会再回来，但忍耐些时日可有利.

等人:不一定会来

寻人:难寻.

失物:不能寻回

外出:平安无事，水路更顺利.

考试:尚可，宜再加油.

诉讼:凡事宜大事化小，小事化无，诉讼可解.

求事:虽有挫折，但可成.宜耐心.

改行:择时视势而行，不必急于一时.

开业:开业可，初时有小挫折，勿惊.`,
    ``
]
const GUA_EXTRA_60 = [
    `节:亨.苦节不可贞

彖曰:节，亨，刚柔分，而刚得中.苦节不可贞，其道穷也.说以行 险，当位以节，中正以通.天地节而四时成，节以制度，不伤财，不 害民.

象曰:泽上有水，节；君子以制数度，议德行

初九:不出户庭，无咎.象曰"不出户庭，知通塞也"

九二:不出门庭，凶.象曰"不出门庭，失时极也"

六三:不节若，则嗟若，无咎.象曰"不节之嗟，又谁咎也"

六四:安节，亨.象曰"安节之亨，承上道也"

九五:甘节，吉；往有尚.象曰"甘节之吉，居位中也"

上六:苦节，贞凶，悔亡.象曰"苦节贞凶，其道穷也"`,
    `这个卦是异卦（下兑上坎）相叠.兑为泽，坎为水.泽有水而流有限，多必溢于泽外.因此要有节度，故称节.节卦与涣卦相反，互为综卦，交相使用.天地有节度才能常新，国家有节度才能安稳个人有节度才能完美

大象:泽为池沼，坎水在上，喻蓄积及约束水份不使流失，但水位过高则成泛滥

运势:有志不能伸，诸事必须节制，不宜过份，更要戒酒色

事业:正处在发展时期，一定要注意切勿冒进.但更不应放弃良好的机遇，只要坚持遵利守义的原则，可大胆行动.这样，事业可以继续兴旺发达.

经商:市场行情好，对自己很有利，应该努力开拓，勿失去机会.不过，头脑一定要冷静，投入应有限度，适可而止，该收则收.

求名:严格要求自己，办事知道节度，不走极端，可以通行无阻，顺利前进

婚恋:不要陷入情不自禁的地步，顺其自然会有好结果.

决策:抓住机遇，勿失良机.适当节制自己的行动，不可勉强，更不可冒险，恰如其分.一切不可拘泥，该变就变.但是，该节制的时候一定要节制.节制必须有限度，过于节制就成为苦，不会有好的结果，这叫适得其反，务必十分注意`,
    `节，表示节制之象.主是个状况卦，吉凶未定之象.卦中所现，提醒卜卦之人，事事有过于放纵之象，尤其是在金钱方面，投资理财需节制有守为安.感情则要多留意自己的言行举止，已有过份之态或对对方过于放纵之势

解释:节制节约

特性:理想高远，但与现实差距大，不过却有恒久的耐力，有志者是竟成.宽以待人，严以律己，社会声誉不错

运势:有志不能伸，诸事必须节制，不宜过份，更要戒酒色

家运:谨守做人处事的规范，则可得平安和乐之家庭

疾病:注意泌尿及消化系病变，宜速就医

胎孕:可求神保产母，否则有厄

子女:儿女多温柔孝顺.但若长辈行为不检反招破，得不偿失也.

周转:远水难救近火无望

买卖:不得时也

等人:不来或须久等

寻人:人说皆是虚言.有所藏身，不必去寻.想回来自己会回来.

失物:不能寻回

外出:大胆外出顺利

考试:须力求上进，不可怠忽

诉讼:局势僵持不下，宜让则讼可解

求事:再待时机，成功率小

改行:不宜

开业:开业宜缓图，计划周详后方可`,
    ``
]
const GUA_EXTRA_61 = [
    `中孚:豚鱼吉利涉大川利贞

彖曰:中孚，柔在内而刚得中.说而巽，孚，乃化邦也.豚鱼吉，信及豚鱼也.利涉大川，乘木舟虚也.中孚以利贞，乃应乎天也

象曰:泽上有风，中孚；君子以议狱缓死

初九:虞吉，有他不燕.象曰"初九虞吉，志未变也"

九二:鸣鹤在阴，其子和之，我有好爵，吾与尔靡之.象曰"其子和之，中心愿也"

六三:得敌，或鼓或罢，或泣或歌.象曰"可鼓或罢，位不当也"

六四:月几望，马匹亡，无咎.象曰"马匹亡，绝类上也"

九五:有孚挛如，无咎.象曰"有孚挛如，位正当也"

上九:翰音登于天，贞凶.象曰"翰音登于天，何可长也"`,
    `这个卦是异卦（下兑上巽）相叠.孚本义孵，孵卵出壳的日期非常准确，有信的意义.卦形外实内虚，喻心中诚信，所以称中孚卦这是立身处世的根本

大象:中孚为诚信意，风吹在泽水之上，泽水必相应而起波浪，为共鸣之象

运势:凡事以诚待人，以信处事则诸事皆吉，心存邪念则凶

事业:以诚实忠信的态度对待事业，获得重大的成就，发展顺利.必须继续遵循正道的原则，不可掉以轻心，也不可过分地相信人，尤其不可以孤傲的性格自我封闭.否则事业将走向失败

经商:处理得很好，符合市场的要求.小心谨慎地经营，讲究信义，优质服务，可有满意的结果，甚至冒险犯难也不会出问题

求名:必须在道德修养的基础上，刻苦学习知识和本领，不断提高自己.同时，不要惧怕困难，努力向前

婚恋:双方以诚信的态度相互对待，幸福美满

决策:以诚信为立身处世的基石，真诚待人，信守制度，坚持原则，和悦谦虚，可以战胜任何困难，即使出现了问题也可以亡羊补牢.但务必增强对人的观察能力，提高分辨是非的水平`,
    `中孚，表示诚信，实在.若为人处事一切以诚信为重，则事事皆可顺利而行

解释得人缘孚众望

特性:心地善良，富同情心，朋友多助，为人风趣，口才佳，反应快桃花运早.重罗曼蒂克情调，讲气氛感觉

运势:如三月之春花，似锦大地，与人谋事均得利.诚者，立业之本也，若存邪曲之念则破吉运，须认清善恶.得此卦诚者佳，尤利他乡财路

家运:有突发大利，平安幸福之吉象

疾病:金木交战之象，注意胸腹脾胃等病

胎孕:安

子女:父母慈且诚信，故子女必孝，忠信门第也周转不成问题

买卖:可成亦有利

等人:必定来

寻人:不寻自来

失物:可失而复得，但需要一段时间

外出:非常顺利，根据工作的需要可以经常外出

考试:必定上榜

诉讼:为突发事件，宜把握第一时间处理，迟则反凶.求事有利

改行:可按照计划行事

开业:开业者吉利，先苦后乐之象`,
    ``
]
const GUA_EXTRA_62 = [
    `小过:亨，利贞，可小事，不可大事.飞鸟遗之音，不宜上宜下，大吉.

彖曰:小过，小者过而亨也.过以利贞，与时行也.柔得中，是以小事吉也.刚失位而不中，是以不可大事也.有飞鸟之象焉，有飞鸟遗之音，不宜上宜下，大吉；上逆而下顺也

象曰:山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭

初六:飞鸟以凶.象曰"飞鸟以凶，不可如何也"

六二:过其祖，遇其妣；不及其君，遇其臣；无咎.象曰"不及其君臣不可过也"

九三:弗过防之，从或戕之，凶.象曰"从或戕之，凶如何也"

九四:无咎，弗过遇之.往厉必戒，勿用永贞.象曰"弗过遇之，位不当也.往厉必戒终不可长也"

六五:密云不雨，自我西郊，公弋取彼在穴.象曰"密云不雨，已上也"

上六:弗遇过之，飞鸟离之，凶，是谓灾眚.象曰"弗遇过之，已亢也"`,
    `这个卦是异卦（下艮上震）相叠.艮为山，震为雷，过山雷鸣，不可不畏惧.阳为大，阴为小，卦外四阴超过中二阳，故称“小过”，小有越过

大象:山上有雷，雷声虽大但被山阻隔，雷声减弱，即为小过

运势:诸事不利，宜行小事，不宜做大事，更防因小过失做成惊动惹来是非争讼

事业:行动宜谨慎小心，切勿冒险，尤其不得钻空子.但只要坚持正当的行为，可勇敢向前，努力奋斗，开拓事业.不过，一定要把握尺度，不要好高骛远，以免招致灾祸.随机应变是关键

经商:对市场行情不十分掌握，可先稍试探一下，随即收敛行为.否则会导致危险.不应大规模行动，也不必胆小怕事.稳扎稳打逐步发展

求名:应遵循中正的原则和循序渐进的道理，求得稳步前进.切勿追求虚名，更不得不顾实际情况攀高位

婚恋:应较长时间的彼此了解，不可仓促行事

决策:行动必须把握分寸，适可而止.盛时应防止办事过火，应即时收敛自己.过度将不足成事，反会招祸.一切行动都要因应变通不可固执`,
    `小过，表示有志难伸，龙困浅滩，像犯了一个小的过错般，而被处罚.事事小有不顺，有被打压的迹象，最忌冲动犯上，必因此而埋下祸端.需沉潜，忍耐一段时间才能再有发挥的机运

解释:稍有过失

特性:谦虚，敬业，主动，积极，反应快，严于律己，不断吸收新知识，学习新事物.乐于助人，勇于认错.

运势:行事不如意，宜谨守，与六亲不和之象.又忠言逆耳犯上得罪人之事，反为害己之因，故凡诸事均有枝节，苦烦，不能达志耳

家运:常生口角，有离家去外地之象

疾病:病情有恶化之象，但及时诊治则吉，防手足，肠胃之疾

胎孕:须谢灶神方可得安顺

子女:骨肉无情，兄弟不和，多劳苦之象耳周转小有望大难成

买卖:小可，大不可.因过者必有错也

等人:不来否则会迟到

寻人:只在原处逃避，当得见.如有债务之争，别找也罢，恐有过失之错

失物:不能寻回

外出:慎重考虑和做好充分准备后再外出，否则不利

考试:不理想.

诉讼:不宜各走极端，宜多沟通和解

求事:无指望

改行:不宜

开业:开业者宜再待时机，否则不利`,
    ``
]
const GUA_EXTRA_63 = [
    `既济:亨，小利贞初吉终乱

彖曰:既济，亨，小者亨也.利贞，刚柔正而位当也.初吉，柔得中也.终止则乱，其道穷也.

象曰:水在火上，既济；君子以思患而预防之

初九:曳其轮，濡其尾，无咎.象曰"曳其轮，义无咎也"

六二:妇丧其茀，勿逐，七日得.象曰"七日得，以中道也"

九三:高宗伐鬼方，三年克之，小人勿用.象曰"三年克之，惫也"

六四:繻有衣袽，终日戒.象曰"终日戒，有所疑也"

九五:东邻杀牛，不如西邻之祭，实受其福.象曰"东邻杀牛，不如西邻之时也；实受其福，吉大来也"

上六:濡其首，厉.象曰"濡其首厉，何可久也"`,
    `这个卦是异卦（下离上坎）相叠.坎为水，离为火，水火相交，水在火上，水势压倒火势，救火大功告成.既，已经；济，成也.既济就是事情已经成功，但终将发生变故

大象:坎水在离火之上，水性下注，火势上炎，水火相济.完成之意

运势:名利双收，成功之象，防物极必反，初吉后凶.

事业:处在顺利和兴旺的阶段，甚至大功已经告成.如何才能保住这种势头，是问题的关键.必须认识盛极将衰的真理，必思患预防，防微杜渐，有备可无患.同时，一定要密切注意形势，抓住有利时机，继续奋发向上，推动事业发展.

经商:由于市场形势有利，已经赚得许多.但同时也预示着危机的随时出现.因此，务必小心在意，事未到，先预防，终日提防戒惧.同时，认真观察市场的变化，随时转向，开拓新市场

求名:个人追求名利的基本条件已经具备.必须防止因此而变得僵化和保守，以致功亏一篑，半途而废.

婚恋:起初顺利，中途会出现挫折

决策:各方面条件都很好，环境又有利于成长.但因此反而会使自己满足，停止前进，甚至变得颓废，趋向没落.一定要不断刻苦努力，保持谦虚美德，常怀不安之心，防止不测事件发生`,
    `既济，表示水火阴阳调和，一时平安和乐之象.水火本相克，因一时环境或人事所影响，而暂时相安无事，但终非常久之象，必有所冲克而败

解释:已经得到利益，不可贪得无厌

特性:物质丰盛，但精神易空虚，外华内虚，交际广，知心少，心思细腻，多愁善感，喜宁静的生活

运势:功名双收.极盛之时，但须知物极必反，宜退守为吉，再进则凶.但得此卦者，皆有因一时顺利而忘本，大意失荆州，终有人不和心迷乱之象.

家运:生在富家之象，受祖上恩泽而不知珍惜者多，终而破运之兆.

疾病:短期虽有好转，但好景不常.

胎孕:不安

子女:初时幸福，长大后与双亲不和，慎之

周转:短期可成，长期无望

买卖:中途变卦不利.故初时见好就收，莫贪心拖延，否则不利.

等人:已中途折回，不必再等

寻人:若是常出走之人，小时自回，长大再出走，难寻.甚或不回

失物:应可寻回

外出:利于出行，途中需注意安全

考试:实力有，但需视考期之日吉凶而定，小吉

诉讼:有理说不清，仍须把握最有利时机争取主动，迟则反见凶

求事:济急可，不宜长久

改行:不宜

开业:开业者最好慎重考虑，因此卦象好景不常`,
    ``
]
const GUA_EXTRA_64 = [
    `未济:亨，小狐汔济，濡其尾，无攸利

彖曰:未济，亨；柔得中也.小狐汔济，未出中也.濡其尾，无攸利"不续终也.虽不当位，刚柔应也"

象曰:火在水上，未济；君子以慎辨物居方

初六:濡其尾，吝.象曰"濡其尾，亦不知极也"

九二:曳其轮，贞吉.象曰"九二贞吉，中以行正也"

六三:未济，征凶，利涉大川.象曰"未济征凶，位不当也"

九四:贞吉，悔亡，震用伐鬼方，三年有赏于大国.象曰"贞吉悔亡志行也"

六五:贞吉，无悔，君子之光，有孚，吉.象曰"君子之光，其晖吉也"

上九:有孚于饮酒，无咎，濡其首，有孚失是.象曰"饮酒濡首，亦不知节也"`,
    `这个卦是异卦（下坎上离）相叠.离为火，坎为水.火上水下，火势压倒水势，救火大功未成，故称未济.《周易》以乾坤二卦为始，以既济，未济二卦为终，充分反映了变化发展的思相，

大象:水性下注，火势向上，水火不交，阴阳不得正位，未能完成和未能成功之意.

运势:运气欠佳,但必须耐心突破难关,终可成功,有初凶后吉 之象

事业:处于最后的关键时刻，成功与否就在眼前.因此务必不可掉以轻心，自我节制非常重要，坚持到底，必要时也可能慎重地进行适度冒险，以成就事业

经商:市场处于大变动的前夕，前景如何尚不明显.这是最为艰苦的时期，头脑必冷静，切勿冒险，不可行动过度，适度节制，观，察动向，决定行动

求名:长期的努力和追求即会有结果在成败的关键时刻应泰然自若，听天由命，顺其自然.

婚恋:已经渡过了困难阶段，再慎重地加把劲，会有美满的结

决策:此卦的意思是“未完成”，表明前途无量，有充分发展的可能因此，必须坚持中正的原则，以明智，中庸，诚信，谦逊的态度，成就事业面对人生，唯有勤勤恳恳，极力尽人事，听天命，不必过分计较成功与否.`,
    `未济，表示阴阳不调和，气血不顺.人事情绪不顺应是最大的影响主因，幸好此卦会有否极泰来之变化，一切均会雨过天晴，值的等待

解释:快要获利

特性:思想高远，又缺乏耐性，神经质，情绪不稳定，内心易有冲突感，孤独感，悲观，感性.宜往艺术哲学宗教发展

运势:气运不通，诸事不能如愿，有初衰后盛之象.凡事要有耐心去突破难关，前途将大有可望.与人共谋事者，终有大利，可为之.

家运:初运不振，耐心熬过辛苦的路，可得幸福

疾病:病情不稳定，注意心肾不交，失眠，血液等病

胎孕:平安

子女:子女迟得，但终有繁荣之象，将来都能振奋家声，以慰祖德

周转:有不少困难，成败各半

买卖:初限不佳渐有好转之象

等人:虽迟到，但有吉兆

寻人:负气出走，会自己回来

失物:不能寻回

外出:积极行动，十分有利.

考试:不错有好成绩

诉讼:宜拖延时间，日久可得贵人之助，和解了事

求事:枉费心机，无希望，再等候时机

改行:可进行

开业:勿因初时不佳而灰心，生意会转兴隆.`,
    ``
]

GUA_EXTRAS = [
    GUA_EXTRA_1, GUA_EXTRA_2, GUA_EXTRA_3, GUA_EXTRA_4, GUA_EXTRA_5, GUA_EXTRA_6, GUA_EXTRA_7, GUA_EXTRA_8,
    GUA_EXTRA_9, GUA_EXTRA_10, GUA_EXTRA_11, GUA_EXTRA_12, GUA_EXTRA_13, GUA_EXTRA_14, GUA_EXTRA_15, GUA_EXTRA_16,
    GUA_EXTRA_17, GUA_EXTRA_18, GUA_EXTRA_19, GUA_EXTRA_20, GUA_EXTRA_21, GUA_EXTRA_22, GUA_EXTRA_23, GUA_EXTRA_24,
    GUA_EXTRA_25, GUA_EXTRA_26, GUA_EXTRA_27, GUA_EXTRA_28, GUA_EXTRA_29, GUA_EXTRA_30, GUA_EXTRA_31, GUA_EXTRA_32,
    GUA_EXTRA_33, GUA_EXTRA_34, GUA_EXTRA_35, GUA_EXTRA_36, GUA_EXTRA_37, GUA_EXTRA_38, GUA_EXTRA_39, GUA_EXTRA_40,
    GUA_EXTRA_41, GUA_EXTRA_42, GUA_EXTRA_43, GUA_EXTRA_44, GUA_EXTRA_45, GUA_EXTRA_46, GUA_EXTRA_47, GUA_EXTRA_48,
    GUA_EXTRA_49, GUA_EXTRA_50, GUA_EXTRA_51, GUA_EXTRA_52, GUA_EXTRA_53, GUA_EXTRA_54, GUA_EXTRA_55, GUA_EXTRA_56,
    GUA_EXTRA_57, GUA_EXTRA_58, GUA_EXTRA_59, GUA_EXTRA_60, GUA_EXTRA_61, GUA_EXTRA_62, GUA_EXTRA_63, GUA_EXTRA_64,
]

module.exports = GUA_EXTRAS

