// [周易卦辞,传统解卦,张明仁解卦,高岛易断]
const GUA_EXTRA_1 = [
    `乾:元亨利贞.
    
彖曰:大哉乾元,万物资始,乃统天.云行雨施,品物流形.大明始终,六位时成,时乘六龙以御天.乾道变化,各正性命,保合大和,乃利贞.首出庶物,万国咸宁.
    
象曰:天行健,君子以自强不息.

初九:潜龙勿用.象曰"潜龙勿用,阳在下也".
    
九二:见龙在田,利见大人.象曰"见龙在田,德施普也".
    
九三:君子终日乾乾,夕惕若；厉,无咎.象曰"终日乾乾,反复道也".
    
九四:或跃在渊,无咎.象曰"或跃在渊,进无咎也".
    
九五:飞龙在天,利见大人.象曰"飞龙在天,大人造".
    
上九:亢龙有悔.象曰"亢龙有悔,盈不可久也".`,
    `这个卦是同卦(下乾上乾)相叠.象征天,喻龙(德才的君子),又象征纯粹的阳和健,表明兴盛强健.乾卦是根据万物变通的道理,以“元,亨,利,贞”为卦辞,表示吉祥如意,教导人遵守天道的德行.
    
大象:天行刚健,自强不息.
    
运势:飞龙在天,名利双收之象,宜把握机会,争取成果.
    
事业:大吉大利,万事如意,心想事成,自有天佑,春风得意,事业如日中天.但阳气已达顶点,盛极必衰,务须提高警惕,小心谨慎.力戒骄傲,冷静处世,心境平和,如是则能充分发挥才智,保证事业成功.
    
经商:十分顺利,有发展向上的大好机会.但切勿操之过急,宜冷静分析形势,把握时机,坚持商业道德,冷静对待中途出现的困难,定会有满意的结果.
    
求名:潜在能力尚未充分发挥,只要进一步努力,克服骄傲自满情绪,进业修德,以渊博学识和高尚品质,成君子之名.
    
婚恋:阳盛阴衰,但刚柔可相济,形成美满结果.女性温柔者更佳.
    
决策:可成就大的事业.坚持此卦的刚健,正直,公允的实质,修养德行,积累知识,坚定信念,自强不息,必能克服困难,消除灾难.`,
    `天,表示极阳之象,为纯卦,六冲卦,是大好,大坏的卦象.对事一般为吉象,为主管,负责任,可以任用担当大事,或开业当老板,得此卦都属吉象,只是必须有一个好的助理更佳,升官,考试,升迁都较有利.

解释:刚健稳固

特性:积极,刚毅,努力,认真,有耐性,坚忍,正派,主动,慷慨,严律,重名誉.

运势:有地位擢升,名利双收之象,功名荣显得贵子.六亲和睦,凡事谦和为贵可吉

家运:繁昌兴隆,须小心口舌之争.

疾病:病情恶化,宜细心调养,注意头,脑,骨髓等病变.

胎孕:有不安之兆,宜小心保养

子女:儿女健康,幸福有为.

周转:虽不成问题,尚宜心平气和来处理.

买卖:小利可得,大则勿取,勿太张扬为吉.

等人:一定会来.

寻人:已远走高飞,不易找到,在西北方向.

失物:可望寻回

外出:利于出行,结伴而行更佳

考试:有望取得好成绩.

诉讼:宜据理力争.

求事:有贵人提拔,可发展,称心.

改行:占得此卦不宜改行.

开业:开业者需要耐心观望.`,
    `问天气:二、三、四、五爻如果发生变动,一定是晴天。

问买卖:不利于买而利于卖。

问祸福:所谓“积善之家,必有余庆；积不善之家,必有余殃”,恐怕不是应验在当代人身上,而是应验在后代身上。

问常人:有置身过高,不了解日常事务的忧虑。

问贤人:有知道天命而独自行道之象。恐怕成群的阴柔潜伏,有被众多小人用谗言罗织陷害的危险。

初爻

问征战:乾为武人,有征战之象。初爻阳气开始发动于黄泉,还处于潜伏状态,故称“潜龙”。在军事,象征军令刚刚下达,大军还没有集结起来的时候,所以应该按兵不动,等待条件成熟。吉。

问经商:龙在潜隐状态而说“勿用”,可见虽然是一种好贸易,但是只可以安居守分,不可急于行动。

问功名:龙本是飞黄腾达的动物,而初爻却说潜,说明没到风云际会的时候,所以又说“位在下”。

问婚姻:乾卦初爻变阴则全卦为姤,姤卦说“女壮,勿用取女”,所以应当戒止。

问家宅:震为龙,在东方,说明住宅的东面必定有深水。这水闭塞不流,应该加以修凿,使它流动。

问胎孕:生男孩。

二爻

问征战:龙本来属于灵物。初爻说潜,是指伏兵。二爻说见,是从潜隐中出现而可见了。又说“在田”,一定列阵在田野等空旷的地方。《象传》说“德施普也”,指一定会得胜而论功行赏。

问经商:爻辞说“见龙在田”,可知货物大体是米麦丝棉之类。见,指物价开始上涨；“利见大人”,是说应当有官场人物出来购买。

问功名:隐伏在田间的人,应当乘时上进,发挥作用。会得到贵人的帮助,所以说“利见大人”。

问婚姻:二爻和五爻相应,五爻为地位崇高,主女婿家必定尊贵。说“见龙”,一定是刚刚被任用的年轻人。大吉。

问胎孕:生男孩,并且主贵。

三爻

问征战:征战是危险的事情。爻辞说“终日乾乾,夕惕若”,说明问卦者能“临事而惧”,所以没有灾祸。

问功名:九三在下卦的上位,而在全卦则爻位还低,象征功名还不显著,所以称君子；在多忧患和危险的位置,所以说“乾乾”、“惕若”,这样才能避免灾祸。

问经商:居于不得中的位置,行走于“重刚”的险地,想来贸易处一定是个危险的地方,日夜防备才能脱险而获利。

问家宅:观察爻象,必须谨慎地把持自身,勤劳节俭地保持家业,这样才没有灾祸。

问婚嫁:三爻以上九为应爻,三爻地位低,上爻地位高。高则不免过亢而有悔恨,所以不宜向地位高的人攀结亲事。

问胎孕:生男孩。生产时稍有危险和惊惧,但最终没有灾祸。

四爻

问征战:观察爻象,在行军前进的时候,一定有深水阻隔,应该安排船或筏；或者在临渊处有敌军埋伏,应当预先设防,才能避免灾咎。

问经商:爻辞说“或跃在渊”,如果贩运海货,恐怕有遇到波涛的危险。或许物价一时上涨,但爻辞说“无咎”,可以保证无害。

问功名:有一举成名之象,大吉。

问家宅:渊是水,跃是飞跃,家道有一时振兴之象。

问胎孕:生男孩。

五爻

问征战:九五居君位,一定是天子御驾亲征,以王者之师讨伐有罪的人,所以说“大人造”。

问经商:九五爻辰在申,在天上值毕宿,附星有咸池。咸池是苍龙的宅舍,也叫五车,主稻黍豆麦,所以他的贸易一定是五谷之类。说“飞龙”,可以知道物价的飞升；说“利见大人”,可知贩运或许出自政府的命令。

问功名:有直达云霄之象。

问疾病:有应上天的召唤之象,不吉。

问胎孕:生男孩,主尊责。

上爻

问征战:上九居乾卦的极位,以阳爻在上位,所以亢；亢就会因为胜利而骄傲,所以“有悔”。《象传》说“盈不可久”,可知征战无法持久。

问经商:亢是太过的意思。买卖之道,不可以过分追求盈利,过于盈利就一定会发生亏损,所以说“不可久”。

问功名:上九的位置已到极致,应该自己返身后退,否则必定因为盈满而遭受损害。

问家宅:一定是宅基太高。太高就危险,也是值得畏惧的。

问疾病:是龙阳上升的病症。《象传》说“盈不可久”,可知性命已经在旦夕之间了。可怕。

问婚嫁:不利。

问胎孕:生男孩,恐怕养不大。`
]
const GUA_EXTRA_2 = [
    `坤:元，亨，利牝马之贞.君子有攸往，先迷后得主，利西南得朋，东北丧朋安贞，吉

彖曰:至哉坤元，万物资生，乃顺承天.坤厚载物，德合无疆.含弘光大，品物咸亨.牝马地类，行地无疆，柔顺利贞.君子攸行，先迷失道，后顺得常.西南得朋，乃与类行；东北丧朋，乃终有庆.安贞之吉应地无疆

象曰:履霜坚冰，阴始凝也.驯致其道，至坚冰也

初六:履霜坚冰至

六二:直，方，大，不习无不利.象曰"六二之动，直以方也.不习无不利地道光也"

六三:含章可贞.或从王事，无成有终.象曰"含章可贞；以时发也或从王事知光大也"

六四:括囊；无咎，无誉.象曰"括囊无咎，慎不害也.

六五:黄裳，元吉.象曰"黄裳元吉，文在中也"

上六:战龙於野，其血玄黄.象曰"战龙於野，其道穷也"

用六:利永贞.象曰"用六永贞，以大终也"`,
    `这个卦是同卦（下坤上坤）相叠，阴性.象征地（与乾卦相反），顺从天.承载万物，伸展无穷无尽.坤卦以雌马为象征，表明地道生育抚养万物，而又依天顺时，性情温顺.它以“先迷后得”证明“坤“顺从“乾”，依随“乾”，才能把握正确方向，遵循正道，获取吉利.

大象:大地承载万物，以德服众，仁者无敌运势:诸事不宜急进，以静制动为宜

事业:诸项事业可以成功，得到预想的结果，但开始出师不利，为困境所扰.切莫冒险急进，须小心谨言慎行，尤其不可单枪匹马，独断专行.取得朋友的关心和支持最为重要，在他人的合作下.共同完成事业.因此，应注重内心修养，积蓄养德，效法大地，容忍负重，宽厚大度，以直率，方正，含蓄为原则，不得贪功自傲，持之以恒，谋求事业的成功.

经商:机遇不很好，切莫冒险，以稳健为妥，遇到挫折，务必即时总结经验.注意储存货物，待价而沽，处处小心为是

求名:比较顺利，具备基本条件，踏踏实实，埋头苦干，不追求身外之物，即可吉祥

婚恋:阴盛.以柔克刚，女方柔顺，美好姻缘，白头到老.

决策:忠厚，温和，待人真诚，热心助人，因此也能得到他人的帮助，可往往因不提防小人而受到伤害，但无大碍.性格灵活，工作方法多样，可以左右逢源，得到赞许`,
    `地，表示大地为母，天生之母性也.六冲纯卦，主大好大坏之卦象.优点，如母亲般地柔顺，牺牲，付出，有事事和顺之意.缺点，过于委缺求全，没有了自己的想法和观念.此卦论感情，有前世因缘的影响，自己就有如母亲大姊般地照顾对方，无怨无悔，会很辛苦，多劳累.事业，适合当任副手之职位，忌任主事者，容易软弱难成事.

解释:在母胎里孕育中，不宜创业

特性:为人较为保守，善于计划与研究工作，适合任辅佐幕僚之职，做人朴实，人缘佳，大好人型，男性桃花多，女性则爱情专一

运势:诸事不宜急进，退守以静制动者吉.坤者大地平静，任其他物所摧而不为所动者大利也.若醉心私欲，违背常理，则有无妄之灾

家运:幸福平静之象

疾病:病情严重，为腹，肠胃，肌肉等慢性病（腹疾，脾胃之疾，饮食停滞从而食不化)

胎孕:生贵子女儿亦福

子女:儿女众多，和睦幸福也

周转:须耐心去求，否则难成

买卖:勿急交易可成

等人:不会来须再待些时日

寻人:此人为色情之事出走，于西南方附近之地也

失物:难以寻回，大部份均不知下落

外出:宜结伴而行.可去陌生的地方

考试:希望不大

诉讼:防房地产之争，宜和解，有始无终之兆

求事:不称意亦不理想，另寻

改行:改行不利宜固守本份

开业:开业者再观望，目前尚未筹备妥当，不宜`,
    `问征战:坤为地，为众。势是有力量的意思。就行军打仗来说，既得地利又得势力，还得到了兵众，理应攻无不克。
    
问功名:有上等智慧的人能效法坤卦的深厚德行，积功累德，以至流光溢彩，声名自然显达。

问经商:坤为富，为财，为积，为聚，都是经商的吉兆。说“厚德载物”，德是得的意思，可以有求必得，满载而归。

问家宅:可知住宅在地势上占有优势，大吉。

问婚嫁:坤是顺的意思，柔顺就是了，这是地道，也是妇道。大吉。

问胎孕:生女孩。

初爻

问经商:初六阴气还很微弱，说“履霜，坚冰至”，是从微弱推论到盛大，犹如商业从小到大，通过逐渐积累而致富。问功名:初爻象征年轻人刚刚上进的时候，地位由卑微到尊贵，犹如“履霜”而“至坚冰”，随着时间而来，不可躁进。

问征战:初爻是阴气的开始，有“履霜”之象；到上爻“龙战”，则是阴气的极致，有“坚冰”之象。上爻说“其血玄黄”，指两败俱伤。所以应当先审慎于事情的开始。

问家宅:坤是纯阴的卦，而初爻阴气还微弱，所以说“履霜”；“坚冰至”，则阴气已经旺盛了。阴气旺盛了就会衰弱，是不吉的征兆。

问婚嫁:坤卦纯阴，说霜说冰都是阴象。纯阴而无阳，不利。

问胎孕:生女孩。

问疾病:恐怕是阴邪的病症。初起的时候可以治疗，日子一久就难治了。

二爻

问经商:六二是坤卦的本位，“直方”是地的性质，大是地的作用。由此可知，所经营的商业必定是土地所产，如谷米、木材、丝棉之类。“不习无不利”，“习”与“袭”相通，指不必重新占筮，就知道能够获利。

问功名:二爻居中正的爻位，行动就会获利，指不需要修养，功名就会自然成就，其成名是必然的

问征战:征战的事以得到有利的地势为要点。依法行动，气势大，力量强，可以通过一次作战而平定地方。

问家宅:六二居中得正，主家宅适宜，所以说“地道光”。问嫁娶:“直方大”是地道，而妻道通于地道，所以婚娶也有利。

问疾病:爻辞说“直方大”，可知这人平素身体强壮，不必用药就有喜庆。

问胎孕:生女孩。

三爻

问征战:爻辞说“含章可贞”，是说平时含蓄才智而不显露，一旦做事，自然能够制胜，即使不成功也不会有大的失败。所以说“无成有终”。

问经商:坤为地，各种货物都产生于地，而商人能蓄积各种货物，故说“含章”。凡从事商业的人，因时宜而贩运各种货物出售，故说“以时发”。内卦到第三爻就到了极处，正是盛满的位置，故说“光大”。所以一时虽然或许没有取得成功，但是一定会有结果，吉。

问功名:求功名的人最应该等待时机。时运不宜行动，就“含章可贞”；时运应当行动，就出来“从王事”。懂得这个道理的人，一定能始终保持功名。吉。

问疾病:玩味“无成有终”一语的含义，可知已经不可救药了。凶

问胎孕:生女孩。

四爻

问经商:六四是巽爻，巽为商，为利，即《说卦传》所谓巽近利市三倍。爻辞说“括囊”，可知过去一定曾经得到利益，钱财已收入囊中，不再拿出来了，所以说“括囊，无咎无誉

问征战:六四是重阴的一爻，正值闭塞的时候，即使有智囊的才能也无处运用。这表示宜于闭关不战，像括结囊口一样，这样就没有祸咎了。

问功名:六四是上卦的初爻，变阳则为否卦的九四，所以《文言》说“天地闭”。“括囊”就是闭结囊口。天地尚且闭塞，还有什么功名可求？如果虚妄地追求功名，只足以导致祸患。有名誉反而就有祸害了，应当审慎

问家宅:六四以阴爻居阴位，所居不是中位，住宅一定在山谷幽僻处，适宜隐遁的人居住

问胎孕:生女孩，或许会得到两个孪生女儿。

五爻
问征战:坤为臣道，五居君位，是人臣中极尊贵的人，就像舜投政时惩罚共工、欢兜、三苗和螺四区，周公摄政时株杀管叔和蔡叔一样。辞说“黄裳，元吉”，说明是由文德发越而成就武功的人，所以《文言》说“文在中”。

问功名:六五支辰在卵，得到了震卦之气，而震卦有功名振兴之象。五又是离卦的主艾，离为黄色，卦位接近午，在天上值七星，而七星主衣裳文绣，所以说“黄裳”。离又为明，有文明发达之象，所以说文在中。

问经商:坤卦的五变阳则全卦为比，比卦吉祥，是辅助的意思。商业一定要得到亲比和辅助才能成功。比卦的下卦为坤，上卦为坎，而坤为裳，所以说“黄裳”；比为美，所以说文在中”。由此可知，所经营的商业必定是锦绣的服饰之类。说“元吉”，一定会获得利润。

问疾病:坤为大腹，黄为中色，裳为下体的服饰，可见病在中下两焦。

问胎孕:生女孩。

上爻
问征战:卦象已经明白表示，结果是两败俱伤

问功名:上爻处在外卦的极位，是老年参加科举考试。抑塞已经很久，这次又将失败，值得悲衰。

问经商:上六居坤卦的终，前面的道路已经穷尽，象征钱财用尽后，血本又运到亏损，商业没办法经营下去了。

问疾病:一定是阴亏的病症。阴极盛而对抗阳，肝血暴烈流动，已经到了命终的时候。

问胎孕:阴爻因为穷尽而变阳，有生男孩的希望`
]
const GUA_EXTRA_3 = [
    `屯:元，亨，利，贞，勿用，有攸往，利建侯

彖曰:屯，刚柔始交而难生，动乎险中，大亨贞.雷雨之动满盈，天造草昧宜建侯而不宁

象曰:云雷屯；君子以经纶

初九:磐桓；利居贞，利建侯.象曰"虽磐桓，志行正也.以贵下贱，大得民也"

六二:屯如邅如，乘马班如.匪寇婚媾，女子贞不字，十年乃字.象曰"六二之难，乘刚也.十年乃字，反常也"

六三:既鹿无虞，惟入于林中，君子几不如舍，往吝.象曰"既鹿无虞，以纵禽也.君子舍之，往吝穷也"

六四:乘马班如，求婚媾，无不利.象曰"求而往，明也"

九五:屯其膏，小贞吉，大贞凶.象曰"屯其膏，施未光也"

上六:乘马班如，泣血涟如.象曰"泣血涟如，何可长也"`,
    `这个卦是异卦（下震上坎）相叠，震为雷，喻动；坎为雨，喻险.雷雨交加，险象丛生，环境恶劣.“屯”原指植物萌生大地.万物始生，充满艰难险阻，然而顺时应运，必欣欣向荣

大象:屯者难也，万事欲进而不得进

运势:身处困境，步步为营，有初难后解之意

事业:起初多不利，必知难而进，小心翼翼，勇往直前，灵活机动，可望获得大的成功，时机到来时一定要抓住，却也不得操之太急，且仍有困难，务必有他人相助，故平时应多施恩惠

经商:创业初期步履艰难，多有挫折.坚定信念最重要，不要为表面现象所迷惑，应积极进取，行动果断，打开出路.若仍无法摆脱困境，则应退守保全，等待机会，再展宏图.

求名:积极争取，主动追求，可以成功

婚恋:好事多磨，忠贞纯洁，大胆追求，能够成功，婚姻美满

决策:初始困难，但若具有坚忍不拔的毅力和锲而不舍的奋斗精神，前途不可估量，但往往不为他人理解而陷于孤独苦闷，事业会因此处于困难状态，需要得到贤德之人的帮助才能摆脱如能以乐观主义精神处世，能取得成就`,
    `屯，表示刚出生的小草，主凶象，四大难卦第一卦.因为刚出生的小草，脆弱易折，表示凡事都会很困难，很容易就会夭折，失败.但是只要有心小心地护持，小草还是有机会长成大树的

解释:不明不白

特性:理想远大，奋斗不懈，苦尽甘来，最后能达成目标，获得他人的肯定.一生困境多，烦恼厌烦多，朋友少助

运势:逆势，多有困惑，但不可妄进，宜守不宜进.坚定意志，凡事不可为一己之利而执意强行，皆有不成损破之象.宜步步为营排除困难，始可通达，有初难后解之象.

家运:多波折，若能努力排除困难，可得通顺

疾病:病在肠胃，足部或泌尿系统，不宜掉以轻心

胎孕:不安产母有虚惊，但可无虑

子女:有辛苦，但以后可得安逸

周转:困难重重须用心忍耐奔波

买卖:不利交易有损

等人:不会来

寻人:出走者不知去向，难寻.东或北方去矣失物难以寻回

外出:慎重为好，有危险，宜改日动身

考试:不理想

诉讼:小事粘滞纠缠，大事反无大害，宜和解

求事:不利

改行:不宜

开业:不宜，有困难亦难成也`,
    `问功名:内卦为震，外卦为坎才是屯卦。震为雷，坎为云，故说“云雷”；震为出，坎为入，要出而又入，故说屯。另外震为人，为上，坎为经，为法，所以说“君子以经纶”，意思是君子怀抱经纶天下的才能，而运途正值屯难，应当等待行动的时机。

问征战:以勤劳的兵众守卫叫做屯。“云雷”相当于蓄势，“经纶“是指怀有才能，但是在屯难的时候，适宜固守而不适宜前进。

问经商:《彖传》说“刚柔始交而难生”，一定是初次经商凡创始的事业，多半苦于艰难。经纶是治丝的事，可知所经营的一定是丝棉之类。

问家宅:震为东方，坎为北方，震为动，坎为陷，恐怕住宅东北方有问题，应当加以整修

问婚姻:雷为阳气，云为阴气，“刚柔始交而难生”，象征初婚的时候双方不融洽，应当有适当的人劝解他们。

问胎孕:生男孩，恐怕开始生产时有险难。

初爻

问征战:“磐桓”，行而不进的样子。说“利居贞，利建侯”尽管值于屯难的时期，但是内心要以正自守，对外要求得贤人的辅佐，这样就会民心归附，众志成城，而终究没有不利问经商:初九爻辰在子，子在北方，在天上值虚宿，称作元枵。枵就是耗，虚也是耗的意思，不利于行商。如果能守正而任用别人，还有利可图。

问功名:得到的是初爻，必定是初次求名。“磐桓”，是要进步而做不到。重要的是志愿和行为正直，为人谦逊，主动居于下位，这样终究会有所得。

问家宅:“磐”字从“石”，所谓“安如磐石”，可知这家的宅基巩固。说“利居贞”，可知居住安稳；说“利建侯”，可知一定是贵人的宅第

问婚嫁:说“以贵下贱”，这是富贵人家的女子下嫁之象，吉。

问胎孕:得初爻，生男。

二爻

问婚嫁:爻辞说“匪寇婚媾”，明说是佳偶而不是怨偶；但又说“女子贞不字，十年乃字”，可知出嫁还需要等待。

问征战:六二以柔爻居柔位，有濡滞之象，故说“屯如”。《左氏春秋》有“有班马之声，齐师其遁”的话，古时还师归朝称班师，故说“班如”。可知军队不可急于前进，必须养精蓄锐，“十年”后才能获胜。

问经商:“媾”与“购”字发音相同，含义也相通。就货物的求购来说，有迟回不决的意思，所以说“屯如遭如”。又说“十年乃字”，十是据成数而言。货物不可长久积存，或者是十日或十月吧？

问功名:士人求名，犹如女子求嫁，说“屯如”、“如”、“班如”，都是说一时无法成名。“十年乃字”，十年后才是成名的时候。

问胎孕:生儿子。

三爻

问征战:爻辞说“即鹿无虞，惟入于林中”，正如说行军而没有向导，冒进到危险的地方。应当见机而退，否则必定遭遇凶险。

问经商:玩味爻辞，可知这人既不熟悉商业，也不熟悉地理，前去不但买不到货，反而有损失。舍弃这次出行，才可以无大害

问婚嫁:属于钻地穴翻墙头而求婚，没有前途。

问功名:干求荣耀，乞怜宠爱，士人之道已经穷尽了。

问胎孕:六三以阴爻居阳位，生男孩

四爻

问征战:“乘马班如”，是不清楚进攻的道路的缘故。清楚道路以后再前往就会所向无敌，所以说“往吉，无不利”。

问功名:士人把利器藏在身上而等待时机，而不应该急于上进。等到在科举考试中高中了再出来做官临民，是“无不利”的。

问婚嫁:《诗经·关雎》说:“窈窕淑女，君子好逑。”逑，求的意思。必须等到君子求婚才能出嫁，才吉祥。

问胎孕:生女孩

五爻

问功名:士人要显扬声名，全靠上面施予恩泽。如果上面“屯其膏”，士人还有什么指望呢！

问征战:上面有厚赏，下面就愿意效力而死。如果恩泽不下施，势必离心离德，这样大势就失去了。凶。

问经商:膏指商业上的钱财和货物；“屯其膏”，指钱财和货物蓄聚而不流通。小买卖还可以固守，大经营也这样做，就未免穷困了。凶。

问疾病:膏在人体为血液，如果屯聚而不流通，就是闭塞郁积的症状。初病时治疗还容易，久病就危险了。

问胎孕:九五居尊位，主生男，并且主贵

上爻

问征战:上爻居屯卦的极位，进退维谷，日暮途穷，忧虑悲伤以至“泣血”，是军队失败、国家灭亡的时候。凶。

问经商:“乘马班如”一语，上文已经三次谈到，表明商业上的疑惑不决已经再二再三了。最后“泣血”，可知消耗和损失已经很多，所以说“何可长也”

问功名:上交居坎卦的终位，没有了前进的余地，能保全自身就算幸运了

问疾病:必定是吐血的病症，凶。

问胎孕:生女孩，恐怕无法长大`
]
const GUA_EXTRA_4 = [
    `蒙:亨.匪我求童蒙，童蒙求我.初噬告，再三渎，渎则不告.利贞.彖曰"蒙，山下有险，险而止，蒙".蒙亨，以亨行时中也.匪我求童蒙，童蒙求我，志应也.初噬告，以刚中也.再三渎，渎则不告，渎蒙也蒙以养正,圣功也

象曰:山下出泉，蒙；君子以果行育德

初六:发蒙，利用刑人，用说桎梏，以往吝.象曰:利用刑人，以正法也.

九二:包蒙吉；纳妇吉；子克家.象曰:子克家，刚柔接也.

六三:勿用娶女；见金夫，不有躬，无攸利.象曰:勿用娶女，行不顺也.

六四:困蒙，吝.象曰:困蒙之吝，独远实也

六五:童蒙，吉.象曰:童蒙之吉，顺以巽也

上九:击蒙；不利为寇，利御寇.象曰:利用御寇，上下顺也`,
    `这个卦是异卦（下坎上艮）相叠，艮是山的形象，喻止；坎是水的形象，喻险.卦形为山下有险，仍不停止前进，是为蒙昧，故称蒙卦.但因把握时机，行动切合时宜，因此，具有启蒙和通达的卦象.

大象:蒙者，昏而无所见也，故宜启蒙.

运势:初时迷惑不知方向，须忍耐待机而动，凡事多听取别人意见，则运可通.

事业:事业开始，混乱无序，危机四伏，以勇敢坚毅的行动可以扭转局面.然而必须接受严格教育，培养这种奋发图强的精神.务必脚踏实地，最忌好高骛远，否则会陷入孤立无援的境地.

经商:务必小心谨慎，不得急功近利，尤其应树立高尚的商业道德，以良好的信誉提高竞争力而取胜.

求名:必须接受良好的基础教育，陶冶情操.且动机纯正，可以达到目的.

婚恋:注意考察对方品德，不可以金钱为诱铒.夫妻需相互宽容，理解.

决策:有时会陷入迷惘困顿的境地，加上胆小，不果断，往往误事.如能接受长辈的教诲，甚至严酷的考验，抛弃疑惧的心理，等待适当时机，必然一帆风顺.`,
    `蒙，表示被蒙蔽不明之意.主小凶象.事情迷蒙不明，不宜轻信于人，此卦易犯小人，需诚心求教于有智慧经验的友人长者，受其启蒙开智慧，方能转危而安.若是一意而行必现大凶象

解释:被蒙蔽，被欺瞒

特性:喜欢追求新的知识，过平稳生活，做事谨慎，对下属要求较严，领导统御能力略差.宜防受朋友之拖累蒙蔽

运势:气运不发，多迷惑.初时不顺，须忍耐待机，渐可佳.切勿贸然行事或为人认保，作保，否则必有损失.凡事宜从上辈教诲则运可通也

家运:初时辛苦多端，上下无法沟通，只要以诚相待，必有开运之时

疾病:病情不明，反覆难治.为肠胃，腹水之疾及传染病

胎孕:胎孕无碍

子女:应注重子女教养，将来方得幸福之象

周转:困难，防止上当受骗

买卖:不利有损失

等人:可能走错路，会迟到

寻人:受诱惑而出走，因本身蒙昧无知而受骗.在东北或北方，日前难寻

失物:遍寻不获.似乎在大门下陷之处遗失，忘记带走，可试问人.

外出:等候有利时机再行动，等待期间应积极做准备.

考试:不理想

诉讼:因外人引起事端，目下未明，有理讲不清

求事:未能如愿，再等时机

改行:改行不宜

开业:开业者不宜.再等一段时间，筹备好资金再做打算.`,
    `问征战:《大象传》说“山下出泉”，即潜伏的水，有伏兵之象。“君子”指军队中的将帅。“果行育德”，果是果敢，育是蓄养，指应当养精蓄锐，而果决地前进，

问经商:玩味《大象传》的话，想是开凿矿山的生意。应当果决地从事，吉。

问功名:这是士人素有德行而隐居在深山之象。说“山下出泉”，所以终究会出山济世。

问家宅:这座住宅的坐向为坎艮。说“山下”，必定靠近山；说“出泉”，一定有泉水从山下流出。由君子来居住，住宅必定吉祥。

问婚嫁:坎卦于十二辰在子，在天上值女宿。《圣冷符》说女宿主嫁娶。艮在下兑在上的卦为咸，二气互相感应，所以说“取女吉”。“山下出泉，蒙”，是婚姻的开始。

问疾病:艮为止，坎为险，病势一定是热邪逐渐进于体内，到初爻“发蒙”的时候邪气会外发，可以保证没有危险，

问胎孕:生男孩

初爻

问征战:爻辞说“发蒙”，说明是讨伐暴虐有罪者的军队，如大禹征有苗，感化了有苗就罢师还朝，所以说“以正法也”。

问经商:初爻在内卦的开始，一定是初次经营。坎为险难，爻辞说“发蒙”，说“用刑”，可知经商必定有阻碍，几乎要兴起诉讼。但得了理就应该马上停止，追究到底恐怕有害，故说“往吝”。

问功名:要前去乞求荣宠，恐怕反而会受辱，应当中止。问嫁娶:初爻居全卦开始的位置，爻辞说“发蒙”，一定是在少年时期订婚。既然屡次发生事端和变化，罢婚就是了。

问胎孕:初六以阴爻居阳位，生女孩。又恐怕生产过程中有危难

二爻

问征战:九二以阳爻居阴位，爻辞说“包蒙”，有囊括众阴爻之象。《象传》说“刚柔接也”，刚柔即双方的军队，接就是交战，“克家”，如同说克敌。占例以妇为财，以子为福，象征既战胜敌军，又收纳他们的财物，并且承受他们的福分，大吉。

问经商:二爻和上爻以两个阳爻包括三个阴爻，一个阳爻在内，一个阳爻在外，有包罗财物，贩运到外地之象，故说“包蒙吉”。“纳妇”，一定是在旅居过程中纳娶了妇人，而且有了儿子。所谓“克家”，这儿子一定能继承父业

问功名:想来功名不在本身，而在他的儿子，所以说“子克家”。

问家宅:说“包蒙”，即以艮包坎，一定在山环水抱的地方。说“纳妇”，说“克家”，宅中必定有好妇人和好儿子，能够振兴家业。吉。

问婚姻:玩味爻辞，有两件吉事。明言既有妇人又有儿子，没有比这更大的吉事了

问胎孕:生男孩，主富贵

三爻

问征战:爻辞说“勿用取女”，女指阴爻。所有的占筮书都以妻爻为财，金也是财。在行军过程中，应该通过散财来容纳更多的人，而不应该因为敛财而招致怨恨。如果抢掠财物，一定会导致兵败身亡。说“勿用”，其中诫止的意思太深了！

问经商:六三以阴爻居阳位，内阴而外阳，一定是外出的行商。行商最忌贪色。如果男人恋色，女人贪财，只要一陷入骗局，就会小则破财，大则伤身。《象传》说“行不顺也”，顺”与“慎”字音相同，辞义相通，可以不慎重吗？

问家宅:玩味爻辞，所谓“牝鸡司晨，惟家之索”，这是应当深深戒止的。

问功名:为妇之道通于为臣之道，见利忘义必定导致身败名裂。做女人不贞，就是为臣不忠。

问胎孕:生男孩

四爻

问征战:行军适宜暗中深入，明着出离。说“困蒙”，是进入阴险的地方而出不来了，所以说困。阳为实，说“远实”，可知救兵在远处而鞭长莫及。凶。

问经商:经商之道，应该亨通而不应该困顿，应该畅达而不应该吝啬。“实”在这里指资本，“远实”主丧失资本。“困蒙”的吝，是无路可走了。

问时运:蒙，暗昧的意思；困，困厄的意思。蒙昧而又困厄，就困厄到底了，

问家宅:据爻辞看，家中生活困苦，宅地也偏僻。《象传》说“独远实”，这里一定是孤村，缺少邻居。

问胎孕:生女孩。这女孩一定没有兄弟，所以说独

五爻

问征战:五爻互坤，坤于十二辰在未，在天上值井宿，弧矢九星在井宿的东南方，主讨伐叛乱。另外，东面为子孙星，爻辞说“童蒙”，指率领子弟从军，所以吉。

问经商:五爻为卦主，爻辞说“童蒙”，店主一定还在童年阶段。五爻应二爻，《周易正义》说“委物以能”，指把事务委托给有能力的人，即委托给二爻。五爻店主知道自己年少，顺从二爻，以它为经营者，所以说“童蒙吉”。

问功名:年纪还在“童蒙”阶段，功业还没有成，名誉还没有就，只有听从二爻老师的教导，将来的成就才不可限量，所以说吉。

问婚姻:蒙的上卦为艮体，艮为少男，象征幼年订亲，所以说“童蒙吉”。

问胎孕:生男孩

上爻

问征战:上爻爻辰在戌，在天上值奎宿，奎宿主兵器库，禁制不违背时令，所以说“利御寇”。

问经商:商业之道全在利用，又贵在顺理取利。逆理而取属于寇盗，顺理而取则属于防御寇盗。“上下”指卖买两家，卖买双方和谐融洽，就上下都顺利了。吉。

问婚姻:“击蒙”，马融、郑玄作“系蒙”，恰好符合月下老人红丝系足的意思。屯卦两次说到“匪寇婚媾”，是以佳偶为婚姻，以怨偶为仇人的说法。“利用御寇”，一定属于佳偶。妇道以顺为贵，《象传》说“上下顺”，说明家室必定和睦安宁。吉。

问胎孕:生男孩。这男孩的童年，必须严加管教`
]
const GUA_EXTRA_5 = [
    `需：有孚，光亨，贞吉.利涉大川

彖曰：需，须也；险在前也.刚健而不陷，其义不困穷矣.需有孚，光亨，贞吉.位乎天位，以正中也.利涉大川，往有功也

象曰：云上於天，需；君子以饮食宴乐

初九：需于郊.利用恒，无咎.象曰"需于郊，不犯难行也.利用恒，无咎；未失常也"

九二：需于沙.小有言，终吉.象曰"需于沙，衍在中也.虽小有言，以终吉也".

九三：需于泥，致寇至.象曰"需于泥，灾在外也.自我致寇，敬慎不败也".

六四：需于血，出自穴.象曰：需于血，顺以听也.

九五：需于酒食，贞吉.象曰"酒食贞吉，以中正也"

上六：入于穴，有不速之客三人来，敬之终吉.象曰"不速之客来，敬之终吉.虽不当位，未大失也"`,
    `这个卦是异卦（下乾上坎）相叠，下卦是乾，刚健之意；上卦是坎，险陷之意.以刚逢险，宜稳健之妥，不可冒失行动，观时待变，所往一定成功

大象：云登天上而未雨，不能急进，等待时机之象.

运势：智者必须待时而行，急进反见凶险.

事业：关键在于审时度势，耐心等待，事成于安祥，切勿冒险，欲速不达.自己要充满自信，临危不惧，坚守中正，必可化险为夷.情况有利时，仍得居安思危.

经商：行动之初，情况困难，必须以极大的耐心，创造条件和机会，行事光明磊落，观时待变，实现愿望.事情接近成功时，更应小心谨慎，切莫功亏一篑.

求名：时机尚不成熟，应耐心等待.这时应坚定信念，不为闲言流语所动摇，努力丰富自己，再求助可靠的人便可成功.

婚恋：慎重，切不可草率行事，逐渐培养感情，以诚实，热情相待，会发生变故，仍可以有良好的结局.双方都应懂得以柔克刚的道理.

决策：前途光明，有雄心大志，且可实现.为此需要积蓄实力，等待时机，大器晚成.本人具有坚强的意志，冷静的头脑.前进途中会遇到困难和险阻，必须十分谨慎，坦然对待小人的中伤，在灾祸在面前能镇静自若.不轻举妄动，冷静选择方向.为人谦和，坦率，多有他人相助，促使事业成功.当时机成熟后，必然一帆风顺.`,
    `需，表示需要，需求，但却又是时机未到.此卦凶中带吉，需耐心等待，则事情可成.健康方面，要特别注意

解释：需要等待时机.

特性：谦恭有礼，性格保守，稍被动，但为人诚恳，欲求不高，中晚年才渐入佳境.不利早婚，有宗教艺术兴趣

运势：宜退守正道，不宜冒险前进，投机急取反而失利.须知贪小失大智者必须待时也

家运：初为多事之秋，须凭智慧耐心挽救颓势

疾病：病情拖延，须留心治疗，为头，胸，肺，泌尿系统等病

胎孕：临产之时才占卜，表示会有障碍.防克产母

子女：得子迟

周转：不能预期而得，有延滞

买卖：有口舌不可成就，亦勿贪小而失大.

等人：迟到

寻人：此出走之人因感情之事于西北或北方

失物：即时不能寻回，需经过一段时间将会出现

外出：充分准备齐全后，可平安无事

考试：要多用功

诉讼：暂时未能了结，以和为贵

求事：不宜急取，急亦不得，再等待，再寻求

改行：不宜

开业：不宜 `,
    `问征战：需是等待的意思。云在天上，阴阳二气没有相交， 还不可以征战。乾为君子，又为武人，这是就主帅而言。坎 为酒，所以说“饮食宴乐”。这是说行军要先准备军粮。

问经商：玩味爻辞，想是贩运粮食或开设酒馆。说“云上于天”，是云在天上而雨没有降下，想是资本还没有集中起来，所以说需。

问功名：风云还没有际会，还要有所等待。

问疾病：应当用饮食来调剂，以安乐自我消遣，久后自然痊愈。

问胎孕：生男孩

初爻

问征战：爻辞说“需于郊”，一定屯营在郊外。坎为险，为 难，前进必有险难，所以《象传》说“不犯难行”。初爻为全 卦的开始，可知是初次出动军队；说恒，说需，可知宜于长久等待。长久等待之后再前进，必定无咎。

问功名：在卦的初爻，可知是刚出山求功名。郊为草莽地方，“需于郊”是说应该退居郊野。恒是久的意思，“利用恒” 是说适宜长久等待，这样才可以得利。《象传》说“不犯难行 ”，是说它不涉险难；“未失常”，是说它能持守恒久之道，所以无害。

问经商：行商的经营之道，利益在于恒久。“需于郊”，可知前途必有险难，需要暂时把货物堆积在郊外，等待时机再前进。《象传》说“未失常”，可知货物没有损失。

问疾病：郊是田野空旷处，指适宜在野外幽居养病。“无咎”，疾病无害的意思。

问胎孕：生男孩

二爻

问征战：坎为隐伏，玩味爻象，是指应当伏兵在沙漠一类地方。或许会因为间课的情报而导致失误，而小有挫折，但结果必定吉祥。

问经商：二爻爻辰在寅，在天上值天江四星。石申说：“天江明动，大水不具，津梁不通。”货物不能运输，所以“需于沙”。沙是水边。虽然小有口舌，但是无害于商业，所以“终吉”。

问时运：“沙”字从“水”从“少”，是缺水的地方，无法行船。“ 需于沙”，犹如说时运不通。二爻爻辰在寅，在天上又值箕 宿，《诗纬》说箕为天口，主出气。“小有言”指谗言，但以 需道等待时机，故“终吉”。

问胎孕：生男孩

三爻

问征战：九三居内卦的终位，逼近外卦，而坎为寇，也为灾，故说“灾在外”。有敌寇来侵犯叫“寇至”，我自己去招惹 敌寇叫“致寇至”。必须以谨慎自我把持，先立于不败之地。

问经商：泥，拘泥的意思。行商这种行业宜于流转，不宜拘泥。倘若拘泥不化，内心怀有疑忌，就会导致外部的变故。 慢藏诲盗即“致寇”，可以不谨慎吗？

问功名：爻辞说“需于泥”，泥指水边的污泥。需在这里，就必将趋于下流而难期上达了，这样而不失败，只是侥幸罢了

问婚姻：《周易》以寇与婚媾对举，说寇就一定不是婚媾、 而是怨偶。“需于泥”是无法前进之象，婚事一定不成。 

问胎孕：生男孩

四爻

问征战：四爻为坎卦的开始，坎为血卦，“需于血”，指在战 斗中受了伤。“出自穴”，指虽然受伤，但还能脱离险难。它能够脱离险难，原因不在于强争而在于顺听，顺听才能避免危害。

问家宅：说“需于血，出自穴”，有出自幽谷，迁于乔木征 象。顺，指家道和顺。吉。

问经商：玩味爻辞，想必是采矿生意，“出自穴”就得利了。

问功名：所谓“呕尽心血方得出人头地”，有“需于血，出自穴"之象。

问疾病：想是吐血的症状，必须调养气血，使阴阳和顺，这样自然可以脱离危险而得以生存。

问胎孕：生男孩。虽然有小的险难，但最终得以安全生产

五爻

问征战：爻辞说“需于酒食”，有得胜后班师回朝，论功行赏 之象，故说“贞吉”。

问功名：正是与佳宾宴乐的时候，吉。

问经商：五爻互离卦，离于十二辰在午，在天上值柳宿，附 星有酒旗，有外厨，主宴享和饮食，可知一定是经营酒馆、 粮食等行业。另外坎为人，为纳，可知商业的输入一定有 余，所以“贞吉”。

问婚嫁：需卦五爻变阴则全卦为泰。泰卦六五说“帝乙归 妹，以祉元吉”，另外九三说“于食有福”，这就是“需于酒食” 的道理所在。“有福”，所以“贞吉”。《象传》说“以中正也”， 指体现了婚嫁的正道。

问胎孕：生男孩。得了儿子必定置办酒席，古今都是这样，所以爻辞说需于酒食

上爻

问征战：上爻为坎卦的终位，穴指坎险，“入于穴”，是说凭坎险而自守。“三人”指内卦的三个阳爻；“不速”指不请自来，即有敌兵从三面来包围。既然进入了险地，就不适宜继续战斗，而应该以礼接待而求和解，故说“敬之终吉”。

问经商：坎为劳卦，为万物所归，故说“入于穴”。穴即穴窟，指贮藏货物的地方。”三人来”指买主，用恭敬的礼仪接待他们，价格合适就销售，所以“终吉”。但坎为有水的穴窟，不适于贮藏货物，幸而有客人来，可以马上销售，所以说“虽不当位，未大失”。

问家宅：这屋子必定阴暗潮湿，幸而三面有阳光来照，故说吉。

问婚姻：需卦上六变阳则全卦为小畜，小畜的上九说“妇贞厉”。称妇，说明是已嫁的女人，故说“不当位”；但因为它“贞厉”，所以“终吉”。“入于穴”，有生则同室，死则同穴的意思。“三人来”，指媒人。

问疾病：说入穴，是凶象；说“终吉”，终结后才吉，占病也凶。

问胎孕：生男孩。说“终吉”，以前一定是缺少男孩`
]
const GUA_EXTRA_6 = [
    `讼：有孚，窒.惕中吉.终凶.利见大人，不利涉大川

彖曰：讼，上刚下险，险而健讼.讼有孚室，惕中吉，刚来而得中也终凶；讼不可成也.利见大人；尚中正也.不利涉大川；入于渊也象曰"天与水违行，讼；君子以作事谋始"

初六：不永所事，小有言，终吉.象曰"不永所事，讼不可长也.虽有小言，其辩明也"

九二：不克讼，归而逋，其邑人三百户，无.象曰"不克讼，归而逋也自下讼上患至掇也"

六三：食旧德，贞厉，终吉，或从王事，无成.象曰"食旧德，从上吉也"

九四：不克讼，复自命，渝安贞，吉.象曰"复即命，渝安贞；不失也"

九五：讼元吉.象曰"讼元吉，以中正也"

上九：或锡之带，终朝三褫之.象曰"以讼受服，亦不足敬也"`,
    `这个卦是异卦（下坎上乾）相叠.同需卦相反，互为“综卦”.乾为刚健，坎为险陷.刚与险，健与险，彼此反对，定生争讼.争讼非善事务必慎重戒惧

大象：乾天升于上，坎水降于下，相背而行而起讼

运势：事与愿违，凡事不顺，小人加害，宜防陷阱

事业：起初顺利，有利可图，继而受挫，务必警惕，慎之又慎，不得固执已见，极力避免介入诉讼纠纷的争执之中.与其这样，不如退而让人，求得化解，安于正理，可免除意外之灾.陷入争讼，即使获胜，最后还得失去，得不偿失

经商：和气生财，吃亏是福.切勿追求不义之财.商业谈判坚持公正公平，互利的原则，尽量避免发生冲突.这样，会有好结果

求名：不利.自己尚缺乏竞争实力，应坚守纯正，隐忍自励，自强自勉，切莫逞强.依靠有地位的人的帮助，及早渡过难关

婚恋：虽不尽人意，倒也般配，彼此理解，未尝不可.双方应以温和的方式处理生活

决策：争强好胜，不安于现状，为改变命运和超越他人而奋斗头脑聪颖，反应敏捷，有贵人相助.但缺乏持之以恒的毅力，容易露出锋芒，得罪他人，带来诉讼之灾.宜承认现实，顺其自然知足，适可而止.接受教训，引以为戒，可功成名就`,
    `讼，表示诉讼，争端之象.主大凶象.事情冲突到必须见官上法院，可能必须以法律途径来解决了！凡事皆不利，而且已引起很大口舌是非争持，而必须摊牌互相攻击的程度了。

解释：官司缠讼

特性：不服输，好竞争辩论，反应快，口才佳，易得罪他人，是自立自强之人

运势：百事闭塞不通，伤害频繁，受中伤而又易陷于奸计，不如意之运也.得饶人处且饶人，得过且过，莫再争讼，否则皆不利也.

家运：家庭内部不和，有口舌争端之害，并有散离之象

疾病：病情严重，为腰，血液，泌尿系统，头部疾患

胎孕：生产无惊阻，安也

子女：父子之间存有歧见，无法沟通之象.子女生来劳碌，与父母缘薄，多辛劳忧苦也.

周转：不得要领难成

买卖：因处理不当，有冲突争端，常招损失，不利也

等人：不会来.就算会来，双方必有争执情事发生

寻人：此人因争执事由负气出走，并有生命危险，又寻找不易，尽量往西北与北方寻找

失物：不会出现

外出：途中多有变故，宜改日出行

考试：不理想.

诉讼：两败俱伤，宜找中间人调解，久争无益

求事：难成.

改行：不利

开业：不宜`,
    `问征战：天之象是乾，乾为刚健勇武；水之象是坎，坎为寇盗，所以讼卦主讼事，也主军事。两军互相违背以至互相征战，而其相违背的原因在于尚未征战的时候，所以说“君子作事谋始”。这也是孔子慎于征战的旨意。

问经商：讼卦内卦互离，离为资财和斧钺；外卦互巽，巽为利市，有经商的意思。经商之道，彼此相合就会成功，相违就会失败，而且乾为开始，坎为谋划，所以说“作事谋始”。善始才能善终，商业才能长久而盛大。吉。

问功名：乾为健，坎为险，象征乾要前进而陷于坎险。这就是求功名为什么艰难。

问婚姻：婚姻是两姓间的情好相合而成，有相合之道而没有相违之理。男有家，女有室，是人伦的开始，所以君子一定要娶淑女，这是婚姻的谋始之道。

问疾病：疾病的发生一定是由于阴阳不和，不和就会相违而行，相违而行才成了疾病。治病的人应该先审慎于治疗的开始。

问胎孕：生男孩。

问失物：指东西从高处落入水中，不可能再得到。恐怕有大的口舌之争

初爻

问征战：讼是两人相争，战是两国相争，所以终极讼事与穷兵黩武都是凶事。爻辞说“不永所事”，是说一战而胜，不再滥用军队，从中越发能看出圣人是不得已才用兵的，而绝不好战。

问疾病：初爻象征初病，“不永所事”，是说不久就会痊愈，故说吉。占久病则凶

问功名：初爻居全卦的开始，是初次出门求名。“不永所事"，是说不会久困在人下，所以说“终吉”。

问经商：爻辞说“不永所事，小有言”，指商家贩卖货物，应该立即售出，即使买卖中小有争论也无大碍，故说“终吉”

二爻

问征战：二爻的应位是五爻，而五爻居尊位，为大国。二爻势力弱小，自己知道不能取胜，坎为隐伏，所以“归而逋”。三百户"为小邑。二爻既已逃窜，五爻也就停止了作战，于是“三百户”得以“无告”。

问经商：九二爻辰在寅，在天上值尾、箕、斗宿，附星为天弁，主在里巷和市区陈列货物，有经商之象。二爻变阴则全卦为否，否有损耗和失败之象，故说“不克”。外互卦为巽，巽为归，故说“归逋”。三百是小数目，所以说“无告”

问疾病：玩味爻象，一定是在外面得了病，应当迅速回家调治。病人归来后，病气不至于传染，故说邑人“无告”。

问功名：爻辞说“不克”，一时无法成名，退回来隐居也无害处。

问婚嫁：二爻与五爻相敌，尊贵与卑贱不相应，应当中止婚约。没有灾祸。

问胎孕：生男孩，恐怕无法保全

三爻

问征战：六三居坎卦的终位，逼近乾卦，即所谓“阴阳相薄”、“战乎乾”。坎本是乾元再索而得的中男，而乾为旧，为德，故说“食旧德”，即是儿子食用父亲原有的俸禄，安常守分，保有旧业，不去争战，所以吉。如果要出动君王的军队，那么坎为破，为灾，一定不会成功，故说“无成”，

问经商：爻辞说“食旧德”，可知这商业属于先辈的遗产。谨慎地固守，终究会得到吉祥。

问功名：应该继续谨守前人的旧业。或许想出外求官，必定不成。

问疾病：以仍服前一位医生开的方剂为吉。

问家宅：应该安居旧宅，不必另建新居。另建新居恐怕不会成功。

问胎孕：生男孩。这孩子长大后，也以继承父业为吉

四爻

问征战：四爻与初爻为敌，初爻既“不永所事”，四爻也失去了征战的对象，故说“不克”。乾为君，命指君命，“复即命”即凯旋而向君王复命。征战是危险的事，能转危为安，故吉。

问经商：玩味爻象，可知其商业必定是与初爻合办的，初爻既“不永所事”，四爻也复回而“即命”。复命即中止事情，故吉。

问婚姻：内卦坎为女方家，外卦乾为男方家。坎的初爻说“不永所事”，乾的初爻也复归而“即命”，即改变主意而另结婚约。《象传》说“不失”，指不失正道。

问疾病：至于“不克”，属于凶象。复为再生；坎为疾，为炎症；乾为生，为喜庆。复命即复乾。变凶险为安康，所以吉。

问胎孕：生男孩

五爻

问征战：五爻居君位，是主持战事的君王。师出有名，体现中道和正理，就是王者之师，就无敌于天下，故说“元吉”。

问商业：乾为利，坎为平。商业固然要谋利，但也要公平正直，这样才不至于争夺，商业才能符合正道，所以吉。

问功名：“讼”字从“言”从“公”，五爻为全卦的主爻。求名是以言论谋求考官的知遇。元指三元，即功名的魁首，吉祥没有比这更大的。

问婚姻：五爻为卦主，与五爻结亲，是以卑贱从尊贵，以贫乏从富有，所以说“元吉”。

问胎孕：生男孩。这孩子品貌端正，而且有福

上爻

问征战：上爻居乾阳的极位，乾阳至极就会相战。胜利已经很难了，却至于在一天内三胜三败。这样，败了固然耻辱，而胜了也不光荣。

问功名：锡，即赐。褫，夺的意思。或，表示非必然，只是假设“锡之带”，而至于在“终朝”间而三次被夺。这是个患得患失的卑鄙小人，哪处值得敬重呢！

问商业：玩味爻辞，是屡得屡失而最终得不偿失的意思。况且所得的财来路不正，所谓以悖逆纳入的，必定以悖逆支出，到底不是他的。这也是可鄙的。

问疾病：这病一定忽好忽犯，一日之间病状不一。在上爻，处在卦的极处，难以好转，恐怕最终凶险。

问胎孕：生男孩。恐怕男孩多半无法养大，一定要到第四胎才能养大`
]
const GUA_EXTRA_7 = [
    `师：贞，丈人，吉无咎

彖曰：师，众也，贞正也，能以众正，可以王矣.刚中而应，行险而顺，以此毒天下，而民从之，吉又何咎矣

象曰：地中有水，师；君子以容民畜众

初六：师出以律，否减凶.象曰"师出以律，失律凶也"

九二：在师中，吉无咎，王三锡命.象曰"在师中吉，承天宠也.王三锡命怀万邦也"

六三：师或舆尸，凶.象曰"师或舆尸，大无功也"

六四：师左次，无咎.象曰：左次无咎，未失常也

六五：田有禽，利执言，无咎.长子帅师，弟子舆尸，贞凶.象曰"长子帅师，以中行也.弟子舆师，使不当也"

上六：大君有命，开国承家，小人勿用.象曰"大君有命，以正功也小人勿用必乱邦也"`,
    `这个卦是异卦（下坎上坤）相叠.“师”指军队.坎为水，为险；坤为 地，为顺，喻寓兵于农.兵凶战危，用兵乃圣人不得已而为之，但 它可以顺利无阻碍地解决矛盾，因为顺乎形势，师出有名，故能 化凶为吉.

大象：养兵聚众，出师攻伐之象，彼此有伤，难得安宁

运势：困难重重，凡事以正规行事，忌独断独行，投机取巧，提防 潜在敌人.

事业：阻力很大，困难很多，处于激烈的竞争状态，必与他人密 切合作，谨小慎微，行为果断，切忌盲目妄动，适度即可，注意保 全自己.机动灵活，严于律已.从容沉着对付一切，必能成功

经商：已有一定的积蓄，可以从事大的营销活动，但必卷入激烈 商战，以刚毅顽强的精神和高尚的商业道德，辅以灵活的方法。勿贪图小利，勿掉以轻心，加强与他人的沟通，必可摆脱困境，化险为夷

求名：具备很好的条件，但须有正确的引导，务必严格要求自己，克服不利因素的干扰，经过扎实努力，必可名利双全.

婚恋：慎重，专注，否则会陷入“三角”纠纷.痴情追求可以达到目的.

决策：天资聪颖，性格灵活，具有坚强的意志，对事业执着追求， 迎难而进.可成就大事业.喜竞争，善争辩，富有冒险精神，不免带来麻烦，务老成持重，不贪功，以中正为要`,
    `师，表示军队打仗强烈抗争之意.师亦为师长，老师，是为强烈教训的现象，若在事，在人，均表示会受到很大教训，挫折.或是与人结怨甚深而遭到其强力的打击，迫害

解释：要师出有名.

特性：讲求实力，具有毅力，不怕困难，挑战艰巨任务，虽然时常会遇到逆境，都能一一化解克服，赢得他人的赞许

运势：事虽有不顺，但要引以为镜，记取教训.不要图私利而投机取巧.凡事应以正规而行，事物多变动，切忌独立而行.困难多端，靠自己努力，摒除一切困难为上策.

家运：外柔顺而内险恶，故家内常生不和，需慎重处理.行正道可化险为安

疾病：病况严重，提防心脏或腹腔肿瘤等

胎孕：喜中有忧或有不安或不孕

子女：大出息之象

周转：无望另觅别处

买卖：有阻，不太顺意，寅午戌日交易可成

等人：来者不善

寻人：此人因家内失和而出走，速往北方或西南找，否则有危险.

失物：不会出现，即或寻回，也已损坏

外出：“行险而顺”.虽有可能遇到麻烦，但结果一定十分顺利，可放心出行

考试：很认真，但不理想，继续努力终有成就

诉讼：宜进不宜退，内心虽忧，但得贵人之助求事：独立无望，有人扶持则可

改行：不宜

开业：须待时机行事，勿过急`,
    `问征战：以师为卦名，爻的意思也就很明白，可以根据各爻的情况而推究，吉凶自有应验

问经商：坤为财，为聚，坎为入，为纳，自有容纳和保护的器量。水在地中，为地所包容；财源如水，流动不息，所以商业会导致富有。吉

问功名：水在地中，犹如读书人还在草野而尚未显达。但是其德行和器量自能包容人民和万物，一经任用，就会像水流向海一样，利益很广。“君子”是对有德有位者的称谓。吉

问婚嫁：坤卦和坎卦相互为用，地和水彼此相亲，必定是旧亲之间联姻。大吉

问疾病：一定是水满腹胀的病症。坎为心，为忧患，应当息心调气，解忧取乐，这样自会痊愈。

问胎孕：生男孩

初爻

问功名：初爻象征初次出来求名。军队以“出师以律”为正犹如士人以道为重。倘若失去士人之道，即使一时荣显，最后也会受辱。凶。

问经商：得初爻，可知是新建立的事业；水在地中，可知属于海运商务。总之，依道义谋利的吉，背离道义的凶。

问家宅：师的内卦为坎，外卦为坤，住宅必定坐子丑，朝午未。宅中人口众多。“出师以律”，犹如说治家应当凭法度。否，不的意思；臧，善的意思。不善治家，家道必定凶。

问疾病：师卦一个阳爻而五个阴爻，必定寒气多而热气少。病症属于初起，应当请良医调治，否则凶险

二爻

问功名：九二以一个阳爻统率五个阴爻，爻辞说“在师中，吉”，说明他鹤立鸡群，属于杰出的人才。“王三锡命”，指按能力授予官爵，显示荣膺君王的任命，

问经商：九二为全卦的主爻，所象征的人一定谋略出众，在商务活动中有老成练达的称誉，是可以推举为商业公司经理的人。吉

问家宅：说“在师中，吉”，这家一定是一乡中的巨室，也是一乡中的善人。

问婚姻：九二变阴则全卦为坤，坤为地道和妻道。水和土的特性相合，所以吉，

问疾病：是水气停积中宫的病症，必须使水气流动，中焦宽舒，这样病才无害。吉。

问胎孕：生男孩

三爻

问商业：坎为大舆，舆用来载货物。坎又为陷，为破，大舆遇到险隘，就会车破货散。死后的人体叫尸，等于说车毁物丢。“或”字表示不一定。“大无功”即大失利。行商虽然未必会遇到这样的凶险，但也不可不防，因为爻象是这样戒止的。

问功名：“君子得舆”，得即德，舆用来载德而行。君子，对有德有位者的称呼。有人说“舆尸”是无德而尸位的人，所以凶。

问家宅：阴阳家称作堪舆，堪为天，舆为地，舆尸是地有尸气，哪能不凶？

问婚嫁：三爻居坎卦的终位，得到了乾元之气。乾在下而巽在上的卦为小畜，小畜的三爻说“舆说辐，夫妻反目”，《象传》说“不能正室”，凶险由此可知。

问胎孕：虽然生的是男孩，但是凶险

四爻

问家宅：四爻出了坎卦，进入坤卦。坤为西南，住宅必定朝西南。吉事崇尚左，住宅逼近东方，而青龙主喜，所以吉没有灾祸。

问功名：官职下降称为左，如所谓“左迁”。说“左次”，不吉。

问经商：右高左低，次也是低的意思。占得四爻，可知货物必定不属于高品位。但货物虽次，却可以获利，所以说“未失常"。

问婚姻：男人崇尚右，女人崇尚左，爻辞说“左次”，或许是入赘到女方家吧？不过入赘也无害，

问疾病：春天的生气发生在左方，得到春天的生气，病一定无害。

问胎孕：生女孩

五爻

问经商：爻辞说“田有禽”，等于说农业有谷物，商业有利润。“执言”，指契约和证券。在商业上，总要以老成练达的人为主才有利，否则凶险。

问家宅：住宅想是立约新买的，利益在于长房，不利于众子弟。

问功名：这人才能素来出色，有在一天早晨猎获十只禽兽的技能。但重要的是品德优于别人，如果品德差于别人，即使有技能也凶险。

问婚姻：“有禽”，指奠雁的礼仪；“执言”，指媒妁的书信。所约的婚姻，以长子长女为吉

问胎孕：生男孩，是震卦所象征的长男

上爻

问家宅：爻辞说“大君有命，开国承家”，可知这家必定是阀阅巨室。“小人勿用”，是对其后嗣的禁诫。

问经商：上六爻辰在巳，得到了巽气，而巽为商，为“近利市三倍”，所以这家一定是因为商业而兴盛的。巽又为命，爻辞说“大君有命”，则又将因为富有而尊贵，家道日益隆盛。但富贵而生骄气，亲昵小人，则是所应当戒止的。

问功名：上六居卦的终位，值论功行赏的时候，正可以看出功名的显赫。震卦所象征的长子自然能够“承家”，只是坎卦所象征的中男不可任用，所以说“小人勿用”。

问婚姻：师卦三至六爻为坤，坤为妻道。爻辞说“开国承家”，主两姓都是巨室；说“大君有命”，媒妁一定是有官位的人。吉。

问胎孕：生男孩，并且主贵`
]
const GUA_EXTRA_8 = [
    `比：吉.原筮元永贞，无咎.不宁方来，后夫凶

彖曰：比，吉也，比，辅也，下顺从也.原筮元永贞，无咎，以刚中也不宁方来，上下应也.后夫凶，其道穷也

象曰：地上有水，比；先王以建万国，亲诸侯

初六：有孚比之，无咎.有孚盈缶，终来有他，吉.象曰"比之初六，有他吉也"

六二：比自内，贞吉.象曰"比之自内，不自失也"

六三：比之匪人.象曰"比之匪人，不亦伤乎！"

六四：外比之，贞吉.象曰"外比於贤，以从上也"

九五：显比，王用三驱，失前禽.邑人不诫，吉.象曰"显比之吉，位正中也.舍逆取顺，失前禽也.邑人不诫，上使中也"

上六：比之无首，凶.象曰"比之无首，无所终也"`,
    `这个卦是异卦（下坤上坎）相叠，坤为地，坎为水.水附大地，地纳 河海，相互依赖，亲密无间.此卦与师卦完全相反，互为综卦.它 阐述的是相亲相辅，宽宏无私，精诚团结的道理

大象：一阳统五阴，比邻相亲相辅，和乐之象

运势：平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑

事业：顺利能够成功，向前发展，可以得到他人的帮助和辅佐， 以诚实，信任的态度去做事.待人宽厚，正直，主动热情，向才德 高尚的人士学习听取建议

经商：愿望能够实现，且有较丰厚的利润，但需要与他人密切合 作，真诚交往，讲究商业道德，遵守信义，如唯利是图，贪心不足，或自以为是，会导致严重损失

求名：有成功的希望，不仅要靠个人的努力，更为重要的是他人 的赏识和栽培.

婚恋：美好姻缘，相亲相爱，彼此忠诚，白头到老.

决策：心地善良，待人忠诚，厚道，乐于帮助他人，也能得到回报. 工作勤恳，对自己要求严格，可以实现自己的理想，但要多动脑 筋，多思考，善于判断是非，尤其要注意选择朋友，一旦结上品 行不端的人，会成为自己的祸患.如果与比自己高明的人交朋 友，并取得帮助，会终身受益`,
    `比，表示兄友比肩而站，一片融合互持，比和之意.主吉象.水溶入土中，胶和在一起，是个很亲密的卦象，尤其是论男女之情事业投资有亲密的伙伴相助，共同扶持打拼，事事当然顺利进行.

解释：平等，比合

特性：勤劳，认真，善良，谦恭，务实，踏实，重生活享受.异性缘多，感情烦恼也多

运势：平顺可得贵人提拔，凡事宜速战速决，不可过份迟疑

家运：合家和乐家运亨通

疾病：新病宜速就医，久病则危，为腹，肾，耳等疾

胎孕：孕安

子女：儿女温顺且侍亲至孝，亲情融合之象周转必成，找同年之兄弟，朋友可成

买卖：莫太贪心.交易反覆难成，勿贪则有利可成

等人：会来，

寻人：不在杏花处，则是有妇人相留，不可寻，恐生不测之祸.此人会自己回来

失物：不会再现.通常均已遭损毁

外出：旅途平安，一路顺风

考试：金榜题名

诉讼：宜以和解态度面对，虽小人多，但可胜诉求事有贵人帮助，可成

改行：有利，可得友人支持

开业：可大发利市，但须注意有人背叛`,
    `问征战：玩味爻象，军威盛大，像水就下一样沛然而不可阻遏。一战平定之后，就应当裂土封侯，建立藩镇。

问经商：水在地上无处不流，商业也靠流通来赢利。比是亲辅的意思，得以与亲比的人共事，这样商业就可以长久了。

问功名：建国封侯是士人贵显的极致。比卦反过来是师卦，师卦的上六说“大君有命，开国承家，“说的就是这件事。

问家宅：住宅一定低洼而接近水，也接近贵人的住宅。宅基很吉。

问婚姻：比是亲好的意思。地与水本来相亲比。占婚姻而得到这一爻，必定是百年好合，并且主贵。

问疾病：坤为地，也为腹；坎为水，也为心。恐怕是心腹水肿的病症。诸侯能治国，犹如医生能治病，应该就近求治。吉。

问胎孕：生女孩，并主贵

初爻

问征战：有禹中止讨伐停止进贡的三苗，以文德和干羽之舞使他们受到感化之象，故说“有孚比之，无咎”。

问经商：商业以信实为主，这样远近的客商才能前来亲比，才能广泛地贸易，更多地获利。吉。

问功名：“有孚比之”，即中孚卦所谓“信及豚鱼”。中孚九二说“我有好爵，吾与尔靡之。”靡，共同的意思，指我愿意与你亲比，共同发展。所以说“比之初六，有他吉”。

问婚姻：玩味爻辞，是说既相感孚又相亲比，亲近极了。凭这订婚，吉而无咎。

问家宅：比是比邻。近的既信义相孚，往来亲密，远的也闻风来做比邻，故说“终来有他吉”。

问胎孕：生女孩

二爻

问征战：士卒同心协力，上级和下级结为一体，战无不胜，故说“比之自内，贞吉”。

问功名：内即自己。自己有实在的学识和修养，足以感孚别人，就是所谓“实至而名归”。吉。

问经商：全店伙计性情亲和融洽，自然做什么都和顺。凭这一点出去贸易，别人都信服，没有不获利的，所以《象传》说“比之自内，不自失也。”

问疾病：内为心腹。有病总要心平气和，内脏充分发挥作用，外邪就会自然消除，所以吉。

问婚姻：必定是内亲之间重又联姻，吉。

问胎孕：生女孩

三爻

问征战：任用太监做监军，偏听奸佞之人的参谋，爻辞所说“比之匪人”就是，怎么能不败？

问经商：商业的盛衰在人。经商的人天天与市井无赖之辈征逐往来，“匪人”日益亲密，正经人日益疏远，不但事业立刻失败，连人的品质也不可问了。

问功名：交往之道不正，人品日益下流，不但名誉扫地，灾祸也会随后到来。

问婚姻：女子羡慕贞洁，男子效法良才，这是人伦的正道。如果不是配偶，却为之贻误终身，不也值得悲伤吗？

四爻

问征战：爻辞说“外比之”，是外部夷人归服之象，故说“贞吉

问经商：想是海外商业，货物的流通无处不到，所以说“外比之，贞吉"。

问功名：四爻在外卦而比五爻，五爻居君位，有为君王所知遇之象，功名的显赫由此可知。

问家宅：二爻在内卦，四爻在外卦，都说“贞吉”，自然内外亲比，全家和睦。

问婚嫁：玩味爻辞，想是在外地订亲。吉。

问胎孕：生男孩

五爻

问征战：有投降者不杀戮、奔逃者不禁止的大恩德大威武，所以说“王用三驱，失前禽”；有耕作者不变色、贸易者不停止的德化，所以说“邑人不诫，吉”。

问经商：玩味爻辞，只要不贪目前的小利，不图意外的财物，舍逆取顺，开头虽有损耗，后来自然盈利。

问疾病：症状已经明显，以前服用了驱除邪气的药剂，邪气已经像消失了一样。不必害怕，自会痊愈，吉。

问功名：在驱驰中发生事情，前面的成功虽然失去，后来的效果一定显著。吉

上爻

问征战：首指军队的首领，即主帅。“无首”意味着没有主帅，所以凶。

问经商：五爻为卦主，而上爻不来亲比，犹如经商的伙计不与店主相亲比，是目中“无首”，所有的谋划都必然没有结果。凶。

问功名：求名以成绩最高的为首，叫做榜首、魁首，既然”无首“，哪里有名次？凶。

问家宅：恐怕损丧一家之主，凶。

问婚姻：不知为什么没有主婚人？婚庆人家的来历不太明白。凶。

问胎孕：生女孩，恐怕有怪病`
]
const GUA_EXTRA_9 = [
    `小畜：亨密云不雨，自我西郊

彖曰：小畜；柔得位，而上下应之，曰小畜.健而巽，刚中而志行，乃亨.密云不雨，尚往也.自我西郊，施未行也.

象曰：风行天上，小畜；君子以懿文德

初九：复自道，何其咎，吉.象曰"复自道，其义吉也"

九二：牵复，吉.象曰：牵复在中，亦不自失也

九三：舆说辐，夫妻反目.象曰"夫妻反目，不能正室也"

六四：有孚，血去惕出，无咎.象曰：有孚惕出，上合志也

九五：有孚挛如，富以其邻.象曰：有孚挛如，不独富也.

上九：既雨既处，尚德载，妇贞厉.月几望，君子征凶.

象曰：既雨既处，德积载也.君子征凶，有所疑也`,
    `这个卦是异卦（下乾上巽）相叠，乾为天，巽为风.喻风调雨顺，谷物滋长，故卦名小畜（蓄）.力量有限，须待发展到一定程度，才可大有作为

大象：蓄养之量有限，力不从心，故宜忍耐蓄养实力，静待时机.

运势：运势反覆，有口舌之争，但难于短期内解决，须忍耐，静待时机.

事业：时机尚不成熟，应当耐心而积极地积存力量，切不可冒险行动.遇到挫折不可灰心，鼓起勇气战胜困难，坚持原则，加强团结合作，提前做好各项准备，会有所成

经商：已有一定的基础，但有失去危险，一定要特别慎重，争取与他人真诚合作，共同获利，决不贪心，适可而止，但更不能满足现状不图进取

求名：树立远大目标，尽最大努力去争取，虚心求教他人，取得真诚帮助，实现自己的理想，警惕小人的破坏

婚恋：双方必须十分忠诚，第三者插足的现象极有可能发生.

决策：不很顺利，前进途中会遇到一些意想不到的困难.但由于本人性格坚强，具有战胜不利条件的意志.因此，可以实理自己的理想.但极有可能遭到小人的伤害，必须得到志同道合者的真诚相助，才能可能排除障碍.对所得应满足，适可而止，切不可过度追求以免满招损`,
    `小畜，表示小有积蓄.是个小吉卦，事事不可贪大，投资理财均需保守为佳.健康无碍，平顺

解释：稍有积蓄

特性：上进心，求知欲强，思想灵敏，察言观色，善解人意，追求精神层次，美好事物有艺术美学方面天分

运势：有蓄聚，阻止之意.一阴畜五阳，虽有云雨而不下，雨之不下，大地不能得到滋润，故此运势有反覆，有口舌，又难以急调，诸事宜忍耐，等待时机.尤其女人得此卦更应在行为上，对事或对人有所节制

家运：不和且多是非，衰而不振，多劳，要耐心应对，以待时机.雨过天必晴

疾病：危，重病，注意肝胆，头部病变

胎孕：宜防流产

子女：因子女而劳碌之象，但晚年有福也

周转：有女人从中阻碍不成也

买卖：景气不好，买卖难成或利薄

等人：不会来临时变卦

寻人：因感情或家庭不和出走，只在原处.东南或西北之向

失物：似乎遗失的是金器或现金支票等物，有被硬物夹住，或者第三格的地方

外出：准备尚未充分，不得仓促出行，尤其忌长途旅行，会有意外的灾害应另择他日外出

考试：不理想

诉讼：会因证据不足而败诉

求事：希望渺小

改行：不宜

开业：不宜，已开业者则困难，口舌多`,
    `问时运：目前平平常常，有行动被人牵制和阻碍的忧虑。

问商业：有外表完美，内部却多有损耗之象。

问出行：主有风波。

问家宅：主小康人家，要防止口舌导致祸患。

问征战：虽有雷厉风行的气势，但恩泽还没有感通，只能获得小捷，难以得到大胜。

问胎孕：生女孩，并要防止流产。

问行人：恐怕乘船时因为风向而受阻，迟一些可以归来。没有灾祸。

问婚姻：主得美貌的淑女，吉。

问年成：主多风少雨，收成平平。

问疾病：主风火的病症，小儿吉，大人凶

初爻

问时运：目前平常，应该退守，没有灾祸。

问商业：适宜稳妥地守住旧业，不宜创立新的事业。

问家宅：所谓“士食旧德，农服先畴”，返求于自己，不羡慕其他，家道自会亨通。

问疾病：应当静心休养，这样自然可以复原。

问胎孕：生男孩。

问行人：马上归来。

问年成：丰收

二爻

问时运：因人成事，自然能够获利，大吉。

问商业：适宜创立与人共有的公司，或者重振旧业，都吉。

问家宅：主兄弟和睦，恢复先辈的家业，一定会使家道兴隆，是大吉之象。

问疾病：一定是旧病复发，只要小心调治就无妨。

问行人：即日与伴侣一同归来。

问征战：主连日得胜。

问胎孕：生女孩。

问年成：丰收

三爻

问时运：阴盛阳衰，内外都不安宁，最应当以谨慎自守。

问商业：有积货，应当赶快销售掉。凡众人所争售的货物千万不要卖，众人所不卖的货物要赶紧经营，这叫做反其道而行，必定得利。

问家业：阴阳颠倒，家室不和。

问疾病：要防止医生失察，以寒为热，以虚为实，药不对症，以至阴阳相反。应当赶紧另外选择良医，这样病一定会脱体，吉。

问征战：军心不和，防止有车辙错乱、旗帜倒下、倒戈相向的祸患。

问行人：即日可以回来。

问出行：恐怕中途有危险。

问胎孕：生男孩，主眼睛有病。

问年成：不好。

问婚姻：不利

四爻

问时运：目前不免忧虑，切忌与人争斗，以免受到损伤。应当出门远远地躲避，这样才会无祸。

问功名：一定会得到上级的契合，马上就有升迁，大吉。

问征战：有利于出兵进攻，可以得胜。

问家业：对妻妾和仆从的管理要得法，否则必定反受他们的制伏，这是应该充分注意的。

问行商：利在西北，不利于东南。

问疾病：是外寒里热的病症，治疗宜于宽解，不宜用燥烈的药物。

问谋事：能得到邻里的相助。

占行人：恐怕中途遇到危险，应当穿低贱者的服装，在潜隐中行路，凭忍隐避难。

占胎孕：这一胎生女孩，以后可以连生五个男孩

五爻

问商业：有各种货物辐辏而来，众商人悦服之象，非常有利。

问时运：一生气运亨通，做什么都有利。

问功名：主连续得到升迁，官位与财俸禄两全。

问家业：主历代忠厚，恩惠泽及邻里，不但富有，而且能尊贵显达。

问征战：主将士同心协力，有国土日益开辟之象。

问胎孕：有孪生之象。

问疾病：主麻痹不仁，手足挛拘的病症。

问失物：应当从邻近处寻觅，自会得到。

问出行：应当结伴而行，不宜独自前往

上爻

问时运：有过去希望无法实现，现在得以如意之象。

问家业：有先困顿而后亨通之象。

问经商：应当得到利润就停止，倘若贪得无厌，最终恐怕因为盈满而导致凶咎。

问征战：既然已经得胜，就应当立即停战，倘若继续进攻，将不利于主帅。

问年成：旱，但不成灾害。

问胎孕：生女孩。

问行人：马上归来。

问出行：不利`
]
const GUA_EXTRA_10 = [
    `履：履虎尾,不咥人,亨,

彖曰：履，柔履刚也说而应乎乾，是以履虎尾，不咥人，亨刚中正，履帝位而不疚，光明也

象曰：上天下泽，雁；君子以辨上下，安民志

初九：素履，往无咎.象曰"素履之往，独行愿也"

九二:履道坦坦,幽人贞吉.象曰"幽人贞吉,中不自乱也"

六三：眇能视，跛能履，履虎尾，咥人凶.武人为于大君象曰"眇能视；不足以有明也.跛能履；不足以与行也，咥人之凶；位不当 也武人为干大君；志刚也"

九四：履虎尾，觀塑终吉，象曰"愬愬终吉，志行也"

九五：夫国，贞厉，象曰"夬展贞厉，位正当也"

上九：视履考祥，其旋元吉.象曰"元吉在上，大有庆也"`,
    `这个卦是异卦（下兑上乾）相叠，乾为天，兑为泽，以天喻君，以泽喻民，原文，“履（踩）虎尾，不咥（咬）人”.因此，结果吉利.君上民下，各得其位.兑柔遇乾刚，所履危.履意为实践，卦义是脚踏实地的向前进取的意思.

大象：柔弱遇刚强，欲行却难行之象，难且危也.

运势：先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险

事业：起初很不顺利，受到种种威胁，若能提高警惕，谨小慎微，脚踏实地，逐个地去克服困难，不改变自己的决心，一定可以达到目的.办事有自知之明，务必量力而行，不可不顾实际，尤其不得逞强急于求成.

经商：宜待观动静，勿为小利而动摇自己计划，尤其不得贪得无厌，遵循商业道德，了解全面信息

求名：务必有恒心，孜孜以求，不为财富利诱，不为世俗干扰，坚持自己的志向和理想，可以取得成功

婚恋：双方安贫乐道，可和睦相处，若一方为富贵所动，会发生婚变.

决策：诸事必须小心慎重，不利的情况经常会出现，但若能处理得好，总会是有惊无险，化险为夷.为此，办事必须认认真真，遵循正道，虚心听取别人的建议，量力而行，切莫自负逞强，一定会有好的结果.`,
    `履，表示战战兢兢，如履薄冰而行，却是有惊无险，为小凶带吉之象.履又为礼也.得此卦者，需尽快反省自己的态度，对人，对事，对长辈是否有轻忽，不敬之意.虽有危急之事幸好能平安度过.

解释：只要履行契约承诺则吉

特性：竞争，积极，冒险，热枕，独立，自立自强，有骨气

运势：先劳而后逸，始惊而后安，百事不宜急进，须以和待人，有惊无险

家运：新婚而刚建立家庭者，多碍，劳苦.但此卦有先苦后甘之象，和气可生财，过些时日即可雨过天晴也

疾病：病虽重.但注意调理亦可愈，防头，口，肺等疾

胎孕：临盆产妇占得则吉，否则有受惊吓之象，需安胎

子女：初运有劳苦，障碍，困难之象，但以后能获得幸福也

周转：虽有些困难，但不必急躁，谦恭而施则可成也

买卖：虽有是非但终可成，牛马猴之月或日方成

等人：迟来

寻人：走失之人有生命危险，在西方或西北方向，难寻，须争取时效申未日可见

失物：赶快去找有可能寻回，留意行过的路上，或者有鞋的地方

外出：有惊无险，可以外出，但非紧急情况可以缓行

考试：不理想

诉讼：敌强而我弱之象，宜步步为营

求事：有贵人提拔，可发展，称心

改行：不宜

开业：不宜 `,
    `问家业：有门庭肃穆，仆人和妻妾都很顺从之象。

问任官：有品级逐渐提高之象，但如果通过攀援寻求进步，则反而不利。

问经商：且辨别货物的品位，切实考察行情，等待销售的时机，一定能得到高价。

问出行：利于滨海之类地方。

问胎孕：生女孩。

问疾病：应当疏通中焦。

问遗失：一时被东西所遮掩，久后会自然出现

初爻

问功名：应当安居乐道，等待时运亨通，到那时做事就无往不利了。

问经商：应当持守旧业，久后一定能获利。

问谋事：宜于宽缓地等待，不宜急迫

问征战：应当独自在暗中刺探敌情，没有灾祸。

问家宅：“福履绥之”，门庭吉祥。

问胎孕：生男孩

二爻

问功名：有志愿高尚之象

问经商：一时物价平平，只可以得到微利。

问出行：平稳而得吉。

问终身：有以恭敬修身的志愿。

问家宅：有分财产之象。

问失物：有意外损耗的忧虑

三爻

问家宅：有暗昧不明，少的欺凌老的，小的欺凌大的之象。

问商业：有被人欺骗或玩弄，急切而无法售出的忧虑。

问征战：应该退守而不应该进攻，妄动的人凶险。

问行人：恐怕中途遇到危险。

问失物：就近寻觅，自会找到。

问胎孕：生男孩，但要防婴儿有残疾

四爻

问时运：以温和待人，以笃实担当事，即使面临危险，最终也能够免于祸患，是气运平稳的时候。

问商业：不宜急于脱货，应当谨慎耐心地守候，终究会得到利益。

问征战：面临危险，宜于固守，遇到救助而获胜，可以扭转战局，转败为胜。

问胎孕：平稳得到男孩

五爻

问时运：先苦后甜。目前正是拨云见日的时候，还应当不忘过去的苦境，兢兢业业地做事，这样才能长保富有。

问商业：应当和衷共济。有货不要急于出售，久后必定得到厚利。

问失物：有不用寻找就自然得到之象。

问功名：目前已经得到升迁，只要谨慎就可以长久地保有。

问疾病：先危险后安然

上爻

问时运：目前正是安乐的时候，这人平素的行为一定没有亏欠，所以晚运亨通，福寿双全。大吉。

问商业：往返的经营都得到大利益。

问家宅：“祸福无门，惟人自招”，只要积善行德，就一定有意外的喜庆。

问疾病：恐怕寿命有限。

问失物：不用寻找，自然会得到。

问胎孕：必定生尊贵的儿子。

问征战：获得大的胜利，高奏凯歌而回`
]
const GUA_EXTRA_11 = [
    `泰：小往大来吉亨

彖曰：泰，小往大来，吉亨.则是天地交，而万物通也；上下交，而其志同也.内阳而外阴，内健而外顺，内君子而外小人，君子道长小人道消也

象曰：天地交泰，后以财成天地之道，辅相天地之宜，以左右民

初九：拔茅茹，以其夤，征吉.象曰"拔茅征吉，志在外也"

九二：包荒，用冯河，不遐遗，朋亡，得尚于中行.象曰"包荒，得尚于中行以光大也"

九三：无平不陂，无往不复，艰贞无咎.勿恤其孚，于食有福.象曰"无往不复天地际也"

六四：翩翩不富，以其邻，不戒以孚.象曰"翩翩不富，皆失实也.不戒以孚，中心愿也"

六五：帝乙归妹，以祉元吉.象曰"以祉元吉，中以行愿也"

上六：城复于隍，勿用师.自邑告命，贞吝.象曰"城复于隍，其命乱也"`,
    `这个卦是异卦（下乾上坤）相叠，乾为天，为阳；坤为地，为阴，阴阳交感，上下互通，天地相交，万物纷纭.反之则凶，万事万物，皆对立，转化，盛极必衰，衰而转盛，故应时而变者泰（通）.

大象：天地阴阳之气相交感，上下和睦，流通无阻

运势：诸事吉祥顺利，凡事宜内求，不宜外求，防乐极生悲

事业：坚持由小而大，循序渐进的原则，事业已达到顺利的境地，更应小心从事，居安思危，积极寻求，开拓新的事业，方可继续前进，若因循守旧，不思进取，必遭失败

经商：顺利.务必注意市场动向，开拓新的领域，展开新的竞争.为此，密切与他人的合作，争取各方面的帮助，但需谦虚谨慎，警惕巧言令色的小人.

求名：具有成功的条件，但一定得更加努力，刻苦追求，最忌聪明反被聪明误

婚恋：美满姻缘.谈恋爱却不可不认真对待

决策：吉祥如意.适应能力强，各项事业能成功.能谋善断，长于人际关系，能团结他人共创业绩，灵活机动，很能适应形势的变化，不断向新的领域迈进.但在人生途中必须兢兢业业，尤其不可麻痹大意，在择朋选友方面更应慎重，切防小人倒运.`,
    `泰，表示三阳开泰，万事亨通.吉卦之象，诸事皆顺

解释：否极泰来鸿运当头

特性：交游广泛，包容性大，有雅量，个性开朗，乐观，积极，主动又能接受他人意见，心胸开阔

运势：诸事如意吉祥，前途事业均顺利.切不可骄傲或任意从事，亦宜自惕勿太活跃，始能免于灾难.凡事宜求内在之实，不求外在之虚否则有破

家运：家庭和合，有通亨之象，凡事宜检点得失，不可胡为，否则招灾不利

疾病：久病不利，注意肠肺及头部之症

胎孕：生贵子.安而无灾.生女亦均无碍

子女：亲子和睦，幸福圆满.留心教养，勿使太任性，否则沦于不幸之破运

周转：可成

买卖：交易有益得利

等人：会来

寻人：在朋友或亲戚家里，有信息也.可寻

失物：不会出现

外出：一帆风顺

考试：上榜有望，宜再努力勿懈

诉讼：是非由小事化大，终可和解

求事：吉利亨通

改行：吉

开业：开业者吉利之象`,
    `问国家气运：正是君明臣良、百姓安泰的全盛时期，但盛极就会衰落。好在否泰在天，回挽却在于人，所以应当深谋远虑。家道也是这样。

问谋事：事情一定会成就，但必须防止后来的败坏。

问婚嫁：属于阴阳合体的卦，是大吉之象，

问商业：买卖都吉，但卖出利益微少，买入利益大，这从“小往大来”的说法可以知道。

问年成：雨水调和，是丰登之象。

问胎孕：有男女孪生之象。

问失物：要从左右近处寻觅，自能见到

初爻

问时运：有因人成事之象。

问家宅：有家室团圆，人口平安的吉庆。

问经商：有主人和伙计志同道合，货物和钱财汇萃而来之象。

问功名：有逐渐升迁的喜庆。

问征战：凭进攻获得胜利。

问失物：应该在丛草处寻觅。

问胎孕：初胎生女孩，三四胎生男孩

二爻

问时运：正是功名显达的时候，可以远游海外，兴办事业。

问功名：有奉使远行或从事军事征伐的征兆，都能得吉。

问商业：有利于行商贩运外地的货物

问失物：一定坠落在水中，恐怕难以寻得。

问疾病：不吉。

问家宅：用人要宽容，处事要果决，不可偏信仆从的话，以致损耗家业。

问征战：有恩抚偏远处的人民，征伐不朝贡的地区，而疆土日益开辟的趋势。

问胎孕：生男孩

三爻

问时运：行事谨慎的人昌盛，耽于逸乐的人失败，这是最该留意的。

问商业：现在虽然失意，以后必得大利。

问征战：必须防止敌兵埋伏，适宜固守，不适宜进攻。

问失物：不久就会得到。

问生产：虽然危险，但没有灾祸，必定生有福的儿子。

问家业：应当谨守先人的家业，可以长保富有。

问疾病：少年无害，老年人命限有阻碍

四爻

问时运：好在得到朋友的同心相孚，凡事可以图谋。

问商业：外表场面很好，内里却已经空虚，全靠同行相助才能成事。

问征战：粮饷缺乏，应当劫掠敌人的，来供应军队的需要。军心稳固，只有胜利，没有失败。

问家业：本来是一个富厚人家，目前却外强中干，幸而亲戚邻里都能互通有无，所以不忧虑匮乏，

问失物：主遗落在比邻的人家，询问就能得到

五爻

问时运：目前亨通，适宜谦虚柔顺，这样凡事都吉。

问商业：适宜到海外进行贸易，吉。

问家宅：得到贤良的内助。

问婚嫁：适宜远嫁或远娶，吉。

问胎孕：主生贵女。

问疾病：必定得到神的保佑，吉。

问失物：拾到的人必定亲自来归还

上爻

问时运：目前气运颠倒，应该谨慎自守，还须防备小人拨弄是非。

问商业：应该保守从事，以等待时运。

问征战：攻城略地，必定胜利

问家宅：防止颠覆破败，适宜稳守旧业。

问生产：生女孩。

问失物：恐怕难以复得`
]
const GUA_EXTRA_12 = [
    `否：否之匪人，不利君子贞，大往小来

彖曰：否之匪人，不利君子贞.大往小来，则是天地不交，而万物不通也；上下不交，而天下无邦也.内阴而外阳，内柔而外刚，内小人而外君子小人道长，君子道消也

象曰：天地不交，否；君子以俭德辟难，不可荣以禄.

初六：拔茅茹，以其夤，贞吉亨.象曰"拔茅贞吉，志在君也"

六二：包承.小人吉，大人否亨.象曰"大人否亨，不乱群也"

六三：包羞.象曰"包羞，位不当也"

九四：有命无咎，畴离祉.象曰"有命无咎，志行也"

九五：休否，大人吉.其亡其亡，系于苞桑.象曰"大人之吉，位正当也"

上九：倾否，先否后喜.象曰"否终则倾，何可长也"`,
    `这个卦是异卦（下坤上乾）相叠，其结构同泰卦相反，系阳气上升，阴气下降，天地不交，万物不通.它们彼此为“综卦”，表明泰极而否，否极泰来，互为因果

大象：天气上升，地气下降，天地之气不交，主闭塞不通

运势：上下不和，百事不通，凡事宜忍，须知否极泰来

事业：陷入逆境，事业处于衰退阶段，多有不顺利.受小人干扰而不得志，多挫折.应坚持正道，勿与小人合流，团结志同道合者，自保以等待时机.保持自信心，戒慎恐惧，形势定会好转，事业终能成功

经商：遇到强大的竞争对手，处于不利地位.信息不灵造成重大损失.应格外小心谨慎，坚持守势，等待有利时机到来，再发展自己的营销事业.

求名：条件还不成熟，再努力一阵子，并得到他人的帮助，理想可以实现.

婚恋：容易出现节外生枝的事情，甚至发生挫折和变故，双方若都充满信心，好的结果会出现

决策：本人聪慧，精明，勤奋努力，但不注意人际关系，加上小人的排斥，命运或遭厄运.意志坚强，具有奋斗精神，且克服了不足，尽管付出的代价很高，必能成全事业.`,
    `否，表示不好，坏掉了！主凶象.否显现出阴阳之气不协调，在人及事方面诸多不被认同，有内外不合，众说纷纭的现象，因此事事难以进行，最好此时能彼此互相退让静下心来理性的沟通。方能转吉.婚姻，感情，已有个性，意见的冲突产生，若不能好好退让协商，恐有离异分手的结局

解释处在困境中.

特性：自尊心强，个性刚烈，不服输，反应快，学习能力强，高傲不亦亲近.财运佳，有领导才能，与上司不易相处

运势：凶且衰，君子以险德避难，不可荣以禄也.运势不通达，诸事不顺，有损失且波折多.故宜守固正道，若稍偏差，则灾害至也.

家运：夫妻彼此不能协调，是非很多，劫财又带衰，慎之

疾病：占病为凶兆，病在脑，肺及肠胃等，慎防癌症

胎孕：不安

子女：与双亲感情不睦，任其自然发展吧

周转：告货无门

买卖：多有损失，但有贵人应在午未申日.

等人：不会来，因别的事情而违约

寻人：因感情不睦而出走，去向不明，难寻.东南方.

失物：寻不回

外出：会遇到不少麻烦和困难，宜推迟或提前行动

考试：不理想

诉讼：各走极端，有口难言，宜及时求和

求事：先难后易，须有耐心去争取胜利，否则凶改行难如愿

开业：最好另择吉日.然此卦有先难之困，若能舒之则利`,
    `问时运：目前各种事情都不利，宜于谨慎地持守本分，不宜妄动。

问经商：适宜买入，不适宜卖出。隐藏货物，等待高价，以后可以获利。

问征战：不利于进攻，利于退守。

问家业：应当克俭克勤，这样才能免于祸患。

问疾病：是痞隔的病症，应当节制饮食。

问生产：恐怕生男孩而无法养大。

问失物：恐怕不可能再得到。

问婚嫁：有分离之象。

问谋事：不成

初爻

问时运：吉，适宜合伙谋事。

问经商：对新创立的商业来说，用人要慎重。

问征战：应当与左右营联合起来，一并前进。吉。

问家宅：主有亲戚同居，吉。

问疾病：恐怕患传染的病症，但是无害。

问胎孕：生女孩。

问失物：可以复得

二爻

问时运：目前气运顺适，能以包容的态度待人，凡事都吉。

问商业：买卖双方都有利。

问讼事：防有贿赂、伪造等弊端发生，初审或许不利，上诉则吉。

问家宅：家中人口平安，年老的家长或许有病，但是无害。

问征战：必定得胜，但主将或许受到小害。

问失物：必须看包裹里面，一定能得到。

问生产：生女孩，产母有病，但是无妨

三爻

问时运：目前正是好运将来的时候，应当谨慎自守，以避免羞辱。

问商业：防止内部有暗中的损耗，而在外表上加以掩饰，这是用人不当的缘故。

问家宅：恐怕闺中的德行不好，有男女间发生不正当关系的羞耻。又不宜以妾为妻。

问征战：防止被敌军所困。

问疾病：预防寒中包热的病症，恐怕药不对症，应该马上看良医。

问讼事：恐怕辩护律师人选不当。

问失物：防止偷窃者含羞自尽，这样反而导致多事。

问行人：防止行人贪恋女色，一时不能归来

四爻

问时运：目前已经得到盛运，随意谋划的事情，都一定获利。

问商业：得到了大的转机，但必须立定志愿，审察和衡量行情，这样，从前所失去的，现在可以复得，而且有盈余。

问家宅：宅运已经转变，吉。

问征战：命令将帅出征，大吉。

问疾病：命根牢固，无害。

问失物：一定夹杂在用品中，一找就能得到

五爻

问时运：目前逐渐进入好境遇，只因为安泰而不忘危亡，所以凡事都吉。

问商业：恰好遇到绝好的机会，但必须另用伙计，谨慎做事，这样必定能得利益。

问家宅：祖业深厚，吉。

问征战：应该暂时休战。

问疾病：有妨碍。

问讼事：和好。

问失物：防止难以复得。

问行人：不利。

问生产：大人无碍，婴儿难以保全

上爻

问时运：亨通。

问商业：春夏不利，秋冬大吉。

问家宅：迁居大吉，住在老宅不利。

问讼事：当日就可以了结。

问征战：先有小的失败，后有大的胜利。

问胎孕：生男孩。

问失物：马上得到。

问疾病：马上痊愈，但复发的危险值得忧虑`
]
const GUA_EXTRA_13 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_14 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_15 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_16 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_17 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_18 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_19 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_20 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_21 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_22 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_23 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_24 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_25 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_26 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_27 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_28 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_29 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_30 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_31 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_32 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_33 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_34 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_35 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_36 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_37 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_38 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_39 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_40 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_41 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_42 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_43 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_44 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_45 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_46 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_47 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_48 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_49 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_50 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_51 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_52 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_53 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_54 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_55 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_56 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_57 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_58 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_59 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_60 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_61 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_62 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_63 = [
    ``,
    ``,
    ``,
    ``
]
const GUA_EXTRA_64 = [
    ``,
    ``,
    ``,
    ``
]

GUA_EXTRAS = [
    GUA_EXTRA_1, GUA_EXTRA_2, GUA_EXTRA_3, GUA_EXTRA_4, GUA_EXTRA_5, GUA_EXTRA_6, GUA_EXTRA_7, GUA_EXTRA_8,
    GUA_EXTRA_9, GUA_EXTRA_10, GUA_EXTRA_11, GUA_EXTRA_12, GUA_EXTRA_13, GUA_EXTRA_14, GUA_EXTRA_15, GUA_EXTRA_16,
    GUA_EXTRA_17, GUA_EXTRA_18, GUA_EXTRA_19, GUA_EXTRA_20, GUA_EXTRA_21, GUA_EXTRA_22, GUA_EXTRA_23, GUA_EXTRA_24,
    GUA_EXTRA_25, GUA_EXTRA_26, GUA_EXTRA_27, GUA_EXTRA_28, GUA_EXTRA_29, GUA_EXTRA_30, GUA_EXTRA_31, GUA_EXTRA_32,
    GUA_EXTRA_33, GUA_EXTRA_34, GUA_EXTRA_35, GUA_EXTRA_36, GUA_EXTRA_37, GUA_EXTRA_38, GUA_EXTRA_39, GUA_EXTRA_40,
    GUA_EXTRA_41, GUA_EXTRA_42, GUA_EXTRA_43, GUA_EXTRA_44, GUA_EXTRA_45, GUA_EXTRA_46, GUA_EXTRA_47, GUA_EXTRA_48,
    GUA_EXTRA_49, GUA_EXTRA_50, GUA_EXTRA_51, GUA_EXTRA_52, GUA_EXTRA_53, GUA_EXTRA_54, GUA_EXTRA_55, GUA_EXTRA_56,
    GUA_EXTRA_57, GUA_EXTRA_58, GUA_EXTRA_59, GUA_EXTRA_60, GUA_EXTRA_61, GUA_EXTRA_62, GUA_EXTRA_63, GUA_EXTRA_64,
]

module.exports = GUA_EXTRAS

