// elements = { 0: { "运势": "大安", "九宫": "☳震", "五行": "木", "九星": "天冲星", "八门": "伤门", "方位": "东", "吉凶": "上吉" }, 1: { "运势": "留连", "九宫": "☴巽", "五行": "木", "九星": "天辅星", "八门": "休门", "方位": "东南", "吉凶": "上吉" }, 2: { "运势": "速喜", "九宫": "☲离", "五行": "火", "九星": "天英星", "八门": "景门", "方位": "南", "吉凶": "小凶" }, 3: { "运势": "赤口", "九宫": "☱兑", "五行": "金", "九星": "天柱星", "八门": "惊门", "方位": "西", "吉凶": "小凶" }, 4: { "运势": "小吉", "九宫": "☵坎", "五行": "水", "九星": "天蓬星", "八门": "休门", "方位": "北", "吉凶": "大凶" }, 5: { "运势": "空亡", "九宫": "中", "五行": "土", "九星": "天禽星", "八门": "疑门", "方位": "中", "吉凶": "上吉" }, 6: { "运势": "病符", "九宫": "☷坤", "五行": "土", "九星": "天芮星", "八门": "死门", "方位": "西南", "吉凶": "大凶" }, 7: { "运势": "桃花", "九宫": "☶艮", "五行": "土", "九星": "天任星", "八门": "生门", "方位": "东北", "吉凶": "小吉" }, 8: { "运势": "天德", "九宫": "☰乾", "五行": "金", "九星": "天心星", "八门": "开门", "方位": "西北", "吉凶": "上吉" } }

const LICHUNFENGLIUQINMAP = {
    '大安': { '小吉': '父母•印绥', '速喜': '子孙•食伤', '赤口': '官鬼•官杀', '留连': '妻财•财星', '大安': '兄弟•比劫', '空亡': '妻财•财星' },
    '留连': { '速喜': '父母•印绥', '赤口': '子孙•食伤', '大安': '官鬼•官杀', '小吉': '妻财•财星', '留连': '兄弟•比劫', '空亡': '兄弟•比劫' },
    '速喜': { '大安': '父母•印绥', '留连': '子孙•食伤', '小吉': '官鬼•官杀', '赤口': '妻财•财星', '速喜': '兄弟•比劫', '空亡': '子孙•食伤' },
    '赤口': { '留连': '父母•印绥', '小吉': '子孙•食伤', '速喜': '官鬼•官杀', '大安': '妻财•财星', '赤口': '兄弟•比劫', '空亡': '父母•印绥' },
    '小吉': { '赤口': '父母•印绥', '大安': '子孙•食伤', '留连': '官鬼•官杀', '速喜': '妻财•财星', '小吉': '兄弟•比劫', '空亡': '官鬼•官杀' },
    '空亡': { '速喜': '父母•印绥', '赤口': '子孙•食伤', '大安': '官鬼•官杀', '小吉': '妻财•财星', '留连': '兄弟•比劫', '空亡': '兄弟•比劫' },
}

const JIUGONGLIUQINMAP = {
    '大安': { '小吉': '父母•印绥', '速喜': '子孙•食伤', '赤口': '官鬼•官杀', '空亡': '妻财•财星', '大安': '兄弟•比劫', '留连': '兄弟•比劫', '病符': '妻财•财星', '桃花': '妻财•财星', '天德': '官鬼•官杀' },
    '留连': { '小吉': '父母•印绥', '速喜': '子孙•食伤', '赤口': '官鬼•官杀', '空亡': '妻财•财星', '留连': '兄弟•比劫', '大安': '兄弟•比劫', '病符': '妻财•财星', '桃花': '妻财•财星', '天德': '官鬼•官杀' },
    '速喜': { '大安': '父母•印绥', '空亡': '子孙•食伤', '小吉': '官鬼•官杀', '赤口': '妻财•财星', '速喜': '兄弟•比劫', '留连': '父母•印绥', '病符': '子孙•食伤', '桃花': '子孙•食伤', '天德': '妻财•财星' },
    '赤口': { '空亡': '父母•印绥', '小吉': '子孙•食伤', '速喜': '官鬼•官杀', '大安': '妻财•财星', '赤口': '兄弟•比劫', '留连': '妻财•财星', '病符': '父母•印绥', '桃花': '父母•印绥', '天德': '兄弟•比劫' },
    '小吉': { '赤口': '父母•印绥', '大安': '子孙•食伤', '空亡': '官鬼•官杀', '速喜': '妻财•财星', '小吉': '兄弟•比劫', '留连': '子孙•食伤', '病符': '官鬼•官杀', '桃花': '官鬼•官杀', '天德': '父母•印绥' },
    '空亡': { '速喜': '父母•印绥', '赤口': '子孙•食伤', '大安': '官鬼•官杀', '小吉': '妻财•财星', '留连': '兄弟•比劫', '空亡': '兄弟•比劫', '病符': '兄弟•比劫', '桃花': '兄弟•比劫', '天德': '子孙•食伤' },
    '病符': { '速喜': '父母•印绥', '赤口': '子孙•食伤', '大安': '官鬼•官杀', '小吉': '妻财•财星', '病符': '兄弟•比劫', '空亡': '兄弟•比劫', '留连': '兄弟•比劫', '桃花': '兄弟•比劫', '天德': '子孙•食伤' },
    '桃花': { '速喜': '父母•印绥', '赤口': '子孙•食伤', '大安': '官鬼•官杀', '小吉': '妻财•财星', '桃花': '兄弟•比劫', '空亡': '兄弟•比劫', '病符': '兄弟•比劫', '留连': '兄弟•比劫', '天德': '子孙•食伤' },
    '天德': { '病符': '父母•印绥', '小吉': '子孙•食伤', '速喜': '官鬼•官杀', '大安': '妻财•财星', '天德': '兄弟•比劫', '空亡': '父母•印绥', '病符': '父母•印绥', '桃花': '父母•印绥', '留连': '妻财•财星' },
}

// 阳木/阴土/阳火/阳金/阳水/阳土
const LICHUNFENGS = [
    { name: '大安', liushou: '青龙', yinyang: '阳', fangwei: '东方', wuxing: '木', title: '长期，缓慢，稳定', detail: '求安稳，大安最吉；求变化，大安不吉' },
    { name: '留连', liushou: '腾蛇', yinyang: '阴', fangwei: '四方', wuxing: '土', title: '停止，反复，复杂', detail: '想挽留，留连是吉；否则都很恶心' },
    { name: '速喜', liushou: '朱雀', yinyang: '阳', fangwei: '南方', wuxing: '火', title: '惊喜，快速，突然', detail: '意想不到的好事' },
    { name: '赤口', liushou: '白虎', yinyang: '阴', fangwei: '西方', wuxing: '金', title: '争斗，凶恶，伤害', detail: '吵架，打架，斗争，诉讼是非，肉体受伤，尤其赤口叠现' },
    { name: '小吉', liushou: '玄武', yinyang: '阳', fangwei: '北方', wuxing: '水', title: '起步，不多，尚可', detail: '成中有缺，适合起步' },
    { name: '空亡', liushou: '勾陈', yinyang: '阴', fangwei: '中央', wuxing: '土', title: '失去，虚伪，空想', detail: '先得再失，尤忌金钱事，可多接触玄学，哲学，心理学' }
]

const JIUGONGS = [
    {
        name: '大安', bagua: '震', wuxing: '木', fangwei: '正东', xing: '三清', title: '长期，缓慢，稳定', detail: '求安稳，大安最吉；求变化，大安不吉'
    },
    {
        name: '留连', bagua: '巽', wuxing: '木', fangwei: '东南', xing: '文昌', title: '停止，反复，复杂', detail: '想挽留，留连是吉；否则都很恶心'
    },
    { name: '速喜', bagua: '离', wuxing: '火', fangwei: '正南', xing: '雷祖', title: '惊喜，快速，突然', detail: '意想不到的好事' },
    { name: '赤口', bagua: '兑', wuxing: '金', fangwei: '正西', xing: '将帅', title: '争斗，凶恶，伤害', detail: '吵架，打架，斗争，诉讼是非，肉体受伤，尤其赤口叠现' },
    { name: '小吉', bagua: '坎', wuxing: '水', fangwei: '正北', xing: '真武', title: '起步，不多，尚可', detail: '成中有缺，适合起步' },
    { name: '空亡', bagua: '中', wuxing: '土', fangwei: '内', xing: '玉皇', title: '失去，虚伪，空想', detail: '先得再失，尤忌金钱事，可多接触玄学，哲学，心理学' },
    { name: '病符', bagua: '坤', wuxing: '土', fangwei: '西南', xing: '后土', title: '病态，异常，治疗', detail: '先有病，才需要“治”' },
    { name: '桃花', bagua: '艮', wuxing: '土', fangwei: '东北', xing: '城隍', title: '欲望，牵绊，异性', detail: '人际关系，牵绊此事' },
    { name: '天德', bagua: '乾', wuxing: '金', fangwei: '西北', xing: '紫微', title: '贵人，上司，高远', detail: '求人办事，靠人成事' }
]

module.exports = { LICHUNFENGS, JIUGONGS, LICHUNFENGLIUQINMAP, JIUGONGLIUQINMAP }