const GONGS = ['命宫', '兄弟', '夫妻', '子女', '财帛', '疾厄', '迁移', '仆役', '官禄', '田宅', '福德', '父母']
const DUIGONGMAP = {
    '命宫': '迁移', '兄弟': '仆役', '夫妻': '官禄', '子女': '田宅', '财帛': '福德', '疾厄': '父母', '迁移': '命宫', '仆役': '兄弟', '官禄': '夫妻', '田宅': '子女', '福德': '财帛', '父母': '疾厄'
}
const SIHUAMAP = {
    '甲': { '廉贞': '禄', '破军': '权', '武曲': '科', '太阳': '忌' },
    '乙': { '天机': '禄', '天梁': '权', '紫微': '科', '太阴': '忌' },
    '丙': { '天同': '禄', '天机': '权', '文昌': '科', '廉贞': '忌' },
    '丁': { '太阴': '禄', '天同': '权', '天机': '科', '巨门': '忌' },
    '戊': { '贪狼': '禄', '太阴': '权', '右弼': '科', '天机': '忌' },
    '己': { '武曲': '禄', '贪狼': '权', '天梁': '科', '文曲': '忌' },
    '庚': { '太阳': '禄', '武曲': '权', '太阴': '科', '天同': '忌' },
    '辛': { '巨门': '禄', '太阳': '权', '文曲': '科', '文昌': '忌' },
    '壬': { '天梁': '禄', '紫微': '权', '左辅': '科', '武曲': '忌' },
    '癸': { '破军': '禄', '巨门': '权', '太阴': '科', '贪狼': '忌' }
}

module.exports = { GONGS, DUIGONGMAP, SIHUAMAP }